README.org
:PROPERTIES:
:ID:       e83f4c4d-881d-4cb4-975c-3776d03d82b1
:END:
#+title: ClusterSetup
#+date: [2026-03-14 Sat 00:35]
#+AUTHOR: Cisco Ramon
#+DESCRIPTION: Building a mini HPC cluster environment using Rocky Linux, VirtualBox, Slurm, MPI, and OpenMP
#+STARTUP: overview
#+OPTIONS: toc:2 num:t
#+PROPERTY: header-args :results output
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/html-theme-readtheorg.setup
#+HTML_HEAD: <style> pre.src { font-size: 15px !important;} code { font-size: 15px !important;} </style>
#+LATEX_HEADER: \hypersetup{
#+LATEX_HEADER:     colorlinks=true,
#+LATEX_HEADER:     linkcolor=black,
#+LATEX_HEADER:     filecolor=black,
#+LATEX_HEADER:     urlcolor=blue,
#+LATEX_HEADER:     citecolor=black,
#+LATEX_HEADER:     pdfborder={0 0 0}
#+LATEX_HEADER: }
#+LATEX_HEADER: \usepackage{tocloft}
#+LATEX_HEADER: \cftsetindents{section}{0em}{3em}
#+LATEX_HEADER: \cftsetindents{subsection}{1.5em}{4em}
#+LATEX_HEADER: \cftsetindents{subsubsection}{3.5em}{5em}

