README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-26 Tue 15:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ClusterSetup</title>
<meta name="author" content="Cisco Ramon" />
<meta name="description" content="Building a mini HPC cluster environment using Rocky Linux, VirtualBox, Slurm, MPI, and OpenMP" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/code-copy.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">ClusterSetup</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbb65867">1. Abstract</a></li>
<li><a href="#org0b7f4fa">2. Preface</a></li>
<li><a href="#org5fb3538">3. About the Author</a></li>
<li><a href="#orgdad160f">4. Introduction</a></li>
<li><a href="#org8f9e979">5. Cluster Architecture</a></li>
<li><a href="#orgdbd52d2">6. Node Details</a>
<ul>
<li><a href="#org060dcab">6.1. Node Role</a></li>
<li><a href="#org00f06eb">6.2. Networking Setup</a></li>
<li><a href="#orgb9b36f5">6.3. Static IP Addressing</a></li>
</ul>
</li>
<li><a href="#org1186942">7. Resource Allocation</a>
<ul>
<li><a href="#org11ce72f">7.1. Master Node</a></li>
<li><a href="#org6c7802b">7.2. Login Node</a></li>
<li><a href="#orgdb7f949">7.3. Compute Nodes</a></li>
</ul>
</li>
<li><a href="#org093401e">8. Master Node Setup</a>
<ul>
<li><a href="#org6dd0625">8.1. Install VirtualBox on Manjaro</a></li>
<li><a href="#orgdab8913">8.2. Download Rocky Linux</a></li>
<li><a href="#org9abf476">8.3. Create Master VM</a></li>
<li><a href="#org7ce69c6">8.4. Network Configuration</a></li>
<li><a href="#org50234bc">8.5. Rocky Linux Installation</a></li>
<li><a href="#org9533e52">8.6. Initial System Verification</a></li>
<li><a href="#org0f8e06c">8.7. Configure Static Internal Network</a></li>
<li><a href="#org0a3d507">8.8. Configure Internal Interface</a></li>
<li><a href="#org34250aa">8.9. Restart Networking</a></li>
<li><a href="#orgac93629">8.10. Verify Networking</a></li>
<li><a href="#orgb583409">8.11. SSH Access from Host</a></li>
<li><a href="#orgcecc143">8.12. System Update and Packages</a></li>
<li><a href="#org85b2419">8.13. Timezone Configuration</a></li>
<li><a href="#orgede47fc">8.14. Configure /etc/hosts</a></li>
<li><a href="#orgc654e90">8.15. Disable Firewall (Temporary)</a></li>
<li><a href="#org7a6dc6f">8.16. SELinux Configuration</a></li>
<li><a href="#org99ee47b">8.17. Verify Hostname</a></li>
</ul>
</li>
<li><a href="#org8480419">9. Cloning Nodes</a>
<ul>
<li><a href="#org12357e9">9.1. Create Snapshot</a></li>
<li><a href="#orgbfc56ae">9.2. Clone Nodes</a></li>
<li><a href="#org148d709">9.3. Clone Names</a></li>
<li><a href="#orgb0398f0">9.4. Configure Port Forwarding</a></li>
<li><a href="#orgdc045da">9.5. Machine ID Regeneration</a></li>
<li><a href="#org26c9c6e">9.6. Remove Existing Machine ID</a></li>
<li><a href="#org3bade97">9.7. Generate New Machine ID</a></li>
<li><a href="#org5d4f369">9.8. Verify Machine ID</a></li>
<li><a href="#org0649ecc">9.9. Configure Hostname</a></li>
<li><a href="#org4203f06">9.10. Configure Static Internal IPs</a></li>
<li><a href="#org7b487a6">9.11. Restart Networking</a></li>
<li><a href="#org158c257">9.12. Verify Networking</a></li>
<li><a href="#orgaefe425">9.13. Verify Routing</a></li>
<li><a href="#org68a8de5">9.14. Verify Connectivity</a></li>
<li><a href="#org0ec7e07">9.15. SSH Verification</a></li>
</ul>
</li>
<li><a href="#orgfa2f013">10. Shared Infrastructure Services</a>
<ul>
<li><a href="#org49e8751">10.1. Cluster Role Architecture</a></li>
<li><a href="#org3d66193">10.2. Verify User Consistency</a></li>
<li><a href="#orgfcd6cb4">10.3. Passwordless SSH Configuration</a></li>
<li><a href="#org35055a3">10.4. Generate SSH Key on Login Node</a></li>
<li><a href="#org938701a">10.5. Copy SSH Keys to Cluster Nodes</a></li>
<li><a href="#org1511c11">10.6. Verify Passwordless SSH</a></li>
<li><a href="#orgbfc9a7c">10.7. HPC Concept — Why Passwordless SSH Matters</a></li>
<li><a href="#org2f76b87">10.8. NFS Shared Storage Setup</a></li>
<li><a href="#org93f30a9">10.9. Install NFS Packages</a></li>
<li><a href="#orgdee3859">10.10. Configure NFS Server on Master</a></li>
<li><a href="#org92d91b5">10.11. Enable NFS Services</a></li>
<li><a href="#orge1bf621">10.12. Configure NFS Exports</a></li>
<li><a href="#org5a0c56a">10.13. Export Option Explanation</a></li>
<li><a href="#org45e41fa">10.14. Apply Exports</a></li>
<li><a href="#org62fb0fe">10.15. Verify Exports</a></li>
<li><a href="#org9029016">10.16. Configure NFS Clients</a></li>
<li><a href="#orge17f7f7">10.17. Backup Existing Home Directory</a></li>
<li><a href="#org6e641c8">10.18. Create New Mount Point</a></li>
<li><a href="#org19152a9">10.19. Mount Shared NFS Home</a></li>
<li><a href="#orgfae1b42">10.20. Verify Mount</a></li>
<li><a href="#org32953f5">10.21. Verify Shared Filesystem</a></li>
<li><a href="#orgad2d0bf">10.22. Configure Persistent NFS Mounts</a></li>
<li><a href="#org1c671ef">10.23. Configure /etc/fstab</a></li>
<li><a href="#org64632e5">10.24. Verify fstab Before Reboot</a></li>
<li><a href="#org53b550a">10.25. Reboot Validation Procedure</a></li>
<li><a href="#orgc3c5f2a">10.26. Reboot Order</a></li>
<li><a href="#org0bb9c56">10.27. Verify Persistent Mounts After Reboot</a></li>
<li><a href="#org78c1e32">10.28. Verify Active NFS Mount</a></li>
<li><a href="#org8b170bf">10.29. Verify Shared Files After Reboot</a></li>
</ul>
</li>
<li><a href="#org98e686e">11. Munge Authentication + Slurm Scheduler</a>
<ul>
<li><a href="#org92e2c91">11.1. HPC Scheduler Architecture</a></li>
<li><a href="#orgcd0f57b">11.2. IMPORTANT Rocky Linux 10 Issue</a></li>
<li><a href="#orgbb8ca8a">11.3. Install EPEL Repository</a></li>
<li><a href="#orgf70cff6">11.4. Enable CRB Repository</a></li>
<li><a href="#org94f3913">11.5. Install Munge + Slurm Packages</a></li>
<li><a href="#org3b86ee9">11.6. Verify Installed Packages</a></li>
<li><a href="#org27e3ff3">11.7. Verify System Users</a></li>
<li><a href="#org69de3c4">11.8. IMPORTANT Issue Encountered — Missing slurm User</a></li>
<li><a href="#orgb5f8bdb">11.9. Create Slurm Group</a></li>
<li><a href="#org15c49a0">11.10. Create Slurm User</a></li>
<li><a href="#orgbb0aa39">11.11. Verify Slurm User</a></li>
<li><a href="#orgadb2599">11.12. IMPORTANT HPC Security Concept</a></li>
<li><a href="#orgf97f031">11.13. Configure Munge Authentication</a></li>
<li><a href="#org040b752">11.14. Generate Munge Key on Master</a></li>
<li><a href="#org4bf7c97">11.15. Verify Munge Key</a></li>
<li><a href="#org4eebf14">11.16. IMPORTANT Mistake Encountered — Munge Key Generated on All Nodes</a></li>
<li><a href="#org0b9059f">11.17. Correct Munge Key Distribution</a></li>
<li><a href="#org3e98449">11.18. IMPORTANT SSH Root Login Issue</a></li>
<li><a href="#orga3febcd">11.19. Copy Munge Key to Login Node</a></li>
<li><a href="#org108314a">11.20. Copy Munge Key to Compute01</a></li>
<li><a href="#org6094168">11.21. Copy Munge Key to Compute02</a></li>
<li><a href="#org955292a">11.22. Copy Munge Key to Compute03</a></li>
<li><a href="#org322ac43">11.23. Remove Temporary Key Copy</a></li>
<li><a href="#org90c04c6">11.24. Install Munge Key on Client Nodes</a></li>
<li><a href="#org5d6111d">11.25. Stop Munge Service</a></li>
<li><a href="#org4c373ec">11.26. Install Key</a></li>
<li><a href="#org4669fdf">11.27. Fix Ownership</a></li>
<li><a href="#org7899a48">11.28. Fix Permissions</a></li>
<li><a href="#orged2f2ac">11.29. Start Munge</a></li>
<li><a href="#org565712f">11.30. IMPORTANT Issue Encountered — Munge Not Running on Master</a></li>
<li><a href="#orga46c5f5">11.31. Verify Munge Service</a></li>
<li><a href="#orgb389ab3">11.32. Verify Munge Authentication</a></li>
<li><a href="#orgea24ebf">11.33. Test Compute02</a></li>
<li><a href="#orgc5b77a7">11.34. Test Compute03</a></li>
<li><a href="#orgd5e84df">11.35. Test Login Node</a></li>
<li><a href="#orga1312be">11.36. HPC Concepts Learned</a></li>
<li><a href="#org109c94d">11.37. Configure Slurm Scheduler</a></li>
<li><a href="#org6691db3">11.38. IMPORTANT Issue Encountered — Default localhost Configuration</a></li>
<li><a href="#orgcf249dc">11.39. Create Slurm Configuration</a></li>
<li><a href="#orga537f0b">11.40. Configuration Explanation</a></li>
<li><a href="#orgbcdcf8c">11.41. Create Slurm Runtime Directories</a></li>
<li><a href="#orgeb110de">11.42. Set Ownership</a></li>
<li><a href="#org80e5964">11.43. Create slurmd Directories on Compute Nodes</a></li>
<li><a href="#org2de2be7">11.44. IMPORTANT sudo Over SSH Issue</a></li>
<li><a href="#org1d771b0">11.45. Fix Ownership on Compute Nodes</a></li>
<li><a href="#org0818501">11.46. Verify Runtime Directories</a></li>
<li><a href="#orgd64a468">11.47. Distribute slurm.conf</a></li>
<li><a href="#orge8a7688">11.48. Install Configuration on Nodes</a></li>
<li><a href="#org218d434">11.49. Start Slurm Controller</a></li>
<li><a href="#org147409f">11.50. Verify Controller</a></li>
<li><a href="#org8fa168c">11.51. Start slurmd on Compute Nodes</a></li>
<li><a href="#org75ce03c">11.52. Verify slurmd</a></li>
<li><a href="#org733c92c">11.53. Reconfigure Slurm</a></li>
<li><a href="#orgebc79d1">11.54. IMPORTANT Issue Encountered — Nodes in DRAIN State</a></li>
<li><a href="#orgaa2e46e">11.55. Stop slurmd</a></li>
<li><a href="#org2008f95">11.56. Remove Old State</a></li>
<li><a href="#orgb7176e3">11.57. Restart slurmd</a></li>
<li><a href="#org2097847">11.58. Resume Nodes</a></li>
<li><a href="#org3ebb772">11.59. Verify Cluster Status</a></li>
<li><a href="#orgf6fc7d6">11.60. Verify Node Details</a></li>
<li><a href="#org40d6901">11.61. Test Slurm Execution</a></li>
<li><a href="#org6cd8adb">11.62. Multi-node Execution</a></li>
<li><a href="#org653fc7b">11.63. Multi-task Multi-node Execution</a></li>
<li><a href="#orgdb7e395">11.64. Multi-core Single-node Execution</a></li>
<li><a href="#org8b9ff5f">11.65. IMPORTANT Slurm Scheduling Concept</a></li>
</ul>
</li>
<li><a href="#orge296905">12. Shared Software Filesystem (/apps)</a>
<ul>
<li><a href="#org444dc0d">12.1. Why Separate /apps Filesystem?</a></li>
<li><a href="#org8e21d2a">12.2. IMPORTANT Storage Architecture Concept</a></li>
<li><a href="#org549e17f">12.3. Add New Virtual Disk to Master</a></li>
<li><a href="#orga7ea767">12.4. Verify New Disk Detection</a></li>
<li><a href="#org442d5f7">12.5. Create GPT Partition Table</a></li>
<li><a href="#org544dcc7">12.6. Verify Partition</a></li>
<li><a href="#org0f07ce6">12.7. Create XFS Filesystem</a></li>
<li><a href="#orgc86cbc8">12.8. Create Mount Point</a></li>
<li><a href="#orga42bb8a">12.9. Get Filesystem UUID</a></li>
<li><a href="#orga4248db">12.10. Configure Persistent Mount</a></li>
<li><a href="#org8d93b67">12.11. Mount Filesystem</a></li>
<li><a href="#org614aa71">12.12. Verify Mount</a></li>
<li><a href="#org2473277">12.13. Configure Ownership</a></li>
<li><a href="#org9d98432">12.14. Create Shared HPC Software Hierarchy</a></li>
<li><a href="#orge3e6647">12.15. HPC Software Hierarchy Concept</a></li>
<li><a href="#org52b326c">12.16. Export /apps via NFS</a></li>
<li><a href="#org510cd5a">12.17. Apply NFS Exports</a></li>
<li><a href="#orgeab4000">12.18. Verify Exports</a></li>
<li><a href="#org09721e2">12.19. Create Mount Points on Client Nodes</a></li>
<li><a href="#orgc78a72f">12.20. Configure Persistent NFS Mounts</a></li>
<li><a href="#org4c3bf58">12.21. Mount Shared /apps Filesystem</a></li>
<li><a href="#orgd45e06f">12.22. Verify Shared Mount</a></li>
<li><a href="#org926264c">12.23. Verify Shared Filesystem Functionality</a></li>
<li><a href="#org4c76312">12.24. HPC Architecture After /apps Setup</a></li>
</ul>
</li>
<li><a href="#orga5533da">13. Spack Software Stack + MPI Runtime Validation</a>
<ul>
<li><a href="#org6cd56a0">13.1. IMPORTANT HPC Software Stack Concept</a></li>
<li><a href="#orgd2fae9c">13.2. IMPORTANT Shared Filesystem Concept</a></li>
<li><a href="#orgf25115b">13.3. Install Development Tools</a></li>
<li><a href="#org9778fdf">13.4. Move into Shared Application Filesystem</a></li>
<li><a href="#org4332128">13.5. Clone Spack into Shared Filesystem</a></li>
<li><a href="#orgcaaebdd">13.6. Enter Spack Directory</a></li>
<li><a href="#org06ef3fa">13.7. Initialize Spack Environment</a></li>
<li><a href="#org46c2b9f">13.8. IMPORTANT Shell Environment Concept</a></li>
<li><a href="#org8cfdcdc">13.9. Make Spack Permanent</a></li>
<li><a href="#org97d4382">13.10. Clone Additional Spack Repository</a></li>
<li><a href="#org66649db">13.11. Configure Spack Repository</a></li>
<li><a href="#org912a9b4">13.12. Verify Spack Functionality</a></li>
<li><a href="#org841984b">13.13. IMPORTANT HPC Software Stack Concept</a></li>
<li><a href="#org56090f0">13.14. IMPORTANT Spack Build Concept</a></li>
<li><a href="#org2bedc9a">13.15. Detect Available Compilers</a></li>
<li><a href="#orgde434d2">13.16. Install GCC Using Spack</a></li>
<li><a href="#org4c66a1c">13.17. IMPORTANT Multiple Compiler Version Concept</a></li>
<li><a href="#org23b51dd">13.18. Verify Installed Software</a></li>
<li><a href="#org00753d7">13.19. Load Installed GCC Compiler</a></li>
<li><a href="#orgb1b398d">13.20. IMPORTANT Runtime Environment Concept</a></li>
<li><a href="#org5dcaf36">13.21. Register Newly Installed Compiler</a></li>
<li><a href="#orgcb7e0ad">13.22. Install OpenMPI Using Spack</a></li>
<li><a href="#org6373901">13.23. IMPORTANT MPI Compiler Dependency Concept</a></li>
<li><a href="#orge0cb3ff">13.24. Verify Installed Software Tree</a></li>
<li><a href="#org50f8638">13.25. IMPORTANT Spack Spec Concept</a></li>
<li><a href="#org2487268">13.26. IMPORTANT Hash-Based Software Loading</a></li>
<li><a href="#org37e915f">13.27. Load OpenMPI Environment</a></li>
<li><a href="#org72eb78d">13.28. IMPORTANT MPI Wrapper Concept</a></li>
<li><a href="#orga147439">13.29. Verify Loaded Software</a></li>
<li><a href="#org4876412">13.30. Create MPI Performance Validation Program</a></li>
<li><a href="#orgdf17d54">13.31. IMPORTANT MPI Reduction Concept</a></li>
<li><a href="#orgd29063a">13.32. IMPORTANT Parallel Execution Concept</a></li>
<li><a href="#org8f178a2">13.33. Load Software Before Compilation</a></li>
<li><a href="#org793b951">13.34. Compile MPI Program</a></li>
<li><a href="#orgcebb222">13.35. IMPORTANT MPI Compilation Concept</a></li>
<li><a href="#org95afdfd">13.36. Interactive MPI Runtime Validation</a></li>
<li><a href="#org82253a9">13.37. IMPORTANT Shared Filesystem Advantage</a></li>
<li><a href="#orga6a1ab2">13.38. Create Slurm Batch Script</a></li>
<li><a href="#org90773bc">13.39. IMPORTANT Slurm Script Explanation</a></li>
<li><a href="#org97a810e">13.40. IMPORTANT Runtime Environment Section</a></li>
<li><a href="#org55beba7">13.41. IMPORTANT Slurm Runtime Variable</a></li>
<li><a href="#org92e900e">13.42. Submit MPI Job</a></li>
<li><a href="#orgfe22644">13.43. Monitor Jobs</a></li>
<li><a href="#org19ac3be">13.44. IMPORTANT Job States</a></li>
<li><a href="#org068088f">13.45. View Detailed Job Information</a></li>
<li><a href="#org36c3836">13.46. Check Cluster Status</a></li>
<li><a href="#orge03325f">13.47. IMPORTANT Node States</a></li>
<li><a href="#org291f243">13.48. Check Output Files</a></li>
<li><a href="#org433dbb8">13.49. IMPORTANT HPC Performance Metrics</a></li>
<li><a href="#org3b16ee9">13.50. Cancel Jobs</a></li>
<li><a href="#orgae15d4f">13.51. Interactive Slurm Execution</a></li>
<li><a href="#orgd6ae080">13.52. IMPORTANT HPC Workflow</a></li>
<li><a href="#org2257d6a">13.53. IMPORTANT Production HPC Concept</a></li>
</ul>
</li>
<li><a href="#orge06eed9">14. Centralized Identity Management using OpenLDAP + nslcd</a>
<ul>
<li><a href="#org6208970">14.1. Important Architecture</a></li>
<li><a href="#org44ac12c">14.2. Important Linux Authentication Concepts</a></li>
<li><a href="#orgffd4018">14.3. Install OpenLDAP Server on Master Node</a></li>
<li><a href="#orgbcaf1ff">14.4. Enable LDAP Server</a></li>
<li><a href="#orgd5256de">14.5. Generate LDAP Admin Password Hash</a></li>
<li><a href="#orgcc2215e">14.6. Configure LDAP Database</a></li>
<li><a href="#orgae97c71">14.7. Important LDAP Concepts</a></li>
<li><a href="#org8dd49a0">14.8. Apply LDAP Database Configuration</a></li>
<li><a href="#org044e749">14.9. Import LDAP Schemas</a></li>
<li><a href="#org87db5cb">14.10. Create LDAP Base Tree</a></li>
<li><a href="#org700ca61">14.11. Verify LDAP Tree</a></li>
<li><a href="#org606dde9">14.12. Create LDAP Group</a></li>
<li><a href="#org5cd59f8">14.13. Create LDAP User Password Hash</a></li>
<li><a href="#org171d0ff">14.14. Create LDAP User</a></li>
<li><a href="#orge905198">14.15. Important LDAP User Attributes</a></li>
<li><a href="#org652f50b">14.16. Verify LDAP User</a></li>
<li><a href="#org5266d0d">14.17. Configure LDAP Client on Login Node</a></li>
<li><a href="#org120377b">14.18. Configure nslcd</a></li>
<li><a href="#orgbe33600">14.19. Enable nslcd</a></li>
<li><a href="#orgcbae711">14.20. Verify LDAP Connectivity</a></li>
<li><a href="#orgda3d12a">14.21. Configure NSS</a></li>
<li><a href="#orgf3a85ee">14.22. Restart nslcd</a></li>
<li><a href="#org964d40d">14.23. Verify LDAP User Resolution</a></li>
<li><a href="#org5e79cf2">14.24. NOTE (Do this for master too)</a></li>
<li><a href="#orgfcfa47c">14.25. Install Automatic Home Directory Support</a></li>
<li><a href="#orgef7d6dc">14.26. Configure PAM Authentication</a></li>
<li><a href="#orgceb1042">14.27. Configure Second PAM File</a></li>
<li><a href="#orga7b1309">14.28. Restart Services</a></li>
<li><a href="#org4c772f9">14.29. Verify LDAP Authentication</a></li>
<li><a href="#orgd4e7adc">14.30. Verify User Home</a></li>
<li><a href="#orgb7f925d">14.31. Troubleshooting</a></li>
<li><a href="#orgda55d7d">14.32. Current Cluster State After LDAP Setup</a></li>
<li><a href="#org20e5da0">14.33. Important Debugging Commands</a></li>
<li><a href="#org54f1555">14.34. Important Architecture Understanding</a></li>
</ul>
</li>
<li><a href="#org39793a3">15. Automated LDAP User Creation Script</a>
<ul>
<li><a href="#orgad9c1d7">15.1. Script Location</a></li>
<li><a href="#orga5d4a57">15.2. User Creation Script</a></li>
<li><a href="#orgab45c2c">15.3. Make Script Executable</a></li>
<li><a href="#org0a89f4e">15.4. Understanding Script Arguments</a></li>
<li><a href="#org7701444">15.5. Default Password Format</a></li>
<li><a href="#org7c95d58">15.6. What the Script Automatically Does</a></li>
<li><a href="#org0175d6f">15.7. Example User Creation</a></li>
<li><a href="#org4c50915">15.8. Verify User Creation</a></li>
<li><a href="#org3e1b4be">15.9. Verify Login</a></li>
<li><a href="#orgd2b701e">15.10. Important UID/GID Notes</a></li>
<li><a href="#org3a2c568">15.11. Important HPC Identity Concept</a></li>
</ul>
</li>
<li><a href="#orgbc0a4b4">16. Automated LDAP User Deletion Script</a>
<ul>
<li><a href="#orgcd82b2f">16.1. Script Location</a></li>
<li><a href="#org8fda461">16.2. User Deletion Script</a></li>
<li><a href="#org15e57fb">16.3. Make Script Executable</a></li>
<li><a href="#orgc03d786">16.4. Understanding Script Arguments</a></li>
<li><a href="#orge85f01e">16.5. What the Script Automatically Does</a></li>
<li><a href="#org6399b43">16.6. Example User Deletion</a></li>
<li><a href="#org4f486d5">16.7. Important Group Deletion Notes</a></li>
<li><a href="#org09c97e8">16.8. Important Home Directory Notes</a></li>
<li><a href="#org92c99da">16.9. Verify User Removal</a></li>
<li><a href="#org06363a9">16.10. Important HPC User Management Concept</a></li>
</ul>
</li>
<li><a href="#orgf889003">17. Automated LDAP Password Change Script</a>
<ul>
<li><a href="#org896cbf9">17.1. Script Location</a></li>
<li><a href="#org5593364">17.2. Password Change Script</a></li>
<li><a href="#org8f7d525">17.3. Make Script Executable</a></li>
<li><a href="#orgef8ce20">17.4. Understanding Script Arguments</a></li>
<li><a href="#orgaba22e6">17.5. What the Script Automatically Does</a></li>
<li><a href="#orgea30425">17.6. Example Password Change</a></li>
<li><a href="#org4096e10">17.7. Verify Password Change</a></li>
<li><a href="#orga805e97">17.8. Important Password Management Notes</a></li>
</ul>
</li>
<li><a href="#orgb519e02">18. Advanced Slurm Configuration Preparation</a>
<ul>
<li><a href="#org77badf2">18.1. IMPORTANT APPROACH</a></li>
<li><a href="#orge7ea2c1">18.2. Advanced Slurm Roadmap</a></li>
<li><a href="#org89f3477">18.3. Resource-Aware Scheduling</a></li>
<li><a href="#org3f30968">18.4. Understanding Current Cluster Resource State</a></li>
<li><a href="#org919f701">18.5. Understanding Actual Node Memory</a></li>
<li><a href="#org28cebf9">18.6. Configuring RealMemory</a></li>
<li><a href="#org7ed8d4c">18.7. RealMemory Concept</a></li>
<li><a href="#org4694a3c">18.8. Resource-Aware Scheduling Concept</a></li>
<li><a href="#org4621fb2">18.9. Scheduler Configuration Enhancements</a></li>
<li><a href="#org255669c">18.10. Configuration Explanation</a></li>
<li><a href="#orgdca0185">18.11. Distributing Updated Slurm Configuration</a></li>
<li><a href="#orgb1001ff">18.12. Restarting Slurm Services</a></li>
<li><a href="#org8756a05">18.13. Verifying Cluster Health</a></li>
<li><a href="#org25a4b73">18.14. Difference Between Scheduling and Enforcement</a></li>
<li><a href="#orgcfe8fd3">18.15. Why task/cgroup Was Postponed</a></li>
<li><a href="#org0e5e4bd">18.16. Process Tracking Note</a></li>
<li><a href="#org761c04f">18.17. Verifying Stable Job Execution</a></li>
<li><a href="#org1211002">18.18. Milestone Achieved</a></li>
</ul>
</li>
<li><a href="#org0944a73">19. Advanced Slurm Configuration</a>
<ul>
<li><a href="#orgab73574">19.1. IMPORTANT APPROACH</a></li>
<li><a href="#orgf6b6985">19.2. Current Cluster State Before Advanced Configuration</a></li>
<li><a href="#org43b158e">19.3. Resource-Aware Scheduling</a></li>
<li><a href="#org3f9bc7d">19.4. CPU Affinity and Task Binding</a></li>
<li><a href="#org03aebe1">19.5. Understanding CPU Topology</a></li>
<li><a href="#org57a45f2">19.6. CPU Affinity Validation Program</a></li>
<li><a href="#orgd8d92dd">19.7. Distributed CPU Placement Test</a></li>
<li><a href="#org0f6c9e6">19.8. Multiple Task Placement Test</a></li>
<li><a href="#org442ba7b">19.9. Explicit CPU Binding</a></li>
<li><a href="#orgbc23133">19.10. Slurm Accounting Database Setup</a></li>
<li><a href="#org3a1cda0">19.11. Install MariaDB</a></li>
<li><a href="#org51fec97">19.12. Secure MariaDB</a></li>
<li><a href="#org59a7317">19.13. Create Slurm Accounting Database</a></li>
<li><a href="#org251e479">19.14. Install Slurm Accounting Daemon</a></li>
<li><a href="#orga98ca3f">19.15. Configure slurmdbd</a></li>
<li><a href="#org4c1ac6a">19.16. Connect Slurm With Accounting System</a></li>
<li><a href="#org781dd63">19.17. Restart Slurm Services</a></li>
<li><a href="#org8d6d02d">19.18. Verify Accounting Infrastructure</a></li>
<li><a href="#orgd403ad2">19.19. Verify Persistent Job Accounting</a></li>
<li><a href="#org266057e">19.20. IMPORTANT MPI Accounting Observation</a></li>
<li><a href="#org8b9221b">19.21. Current Cluster Capability</a></li>
</ul>
</li>
<li><a href="#org975fbc8">20. QoS + User Limits + Scheduling Policies</a>
<ul>
<li><a href="#org180f062">20.1. IMPORTANT CONCEPT</a></li>
<li><a href="#org0890e0f">20.2. IMPORTANT Slurm Scheduling Hierarchy</a></li>
<li><a href="#orgf95e884">20.3. Existing Stable Accounting Infrastructure</a></li>
<li><a href="#org4c709e0">20.4. Understanding QoS</a></li>
<li><a href="#org8c79203">20.5. IMPORTANT QoS Concept</a></li>
<li><a href="#orgd27d8f0">20.6. Verify Cluster Registration</a></li>
<li><a href="#orgaff746d">20.7. Create Slurm Account</a></li>
<li><a href="#orgd0df1c7">20.8. IMPORTANT Account Concept</a></li>
<li><a href="#org4267767">20.9. Add Users to Slurm Accounting</a></li>
<li><a href="#org02bfc89">20.10. Create QoS Policy</a></li>
<li><a href="#orgef4cf62">20.11. Configure QoS Limits</a></li>
<li><a href="#org77b2abd">20.12. Attach QoS to Account</a></li>
<li><a href="#org234266f">20.13. Verify Associations</a></li>
<li><a href="#org5a303f3">20.14. IMPORTANT ISSUE FACED</a></li>
<li><a href="#org5537c34">20.15. Root Cause of QoS Enforcement Failure</a></li>
<li><a href="#orge6f8644">20.16. Enable QoS Enforcement</a></li>
<li><a href="#org739c0ac">20.17. IMPORTANT Enforcement Concept</a></li>
<li><a href="#org8f7e3e8">20.18. Distribute Updated Configuration</a></li>
<li><a href="#orgae20f4e">20.19. Restart Slurm Services</a></li>
<li><a href="#org57c6b22">20.20. Verify Cluster Health</a></li>
<li><a href="#org604ac90">20.21. Verify QoS Enforcement</a></li>
<li><a href="#org0bbc5ef">20.22. Verify Valid CPU Allocation</a></li>
<li><a href="#orgf8d9570">20.23. IMPORTANT MPI + QoS Integration</a></li>
<li><a href="#orgc70a43d">20.24. Verify Walltime Enforcement</a></li>
<li><a href="#org06b019b">20.25. IMPORTANT Pending Queue Concept</a></li>
<li><a href="#org0e1c5d3">20.26. Inspect QoS Configuration</a></li>
<li><a href="#org7a84ff2">20.27. IMPORTANT Scheduler Layers</a></li>
<li><a href="#org0f72752">20.28. Current Cluster Capability</a></li>
</ul>
</li>
<li><a href="#orgfb5def5">21. Validation and Verification of Advanced Slurm Configuration and QoS</a>
<ul>
<li><a href="#org5a29988">21.1. Cluster Validation State</a></li>
<li><a href="#org59b89a7">21.2. Verify Cluster Health</a></li>
<li><a href="#orgd931f3b">21.3. Verify Node Resource Recognition</a></li>
<li><a href="#orgc886217">21.4. Verify Accounting Infrastructure</a></li>
<li><a href="#orgc360d3d">21.5. Verify Cluster Accounting Registration</a></li>
<li><a href="#orgcdc4b08">21.6. Verify Accounts and User Associations</a></li>
<li><a href="#orgd440f7c">21.7. Verify QoS Configuration</a></li>
<li><a href="#org8849a89">21.8. IMPORTANT Validation Issue Faced</a></li>
<li><a href="#orgb1b4049">21.9. Root Cause Analysis</a></li>
<li><a href="#orgb4d59ee">21.10. Fix Applied</a></li>
<li><a href="#org772b76c">21.11. MPI Validation Program</a></li>
<li><a href="#org142cfb6">21.12. Validation Job Script</a></li>
<li><a href="#orgb3d67c1">21.13. Verify Successful MPI Execution</a></li>
<li><a href="#orgde470c1">21.14. Verify Scheduler Environment Variables</a></li>
<li><a href="#org7fa2009">21.15. Verify CPU QoS Enforcement</a></li>
<li><a href="#org1c427bd">21.16. IMPORTANT CPU QoS Concept</a></li>
<li><a href="#org2ebef0a">21.17. Verify Walltime Enforcement</a></li>
<li><a href="#org7d50808">21.18. Verify Job Count Enforcement</a></li>
<li><a href="#orga0a19d4">21.19. Verify Accounting Persistence</a></li>
<li><a href="#org4d29d9d">21.20. IMPORTANT MPI Accounting Observation</a></li>
<li><a href="#orgc24cb26">21.21. Final Validation State</a></li>
<li><a href="#org9b4c491">21.22. Validation Conclusion</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgbb65867" class="outline-2">
<h2 id="orgbb65867"><span class="section-number-2">1.</span> Abstract</h2>
<div class="outline-text-2" id="text-1">
<p>
This documentation presents the complete setup and configuration of a
lightweight High Performance Computing (HPC) cluster environment using
Rocky Linux and VirtualBox. The guide covers practical implementation
of core HPC infrastructure components including shared storage, Slurm
workload management, LDAP-based centralized authentication, MPI runtime
environment, and centralized software stack management using Spack.
</p>

<p>
The cluster environment supports multinode job execution, centralized
software distribution, distributed MPI applications, and scheduler-aware
runtime execution. The setup follows real-world HPC concepts while
remaining suitable for learning, experimentation, and practical hands-on
training.
</p>
</div>
</div>
