README.html
<div id="outline-container-org0b7f4fa" class="outline-2">
<h2 id="org0b7f4fa"><span class="section-number-2">2.</span> Preface</h2>
<div class="outline-text-2" id="text-2">
<p>
This documentation was prepared with the assistance of AI tools for:
</p>

<ul class="org-ul">
<li>structuring</li>
<li>formatting</li>
<li>workflow organization</li>
<li>command documentation</li>
<li>concept explanations</li>
</ul>

<p>
However, the complete HPC cluster setup, configuration, testing, and
validation were performed manually by me in a fully working VirtualBox
based cluster environment.
</p>

<p>
All commands, scripts, workflows, and configurations documented in this
guide were tested successfully during the setup process, including:
</p>

<ul class="org-ul">
<li>cluster networking</li>
<li>shared storage</li>
<li>NFS configuration</li>
<li>Slurm workload manager</li>
<li>LDAP authentication</li>
<li>centralized user management</li>
<li>Spack software stack</li>
<li>MPI runtime environment</li>
<li>multinode execution</li>
</ul>

<p>
This guide is intended for:
</p>

<ul class="org-ul">
<li>students</li>
<li>beginners</li>
<li>Linux learners</li>
<li>HPC enthusiasts</li>
<li>system administrators</li>
<li>researchers</li>
</ul>

<p>
who want practical hands-on experience in:
</p>

<ul class="org-ul">
<li>HPC infrastructure setup</li>
<li>cluster administration</li>
<li>workload scheduling</li>
<li>centralized authentication</li>
<li>parallel programming</li>
<li>MPI execution</li>
<li>software stack management</li>
</ul>

<p>
The goal of this documentation is not only to provide commands, but
also to explain the practical concepts behind real HPC environments in a
simple and beginner-friendly manner.
</p>
</div>
</div>
<div id="outline-container-org5fb3538" class="outline-2">
<h2 id="org5fb3538"><span class="section-number-2">3.</span> About the Author</h2>
<div class="outline-text-2" id="text-3">
<p>
Hi👋, I&rsquo;m Abhishek Raj
</p>

<p>
I work in the field of High Performance Computing (HPC), Linux systems,
parallel programming, and scientific computing with experience in HPC
application optimization and distributed computing environments,
including the PARAM series of supercomputers.
</p>

<p>
My primary areas of interest include:
</p>

<ul class="org-ul">
<li>HPC clusters and infrastructure</li>
<li>Linux systems and administration</li>
<li>MPI, OpenMP, CUDA, and OpenACC</li>
<li>scientific and research workloads</li>
<li>distributed systems</li>
<li>software optimization and performance tuning</li>
<li>automation and reproducible environments</li>
</ul>

<p>
This project was created to gain a deeper understanding of how HPC
clusters are designed and managed internally. The objective was not only
to build a working cluster environment from scratch, but also to better
understand the complete software and infrastructure stack behind
parallel computing systems, which ultimately helps in writing and
optimizing efficient HPC applications.
</p>

<p>
GitHub Profile:
</p>

<p>
<b><a href="https://github.com/CISSSCO/">https://github.com/CISSSCO/</a></b>
</p>

<p>
LinkedIn :
</p>

<p>
<b><a href="https://www.linkedin.com/in/abhi581b">https://www.linkedin.com/in/abhi581b</a></b>
</p>

<p>
Project Repository:
</p>

<p>
<b><a href="https://github.com/CISSSCO/hpccfs">https://github.com/CISSSCO/hpccfs</a></b>
</p>

<p>
Hosted Documentation:
</p>

<p>
<b><a href="https://cisssco.github.io/hpccfs">https://cisssco.github.io/hpccfs</a></b>
</p>

<p>
Source codes, scripts, configuration files, and examples used in this
guide are available in the project repository.
</p>

<p>
For queries, suggestions, or discussions:
</p>

<p>
<b><a href="https://ciscoramon.netlify.app/">https://ciscoramon.netlify.app/</a></b>
</p>

<p>
If you encounter any issue in the documentation, setup process, or
configuration steps, feel free to create an issue in the GitHub
repository.
</p>
</div>
</div>
<div id="outline-container-orgdad160f" class="outline-2">
<h2 id="orgdad160f"><span class="section-number-2">4.</span> Introduction</h2>
<div class="outline-text-2" id="text-4">
<p>
High Performance Computing (HPC) clusters are distributed computing
systems designed to execute computational workloads across multiple
machines simultaneously. Instead of relying on a single system, HPC
clusters combine multiple compute nodes to provide higher computational
capacity, scalability, and parallel execution capability.
</p>

<p>
Modern HPC environments are widely used in:
</p>

<ul class="org-ul">
<li>scientific simulations</li>
<li>engineering workloads</li>
<li>computational chemistry</li>
<li>artificial intelligence</li>
<li>machine learning</li>
<li>weather modeling</li>
<li>large-scale data analysis</li>
</ul>

<p>
A typical HPC cluster contains several important components working
together:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Component</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Login Node</td>
<td class="org-left">User access and job submission</td>
</tr>

<tr>
<td class="org-left">Compute Nodes</td>
<td class="org-left">Execute computational workloads</td>
</tr>

<tr>
<td class="org-left">Shared Storage</td>
<td class="org-left">Shared user data and software</td>
</tr>

<tr>
<td class="org-left">Scheduler</td>
<td class="org-left">Resource allocation and job management</td>
</tr>

<tr>
<td class="org-left">MPI Runtime</td>
<td class="org-left">Distributed parallel execution</td>
</tr>

<tr>
<td class="org-left">Authentication System</td>
<td class="org-left">Centralized user management</td>
</tr>
</tbody>
</table>

<p>
This guide focuses on building these components step-by-step in a small
virtualized environment using:
</p>

<ul class="org-ul">
<li>Rocky Linux</li>
<li>VirtualBox</li>
<li>Slurm</li>
<li>OpenMPI</li>
<li>LDAP</li>
<li>NFS</li>
<li>Spack</li>
</ul>

<p>
Although the setup is lightweight and designed for learning purposes,
the overall architecture closely follows concepts used in production HPC
centers and supercomputers.
</p>

<p>
Throughout this documentation, readers will gradually configure:
</p>

<ul class="org-ul">
<li>cluster networking</li>
<li>shared storage</li>
<li>centralized authentication</li>
<li>workload scheduling</li>
<li>distributed software stacks</li>
<li>MPI-based parallel execution</li>
<li>scheduler-aware job execution</li>
</ul>

<p>
The final environment provides a fully working multinode HPC cluster
capable of running distributed parallel applications across multiple
compute nodes.
</p>
</div>
</div>
<div id="outline-container-org8f9e979" class="outline-2">
<h2 id="org8f9e979"><span class="section-number-2">5.</span> Cluster Architecture</h2>
<div class="outline-text-2" id="text-5">
<p>
The cluster consists of five virtual machines connected using an internal
network.
</p>

<pre class="example" id="orgd17aa5b">
                 HOST MACHINE
                       |
         ssh -p XXXX localhost
                       |
               [ NAT Adapter ]
                       |
 ------------------------------------------------
 |               INTERNAL NETWORK               |
 |                  "hpcnet"                    |
 ------------------------------------------------

master      10.10.10.1
login       10.10.10.2
compute01   10.10.10.11
compute02   10.10.10.12
compute03   10.10.10.13
</pre>
</div>
</div>
<div id="outline-container-orgdbd52d2" class="outline-2">
<h2 id="orgdbd52d2"><span class="section-number-2">6.</span> Node Details</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org060dcab" class="outline-3">
<h3 id="org060dcab"><span class="section-number-3">6.1.</span> Node Role</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<ol class="org-ol">
<li><a id="org4932fd2"></a>Master Node<br />
<div class="outline-text-4" id="text-6-1-1">
<p>
The master node manages the overall cluster.
</p>

<p>
Main responsibilities:
</p>

<ul class="org-ul">
<li>Slurm controller</li>
<li>NFS server</li>
<li>LDAP server</li>
<li>Monitoring tools</li>
<li>Shared software stack</li>
<li>Cluster configuration</li>
</ul>
</div>
</li>
<li><a id="org7e64858"></a>Login Node<br />
<div class="outline-text-4" id="text-6-1-2">
<p>
The login node is the access point for users.
</p>

<p>
Typical tasks performed here:
</p>

<ul class="org-ul">
<li>SSH login</li>
<li>Code compilation</li>
<li>Job submission</li>
<li>Accessing shared storage</li>
</ul>
</div>
</li>
<li><a id="org3db3eb0"></a>Compute Nodes<br />
<div class="outline-text-4" id="text-6-1-3">
<p>
Compute nodes run the actual workloads.
</p>

<p>
These nodes are mainly used for:
</p>

<ul class="org-ul">
<li>MPI jobs</li>
<li>OpenMP jobs</li>
<li>Batch workloads</li>
<li>Parallel execution</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org00f06eb" class="outline-3">
<h3 id="org00f06eb"><span class="section-number-3">6.2.</span> Networking Setup</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Two network adapters are used for each VM.
</p>
</div>
<ol class="org-ol">
<li><a id="org644749a"></a>NAT Adapter<br />
<div class="outline-text-4" id="text-6-2-1">
<p>
Used for:
</p>

<ul class="org-ul">
<li>Internet access</li>
<li>Package installation</li>
<li>SSH access from host system</li>
</ul>
</div>
</li>
