README.org
*** Internal Network

Used for communication between cluster nodes.

Network name:

#+begin_example
hpcnet
#+end_example

This network is isolated and only used inside the cluster.

** Static IP Addressing

Each node uses a fixed IP address.

| VM Name   | Hostname        | Internal IP | SSH Port |
|-----------+-----------------+-------------+----------|
| master    | master.local    | 10.10.10.1  | 2221     |
| login     | login.local     | 10.10.10.2  | 2222     |
| compute01 | compute01.local | 10.10.10.11 | 2223     |
| compute02 | compute02.local | 10.10.10.12 | 2224     |
| compute03 | compute03.local | 10.10.10.13 | 2225     |

Example SSH access:

#+begin_src bash
ssh -p 2221 hpcuser@localhost
#+end_src

* Resource Allocation

The following configuration is enough for a lightweight HPC lab.
You can increase resources later depending on your host system.
** Master Node

| Resource | Value |
|----------+-------|
| RAM      | 2 GB  |
| CPU      | 2     |
| Disk     | 30 GB |

** Login Node

| Resource | Value |
|----------+-------|
| RAM      | 2 GB  |
| CPU      | 2     |
| Disk     | 25 GB |

** Compute Nodes

| Resource | Value |
|----------+-------|
| RAM      | 2 GB  |
| CPU      | 2     |
| Disk     | 20 GB |

* Master Node Setup

This section covers the complete setup of the master node. The master node
acts as the central management node of the cluster.

Main responsibilities:

- Cluster management
- Shared storage
- Slurm controller
- Monitoring services
- User authentication
- Software management
  
** Install VirtualBox on Manjaro

I'm using Manjaro (Arch) as my base system.
*** Update packages

#+begin_src bash
sudo pacman -Syu
#+end_src

*** Install VirtualBox and host modules

#+begin_src bash
sudo pacman -S virtualbox virtualbox-host-modules-arch
#+end_src

*** Install VirtualBox extension pack

#+begin_src bash
sudo pacman -S virtualbox-ext-oracle
#+end_src

*** Load VirtualBox kernel module

#+begin_src bash
sudo modprobe vboxdrv
#+end_src

*** Add current user to VirtualBox group

#+begin_src bash
sudo usermod -aG vboxusers $USER
#+end_src

*** Reboot the system

#+begin_src bash
sudo reboot
#+end_src

** Download Rocky Linux

Download Rocky Linux Minimal ISO:

https://rockylinux.org/download

Choose:

- x86_64
- Minimal ISO
  
The minimal installation keeps the environment lightweight and avoids
unnecessary packages.
** Create Master VM

Open VirtualBox and create a new virtual machine.
*** VM Name

#+begin_example
master
#+end_example

*** Type

#+begin_example
Linux
Red Hat (64-bit)
#+end_example

*** Hardware

| Setting | Value |
|----------+-------|
| RAM      | 2046 MB |
| CPU      | 2 |
| Disk     | 30 GB |

*** Disk Type

#+begin_example
VDI
Dynamically Allocated
#+end_example

This configuration is enough for a lightweight HPC lab environment.

** Network Configuration
*** Adapter 1

#+begin_example
Attached to: NAT
#+end_example
Used for:

- Internet access
- Package installation
- SSH access from host machine
  
*** NAT Port Forwarding

Open:

#+begin_example
Settings -> Network -> Adapter 1 -> Advanced -> Port Forwarding
#+end_example

| Name | Protocol | Host Port | Guest Port |
|-------+-----------+------------+-------------|
| ssh   | TCP       | 2221       | 22          |

*** Adapter 2

#+begin_example
Attached to: Internal Network
#+end_example

Internal Network Name:

#+begin_example
hpcnet
#+end_example

IMPORTANT:
All nodes MUST use the same internal network name.
This network is used for communication between cluster nodes.

** Rocky Linux Installation

Choose:

#+begin_example
Minimal Install
#+end_example

*** Network and Hostname

Enable BOTH network adapters.

Set hostname:

#+begin_example
master.local
#+end_example

*** User Creation

Create an administrative user during installation.

| Field | Value |
|--------+-------|
| Username | hpcadmin |
| Administrator | YES |
After installation, log into the VM.

** Initial System Verification
