README.html
<li><a id="org8dc56ba"></a>Internal Network<br />
<div class="outline-text-4" id="text-6-2-2">
<p>
Used for communication between cluster nodes.
</p>

<p>
Network name:
</p>

<pre class="example" id="org47b091f">
hpcnet
</pre>

<p>
This network is isolated and only used inside the cluster.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgb9b36f5" class="outline-3">
<h3 id="orgb9b36f5"><span class="section-number-3">6.3.</span> Static IP Addressing</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Each node uses a fixed IP address.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">VM Name</th>
<th scope="col" class="org-left">Hostname</th>
<th scope="col" class="org-right">Internal IP</th>
<th scope="col" class="org-right">SSH Port</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">master</td>
<td class="org-left">master.local</td>
<td class="org-right">10.10.10.1</td>
<td class="org-right">2221</td>
</tr>

<tr>
<td class="org-left">login</td>
<td class="org-left">login.local</td>
<td class="org-right">10.10.10.2</td>
<td class="org-right">2222</td>
</tr>

<tr>
<td class="org-left">compute01</td>
<td class="org-left">compute01.local</td>
<td class="org-right">10.10.10.11</td>
<td class="org-right">2223</td>
</tr>

<tr>
<td class="org-left">compute02</td>
<td class="org-left">compute02.local</td>
<td class="org-right">10.10.10.12</td>
<td class="org-right">2224</td>
</tr>

<tr>
<td class="org-left">compute03</td>
<td class="org-left">compute03.local</td>
<td class="org-right">10.10.10.13</td>
<td class="org-right">2225</td>
</tr>
</tbody>
</table>

<p>
Example SSH access:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ssh -p 2221 hpcuser@localhost
</code></pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1186942" class="outline-2">
<h2 id="org1186942"><span class="section-number-2">7.</span> Resource Allocation</h2>
<div class="outline-text-2" id="text-7">
<p>
The following configuration is enough for a lightweight HPC lab.
You can increase resources later depending on your host system.
</p>
</div>
<div id="outline-container-org11ce72f" class="outline-3">
<h3 id="org11ce72f"><span class="section-number-3">7.1.</span> Master Node</h3>
<div class="outline-text-3" id="text-7-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Resource</th>
<th scope="col" class="org-left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">RAM</td>
<td class="org-left">2 GB</td>
</tr>

<tr>
<td class="org-left">CPU</td>
<td class="org-left">2</td>
</tr>

<tr>
<td class="org-left">Disk</td>
<td class="org-left">30 GB</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org6c7802b" class="outline-3">
<h3 id="org6c7802b"><span class="section-number-3">7.2.</span> Login Node</h3>
<div class="outline-text-3" id="text-7-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Resource</th>
<th scope="col" class="org-left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">RAM</td>
<td class="org-left">2 GB</td>
</tr>

<tr>
<td class="org-left">CPU</td>
<td class="org-left">2</td>
</tr>

<tr>
<td class="org-left">Disk</td>
<td class="org-left">25 GB</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgdb7f949" class="outline-3">
<h3 id="orgdb7f949"><span class="section-number-3">7.3.</span> Compute Nodes</h3>
<div class="outline-text-3" id="text-7-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Resource</th>
<th scope="col" class="org-left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">RAM</td>
<td class="org-left">2 GB</td>
</tr>

<tr>
<td class="org-left">CPU</td>
<td class="org-left">2</td>
</tr>

<tr>
<td class="org-left">Disk</td>
<td class="org-left">20 GB</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org093401e" class="outline-2">
<h2 id="org093401e"><span class="section-number-2">8.</span> Master Node Setup</h2>
<div class="outline-text-2" id="text-8">
<p>
This section covers the complete setup of the master node. The master node
acts as the central management node of the cluster.
</p>

<p>
Main responsibilities:
</p>

<ul class="org-ul">
<li>Cluster management</li>
<li>Shared storage</li>
<li>Slurm controller</li>
<li>Monitoring services</li>
<li>User authentication</li>
<li>Software management</li>
</ul>
</div>
<div id="outline-container-org6dd0625" class="outline-3">
<h3 id="org6dd0625"><span class="section-number-3">8.1.</span> Install VirtualBox on Manjaro</h3>
<div class="outline-text-3" id="text-8-1">
<p>
I&rsquo;m using Manjaro (Arch) as my base system.
</p>
</div>
<ol class="org-ol">
<li><a id="org4ca012e"></a>Update packages<br />
<div class="outline-text-4" id="text-8-1-1">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo pacman -Syu
</code></pre>
</div>
</div>
</li>
<li><a id="orgc7e465b"></a>Install VirtualBox and host modules<br />
<div class="outline-text-4" id="text-8-1-2">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo pacman -S virtualbox virtualbox-host-modules-arch
</code></pre>
</div>
</div>
</li>
<li><a id="org39023ee"></a>Install VirtualBox extension pack<br />
<div class="outline-text-4" id="text-8-1-3">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo pacman -S virtualbox-ext-oracle
</code></pre>
</div>
</div>
</li>
<li><a id="org3e59c11"></a>Load VirtualBox kernel module<br />
<div class="outline-text-4" id="text-8-1-4">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo modprobe vboxdrv
</code></pre>
</div>
</div>
</li>
<li><a id="orgd936d77"></a>Add current user to VirtualBox group<br />
<div class="outline-text-4" id="text-8-1-5">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo usermod -aG vboxusers $USER
</code></pre>
</div>
</div>
</li>
<li><a id="org8267d85"></a>Reboot the system<br />
<div class="outline-text-4" id="text-8-1-6">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo reboot
</code></pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgdab8913" class="outline-3">
<h3 id="orgdab8913"><span class="section-number-3">8.2.</span> Download Rocky Linux</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Download Rocky Linux Minimal ISO:
</p>

<p>
<a href="https://rockylinux.org/download">https://rockylinux.org/download</a>
</p>

<p>
Choose:
</p>

<ul class="org-ul">
<li>x86_64</li>
<li>Minimal ISO</li>
</ul>

<p>
The minimal installation keeps the environment lightweight and avoids
unnecessary packages.
</p>
</div>
</div>
<div id="outline-container-org9abf476" class="outline-3">
<h3 id="org9abf476"><span class="section-number-3">8.3.</span> Create Master VM</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Open VirtualBox and create a new virtual machine.
</p>
</div>
<ol class="org-ol">
<li><a id="orgc669998"></a>VM Name<br />
<div class="outline-text-4" id="text-8-3-1">
<pre class="example" id="org419e066">
master
</pre>
</div>
</li>
<li><a id="org3602ee5"></a>Type<br />
<div class="outline-text-4" id="text-8-3-2">
<pre class="example" id="org83d5e2f">
Linux
Red Hat (64-bit)
</pre>
</div>
</li>
<li><a id="orgcab38be"></a>Hardware<br />
<div class="outline-text-4" id="text-8-3-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Setting</th>
<th scope="col" class="org-left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">RAM</td>
<td class="org-left">2046 MB</td>
</tr>

<tr>
<td class="org-left">CPU</td>
<td class="org-left">2</td>
</tr>

<tr>
<td class="org-left">Disk</td>
<td class="org-left">30 GB</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="orge841130"></a>Disk Type<br />
<div class="outline-text-4" id="text-8-3-4">
<pre class="example" id="org57abcce">
VDI
Dynamically Allocated
</pre>

<p>
This configuration is enough for a lightweight HPC lab environment.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org7ce69c6" class="outline-3">
<h3 id="org7ce69c6"><span class="section-number-3">8.4.</span> Network Configuration</h3>
<div class="outline-text-3" id="text-8-4">
</div>
<ol class="org-ol">
<li><a id="org0ab0d0e"></a>Adapter 1<br />
<div class="outline-text-4" id="text-8-4-1">
<pre class="example" id="org94105b3">
Attached to: NAT
</pre>
<p>
Used for:
</p>

<ul class="org-ul">
<li>Internet access</li>
<li>Package installation</li>
<li>SSH access from host machine</li>
</ul>
</div>
</li>
<li><a id="org2bdff73"></a>NAT Port Forwarding<br />
<div class="outline-text-4" id="text-8-4-2">
<p>
Open:
</p>

<pre class="example" id="org69ba918">
Settings -&gt; Network -&gt; Adapter 1 -&gt; Advanced -&gt; Port Forwarding
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Protocol</th>
<th scope="col" class="org-right">Host Port</th>
<th scope="col" class="org-right">Guest Port</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ssh</td>
<td class="org-left">TCP</td>
<td class="org-right">2221</td>
<td class="org-right">22</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org3e20aee"></a>Adapter 2<br />
<div class="outline-text-4" id="text-8-4-3">
<pre class="example" id="orgb0c18df">
Attached to: Internal Network
</pre>

<p>
Internal Network Name:
</p>

<pre class="example" id="orgad3fc3b">
hpcnet
</pre>

<p>
IMPORTANT:
All nodes MUST use the same internal network name.
This network is used for communication between cluster nodes.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org50234bc" class="outline-3">
<h3 id="org50234bc"><span class="section-number-3">8.5.</span> Rocky Linux Installation</h3>
<div class="outline-text-3" id="text-8-5">
<p>
Choose:
</p>

<pre class="example" id="org68beb91">
Minimal Install
</pre>
</div>
<ol class="org-ol">
<li><a id="orgebcdae0"></a>Network and Hostname<br />
<div class="outline-text-4" id="text-8-5-1">
<p>
Enable BOTH network adapters.
</p>

<p>
Set hostname:
</p>

<pre class="example" id="org506910a">
master.local
</pre>
</div>
</li>
<li><a id="org2b41de0"></a>User Creation<br />
<div class="outline-text-4" id="text-8-5-2">
<p>
Create an administrative user during installation.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Username</td>
<td class="org-left">hpcadmin</td>
</tr>

<tr>
<td class="org-left">Administrator</td>
<td class="org-left">YES</td>
</tr>
</tbody>
</table>
<p>
After installation, log into the VM.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org9533e52" class="outline-3">
<h3 id="org9533e52"><span class="section-number-3">8.6.</span> Initial System Verification</h3>
<div class="outline-text-3" id="text-8-6">
</div>
<ol class="org-ol">
