README.org
*** Check Interfaces

#+begin_src bash
ip addr
#+end_src

Expected:

- NAT interface should receive:
  - 10.0.2.15
- Internal interface should exist but may not yet have static IP

** Configure Static Internal Network
*** Check Device Names

#+begin_src bash
nmcli device status
#+end_src

Expected:

| Interface | Purpose |
|------------+----------|
| enp0s3     | NAT |
| enp0s8     | Internal Network |

** Configure Internal Interface

Launch NetworkManager TUI:

#+begin_src bash
sudo nmtui
#+end_src

Navigate:

#+begin_example
Edit a connection
#+end_example

Select:

#+begin_example
enp0s8
#+end_example

Set:

| Field | Value |
|--------+-------|
| IPv4 Method | Manual |
| Address | 10.10.10.1/24 |
| Gateway | blank |
| DNS | blank |

DO NOT modify NAT interface.

** Restart Networking

#+begin_src bash
sudo systemctl restart NetworkManager
#+end_src

** Verify Networking

#+begin_src bash
ip addr
#+end_src

Expected:

| Interface | IP |
|------------+----------------|
| NAT        | 10.0.2.x |
| Internal   | 10.10.10.1 |

** SSH Access from Host

From host machine:

#+begin_src bash
ssh -p 2221 hpcadmin@localhost
#+end_src
If the connection works, port forwarding is configured correctly.

** System Update and Packages
*** Update System

#+begin_src bash
sudo dnf update -y
#+end_src

*** Install Base Packages

#+begin_src bash
sudo dnf install -y \
vim wget curl git \
net-tools bind-utils \
htop tmux tree \
gcc gcc-c++ gcc-gfortran \
make cmake \
python3 \
openssh-server
#+end_src

These packages provide:

- Development tools
- Network utilities
- Monitoring utilities
- Basic administration tools
  
** Timezone Configuration

Check timezone:

#+begin_src bash
timedatectl
#+end_src

Set timezone if needed:

#+begin_src bash
sudo timedatectl set-timezone Asia/Kolkata
#+end_src

** Configure /etc/hosts

Edit:

#+begin_src bash
sudo vim /etc/hosts
#+end_src

Add:

#+begin_example
10.10.10.1   master master.local
10.10.10.2   login login.local
10.10.10.11  compute01 compute01.local
10.10.10.12  compute02 compute02.local
10.10.10.13  compute03 compute03.local
#+end_example
This allows hostname-based communication between nodes.

** Disable Firewall (Temporary)

For initial setup and testing:
#+begin_src bash
sudo systemctl disable --now firewalld
#+end_src
NOTE:

Firewall rules can be configured properly later after cluster setup is complete.

** SELinux Configuration

Check status:

#+begin_src bash
getenforce
#+end_src

Temporarily disable enforcing:

#+begin_src bash
sudo setenforce 0
#+end_src

Persist configuration:

#+begin_src bash
sudo vim /etc/selinux/config
#+end_src

Modify:

#+begin_example
SELINUX=permissive
#+end_example
This helps avoid permission-related issues during initial cluster setup.

** Verify Hostname

#+begin_src bash
hostnamectl
#+end_src

Expected:

#+begin_example
Static hostname: master.local
#+end_example

If hostname is not updated(showing previous), reboot the machine.

At this point, the master node setup is complete and ready for cloning or
further cluster configuration.

* Cloning Nodes

Purpose:

- avoid reinstalling all nodes manually
- simulate real HPC image provisioning workflow

** Create Snapshot

Power off VM:

#+begin_src bash
sudo poweroff
#+end_src

Create snapshot in VirtualBox:

#+begin_example
clean-base-master
#+end_example

** Clone Nodes

Create FULL CLONES.

IMPORTANT:
Enable:

#+begin_example
Reinitialize the MAC address of all network cards
#+end_example

** Clone Names

| VM Name |
|----------|
| login |
| compute01 |
| compute02 |
| compute03 |

** Configure Port Forwarding
*** Login Node

| Host Port | Guest Port |
|------------+-------------|
| 2222       | 22 |

*** Compute01

| Host Port | Guest Port |
|------------+-------------|
| 2223       | 22 |

*** Compute02

| Host Port | Guest Port |
|------------+-------------|
| 2224       | 22 |

*** Compute03

| Host Port | Guest Port |
|------------+-------------|
| 2225       | 22 |

