README.html
<li><a id="orgb1c1302"></a>Check Interfaces<br />
<div class="outline-text-4" id="text-8-6-1">
<div class="org-src-container">
<pre class="src src-bash"><code>ip addr
</code></pre>
</div>

<p>
Expected:
</p>

<ul class="org-ul">
<li>NAT interface should receive:
<ul class="org-ul">
<li>10.0.2.15</li>
</ul></li>
<li>Internal interface should exist but may not yet have static IP</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org0f8e06c" class="outline-3">
<h3 id="org0f8e06c"><span class="section-number-3">8.7.</span> Configure Static Internal Network</h3>
<div class="outline-text-3" id="text-8-7">
</div>
<ol class="org-ol">
<li><a id="org7447d2a"></a>Check Device Names<br />
<div class="outline-text-4" id="text-8-7-1">
<div class="org-src-container">
<pre class="src src-bash"><code>nmcli device status
</code></pre>
</div>

<p>
Expected:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Interface</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">enp0s3</td>
<td class="org-left">NAT</td>
</tr>

<tr>
<td class="org-left">enp0s8</td>
<td class="org-left">Internal Network</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>
<div id="outline-container-org0a3d507" class="outline-3">
<h3 id="org0a3d507"><span class="section-number-3">8.8.</span> Configure Internal Interface</h3>
<div class="outline-text-3" id="text-8-8">
<p>
Launch NetworkManager TUI:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo nmtui
</code></pre>
</div>

<p>
Navigate:
</p>

<pre class="example" id="orgac119da">
Edit a connection
</pre>

<p>
Select:
</p>

<pre class="example" id="org20c7522">
enp0s8
</pre>

<p>
Set:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">IPv4 Method</td>
<td class="org-left">Manual</td>
</tr>

<tr>
<td class="org-left">Address</td>
<td class="org-left">10.10.10.1/24</td>
</tr>

<tr>
<td class="org-left">Gateway</td>
<td class="org-left">blank</td>
</tr>

<tr>
<td class="org-left">DNS</td>
<td class="org-left">blank</td>
</tr>
</tbody>
</table>

<p>
DO NOT modify NAT interface.
</p>
</div>
</div>
<div id="outline-container-org34250aa" class="outline-3">
<h3 id="org34250aa"><span class="section-number-3">8.9.</span> Restart Networking</h3>
<div class="outline-text-3" id="text-8-9">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl restart NetworkManager
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgac93629" class="outline-3">
<h3 id="orgac93629"><span class="section-number-3">8.10.</span> Verify Networking</h3>
<div class="outline-text-3" id="text-8-10">
<div class="org-src-container">
<pre class="src src-bash"><code>ip addr
</code></pre>
</div>

<p>
Expected:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Interface</th>
<th scope="col" class="org-right">IP</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">NAT</td>
<td class="org-right">10.0.2.x</td>
</tr>

<tr>
<td class="org-left">Internal</td>
<td class="org-right">10.10.10.1</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgb583409" class="outline-3">
<h3 id="orgb583409"><span class="section-number-3">8.11.</span> SSH Access from Host</h3>
<div class="outline-text-3" id="text-8-11">
<p>
From host machine:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ssh -p 2221 hpcadmin@localhost
</code></pre>
</div>
<p>
If the connection works, port forwarding is configured correctly.
</p>
</div>
</div>
<div id="outline-container-orgcecc143" class="outline-3">
<h3 id="orgcecc143"><span class="section-number-3">8.12.</span> System Update and Packages</h3>
<div class="outline-text-3" id="text-8-12">
</div>
<ol class="org-ol">
<li><a id="org0862541"></a>Update System<br />
<div class="outline-text-4" id="text-8-12-1">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo dnf update -y
</code></pre>
</div>
</div>
</li>
<li><a id="orgef91015"></a>Install Base Packages<br />
<div class="outline-text-4" id="text-8-12-2">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo dnf install -y \
vim wget curl git \
net-tools bind-utils \
htop tmux tree \
gcc gcc-c++ gcc-gfortran \
make cmake \
python3 \
openssh-server
</code></pre>
</div>

<p>
These packages provide:
</p>

<ul class="org-ul">
<li>Development tools</li>
<li>Network utilities</li>
<li>Monitoring utilities</li>
<li>Basic administration tools</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org85b2419" class="outline-3">
<h3 id="org85b2419"><span class="section-number-3">8.13.</span> Timezone Configuration</h3>
<div class="outline-text-3" id="text-8-13">
<p>
Check timezone:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>timedatectl
</code></pre>
</div>

<p>
Set timezone if needed:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo timedatectl set-timezone Asia/Kolkata
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgede47fc" class="outline-3">
<h3 id="orgede47fc"><span class="section-number-3">8.14.</span> Configure /etc/hosts</h3>
<div class="outline-text-3" id="text-8-14">
<p>
Edit:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/hosts
</code></pre>
</div>

<p>
Add:
</p>

<pre class="example" id="orgddb8cc0">
10.10.10.1   master master.local
10.10.10.2   login login.local
10.10.10.11  compute01 compute01.local
10.10.10.12  compute02 compute02.local
10.10.10.13  compute03 compute03.local
</pre>
<p>
This allows hostname-based communication between nodes.
</p>
</div>
</div>
<div id="outline-container-orgc654e90" class="outline-3">
<h3 id="orgc654e90"><span class="section-number-3">8.15.</span> Disable Firewall (Temporary)</h3>
<div class="outline-text-3" id="text-8-15">
<p>
For initial setup and testing:
</p>
<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl disable --now firewalld
</code></pre>
</div>
<p>
NOTE:
</p>

<p>
Firewall rules can be configured properly later after cluster setup is complete.
</p>
</div>
</div>
<div id="outline-container-org7a6dc6f" class="outline-3">
<h3 id="org7a6dc6f"><span class="section-number-3">8.16.</span> SELinux Configuration</h3>
<div class="outline-text-3" id="text-8-16">
<p>
Check status:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>getenforce
</code></pre>
</div>

<p>
Temporarily disable enforcing:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo setenforce 0
</code></pre>
</div>

<p>
Persist configuration:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/selinux/config
</code></pre>
</div>

<p>
Modify:
</p>

<pre class="example" id="org5cac72c">
SELINUX=permissive
</pre>
<p>
This helps avoid permission-related issues during initial cluster setup.
</p>
</div>
</div>
<div id="outline-container-org99ee47b" class="outline-3">
<h3 id="org99ee47b"><span class="section-number-3">8.17.</span> Verify Hostname</h3>
<div class="outline-text-3" id="text-8-17">
<div class="org-src-container">
<pre class="src src-bash"><code>hostnamectl
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orge7d3454">
Static hostname: master.local
</pre>

<p>
If hostname is not updated(showing previous), reboot the machine.
</p>

<p>
At this point, the master node setup is complete and ready for cloning or
further cluster configuration.
</p>
</div>
</div>
</div>
<div id="outline-container-org8480419" class="outline-2">
<h2 id="org8480419"><span class="section-number-2">9.</span> Cloning Nodes</h2>
<div class="outline-text-2" id="text-9">
<p>
Purpose:
</p>

<ul class="org-ul">
<li>avoid reinstalling all nodes manually</li>
<li>simulate real HPC image provisioning workflow</li>
</ul>
</div>
<div id="outline-container-org12357e9" class="outline-3">
<h3 id="org12357e9"><span class="section-number-3">9.1.</span> Create Snapshot</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Power off VM:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo poweroff
</code></pre>
</div>

<p>
Create snapshot in VirtualBox:
</p>

<pre class="example" id="orgd41c6ed">
clean-base-master
</pre>
</div>
</div>
<div id="outline-container-orgbfc56ae" class="outline-3">
<h3 id="orgbfc56ae"><span class="section-number-3">9.2.</span> Clone Nodes</h3>
<div class="outline-text-3" id="text-9-2">
<p>
Create FULL CLONES.
</p>

<p>
IMPORTANT:
Enable:
</p>

<pre class="example" id="org090bef1">
Reinitialize the MAC address of all network cards
</pre>
</div>
</div>
<div id="outline-container-org148d709" class="outline-3">
<h3 id="org148d709"><span class="section-number-3">9.3.</span> Clone Names</h3>
<div class="outline-text-3" id="text-9-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">VM Name</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">login</td>
</tr>

<tr>
<td class="org-left">compute01</td>
</tr>

<tr>
<td class="org-left">compute02</td>
</tr>

<tr>
<td class="org-left">compute03</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgb0398f0" class="outline-3">
<h3 id="orgb0398f0"><span class="section-number-3">9.4.</span> Configure Port Forwarding</h3>
<div class="outline-text-3" id="text-9-4">
</div>
<ol class="org-ol">
