README.org
** Machine ID Regeneration

IMPORTANT:
Each cloned Linux machine must have unique machine-id.

** Remove Existing Machine ID

#+begin_src bash
sudo rm -f /etc/machine-id
#+end_src

** Generate New Machine ID

#+begin_src bash
sudo systemd-machine-id-setup
#+end_src

** Verify Machine ID

#+begin_src bash
cat /etc/machine-id
#+end_src

Ensure every node has unique machine-id.

** Configure Hostname
*** Login Node

Edit hostname:

#+begin_src bash
sudo vim /etc/hostname
#+end_src

Set:

#+begin_example
login.local
#+end_example

Apply:

#+begin_src bash
sudo hostnamectl set-hostname login.local
#+end_src

*** Compute01

Set hostname:

#+begin_example
compute01.local
#+end_example

Apply:

#+begin_src bash
sudo hostnamectl set-hostname compute01.local
#+end_src

*** Compute02

#+begin_example
compute02.local
#+end_example

#+begin_src bash
sudo hostnamectl set-hostname compute02.local
#+end_src

*** Compute03

#+begin_example
compute03.local
#+end_example

#+begin_src bash
sudo hostnamectl set-hostname compute03.local
#+end_src

** Configure Static Internal IPs

Launch:

#+begin_src bash
sudo nmtui
#+end_src

Edit internal adapter:

#+begin_example
enp0s8
#+end_example

*** Login Node

#+begin_example
10.10.10.2/24
#+end_example

*** Compute01

#+begin_example
10.10.10.11/24
#+end_example

*** Compute02

#+begin_example
10.10.10.12/24
#+end_example

*** Compute03

#+begin_example
10.10.10.13/24
#+end_example

** Restart Networking

#+begin_src bash
sudo systemctl restart NetworkManager
#+end_src

** Verify Networking

#+begin_src bash
ip addr
#+end_src

** Verify Routing

#+begin_src bash
ip route
#+end_src

Expected:

#+begin_example
default via 10.0.2.2 dev enp0s3
10.10.10.0/24 dev enp0s8
#+end_example

** Verify Connectivity
*** Ping Between Nodes

#+begin_src bash
ping master
#+end_src

#+begin_src bash
ping login
#+end_src

#+begin_src bash
ping compute01
#+end_src

** SSH Verification

From host:

*** Master

#+begin_src bash
ssh -p 2221 hpcadmin@localhost
#+end_src

*** Login

#+begin_src bash
ssh -p 2222 hpcadmin@localhost
#+end_src

*** Compute01

#+begin_src bash
ssh -p 2223 hpcadmin@localhost
#+end_src

*** Compute02

#+begin_src bash
ssh -p 2224 hpcadmin@localhost
#+end_src

*** Compute03

#+begin_src bash
ssh -p 2225 hpcadmin@localhost
#+end_src

* Shared Infrastructure Services

Goal:

Transform the cluster into a realistic HPC-style shared environment.

This phase includes:

- passwordless SSH
- shared home directories
- NFS server/client configuration
- persistent mounts
- multi-node shared filesystem verification

By the end of this phase:

- all nodes share same /home
- users can access same files from all nodes
- cluster behaves like a real HPC environment

** Cluster Role Architecture
*** Master Node

Purpose:

- cluster management
- NFS server
- future Slurm controller
- future Munge authority
- future LDAP server

Services:

| Service | Purpose |
|----------+----------|
| nfs-server | shared storage |
| future slurmctld | scheduler controller |
| future munge | authentication |

*** Login Node

Purpose:

- user login
- compilation
- job submission

Users should:
- SSH into login node
- compile programs
- submit jobs using Slurm

*** Compute Nodes

Purpose:

- execute jobs only

Future services:

| Service | Purpose |
|----------+----------|
| slurmd | compute daemon |
| munge | authentication |

