README.html
<li><a id="orge8e307d"></a>Login Node<br />
<div class="outline-text-4" id="text-9-4-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Host Port</th>
<th scope="col" class="org-right">Guest Port</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">2222</td>
<td class="org-right">22</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org48e6171"></a>Compute01<br />
<div class="outline-text-4" id="text-9-4-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Host Port</th>
<th scope="col" class="org-right">Guest Port</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">2223</td>
<td class="org-right">22</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org89ccb73"></a>Compute02<br />
<div class="outline-text-4" id="text-9-4-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Host Port</th>
<th scope="col" class="org-right">Guest Port</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">2224</td>
<td class="org-right">22</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="orga527c66"></a>Compute03<br />
<div class="outline-text-4" id="text-9-4-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Host Port</th>
<th scope="col" class="org-right">Guest Port</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">2225</td>
<td class="org-right">22</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgdc045da" class="outline-3">
<h3 id="orgdc045da"><span class="section-number-3">9.5.</span> Machine ID Regeneration</h3>
<div class="outline-text-3" id="text-9-5">
<p>
IMPORTANT:
Each cloned Linux machine must have unique machine-id.
</p>
</div>
</div>
<div id="outline-container-org26c9c6e" class="outline-3">
<h3 id="org26c9c6e"><span class="section-number-3">9.6.</span> Remove Existing Machine ID</h3>
<div class="outline-text-3" id="text-9-6">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo rm -f /etc/machine-id
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org3bade97" class="outline-3">
<h3 id="org3bade97"><span class="section-number-3">9.7.</span> Generate New Machine ID</h3>
<div class="outline-text-3" id="text-9-7">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemd-machine-id-setup
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org5d4f369" class="outline-3">
<h3 id="org5d4f369"><span class="section-number-3">9.8.</span> Verify Machine ID</h3>
<div class="outline-text-3" id="text-9-8">
<div class="org-src-container">
<pre class="src src-bash"><code>cat /etc/machine-id
</code></pre>
</div>

<p>
Ensure every node has unique machine-id.
</p>
</div>
</div>
<div id="outline-container-org0649ecc" class="outline-3">
<h3 id="org0649ecc"><span class="section-number-3">9.9.</span> Configure Hostname</h3>
<div class="outline-text-3" id="text-9-9">
</div>
<ol class="org-ol">
<li><a id="org59cc225"></a>Login Node<br />
<div class="outline-text-4" id="text-9-9-1">
<p>
Edit hostname:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/hostname
</code></pre>
</div>

<p>
Set:
</p>

<pre class="example" id="org85a3f0c">
login.local
</pre>

<p>
Apply:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo hostnamectl set-hostname login.local
</code></pre>
</div>
</div>
</li>
<li><a id="orgd9fcab8"></a>Compute01<br />
<div class="outline-text-4" id="text-9-9-2">
<p>
Set hostname:
</p>

<pre class="example" id="orgef1617d">
compute01.local
</pre>

<p>
Apply:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo hostnamectl set-hostname compute01.local
</code></pre>
</div>
</div>
</li>
<li><a id="org53a392e"></a>Compute02<br />
<div class="outline-text-4" id="text-9-9-3">
<pre class="example" id="org3827725">
compute02.local
</pre>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo hostnamectl set-hostname compute02.local
</code></pre>
</div>
</div>
</li>
<li><a id="org7271416"></a>Compute03<br />
<div class="outline-text-4" id="text-9-9-4">
<pre class="example" id="org00227f1">
compute03.local
</pre>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo hostnamectl set-hostname compute03.local
</code></pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org4203f06" class="outline-3">
<h3 id="org4203f06"><span class="section-number-3">9.10.</span> Configure Static Internal IPs</h3>
<div class="outline-text-3" id="text-9-10">
<p>
Launch:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo nmtui
</code></pre>
</div>

<p>
Edit internal adapter:
</p>

<pre class="example" id="org5ccf715">
enp0s8
</pre>
</div>
<ol class="org-ol">
<li><a id="org9a55092"></a>Login Node<br />
<div class="outline-text-4" id="text-9-10-1">
<pre class="example" id="org0fd49ad">
10.10.10.2/24
</pre>
</div>
</li>
<li><a id="org62bb82b"></a>Compute01<br />
<div class="outline-text-4" id="text-9-10-2">
<pre class="example" id="org60c8100">
10.10.10.11/24
</pre>
</div>
</li>
<li><a id="orga1943e6"></a>Compute02<br />
<div class="outline-text-4" id="text-9-10-3">
<pre class="example" id="org6413f1d">
10.10.10.12/24
</pre>
</div>
</li>
<li><a id="orga1b0489"></a>Compute03<br />
<div class="outline-text-4" id="text-9-10-4">
<pre class="example" id="orgc6d2a5c">
10.10.10.13/24
</pre>
</div>
</li>
</ol>
</div>
<div id="outline-container-org7b487a6" class="outline-3">
<h3 id="org7b487a6"><span class="section-number-3">9.11.</span> Restart Networking</h3>
<div class="outline-text-3" id="text-9-11">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl restart NetworkManager
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org158c257" class="outline-3">
<h3 id="org158c257"><span class="section-number-3">9.12.</span> Verify Networking</h3>
<div class="outline-text-3" id="text-9-12">
<div class="org-src-container">
<pre class="src src-bash"><code>ip addr
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgaefe425" class="outline-3">
<h3 id="orgaefe425"><span class="section-number-3">9.13.</span> Verify Routing</h3>
<div class="outline-text-3" id="text-9-13">
<div class="org-src-container">
<pre class="src src-bash"><code>ip route
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org85b4ad7">
default via 10.0.2.2 dev enp0s3
10.10.10.0/24 dev enp0s8
</pre>
</div>
</div>
<div id="outline-container-org68a8de5" class="outline-3">
<h3 id="org68a8de5"><span class="section-number-3">9.14.</span> Verify Connectivity</h3>
<div class="outline-text-3" id="text-9-14">
</div>
<ol class="org-ol">
<li><a id="org36ba002"></a>Ping Between Nodes<br />
<div class="outline-text-4" id="text-9-14-1">
<div class="org-src-container">
<pre class="src src-bash"><code>ping master
</code></pre>
</div>

<div class="org-src-container">
<pre class="src src-bash"><code>ping login
</code></pre>
</div>

<div class="org-src-container">
<pre class="src src-bash"><code>ping compute01
</code></pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org0ec7e07" class="outline-3">
<h3 id="org0ec7e07"><span class="section-number-3">9.15.</span> SSH Verification</h3>
<div class="outline-text-3" id="text-9-15">
<p>
From host:
</p>
</div>
<ol class="org-ol">
<li><a id="org0672482"></a>Master<br />
<div class="outline-text-4" id="text-9-15-1">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh -p 2221 hpcadmin@localhost
</code></pre>
</div>
</div>
</li>
<li><a id="orgc46a28a"></a>Login<br />
<div class="outline-text-4" id="text-9-15-2">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh -p 2222 hpcadmin@localhost
</code></pre>
</div>
</div>
</li>
<li><a id="org16fcb13"></a>Compute01<br />
<div class="outline-text-4" id="text-9-15-3">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh -p 2223 hpcadmin@localhost
</code></pre>
</div>
</div>
</li>
<li><a id="orgf0c3913"></a>Compute02<br />
<div class="outline-text-4" id="text-9-15-4">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh -p 2224 hpcadmin@localhost
</code></pre>
</div>
</div>
</li>
<li><a id="org9721506"></a>Compute03<br />
<div class="outline-text-4" id="text-9-15-5">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh -p 2225 hpcadmin@localhost
</code></pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgfa2f013" class="outline-2">
<h2 id="orgfa2f013"><span class="section-number-2">10.</span> Shared Infrastructure Services</h2>
<div class="outline-text-2" id="text-10">
<p>
Goal:
</p>

<p>
Transform the cluster into a realistic HPC-style shared environment.
</p>

<p>
This phase includes:
</p>

<ul class="org-ul">
<li>passwordless SSH</li>
<li>shared home directories</li>
<li>NFS server/client configuration</li>
<li>persistent mounts</li>
<li>multi-node shared filesystem verification</li>
</ul>

<p>
By the end of this phase:
</p>

<ul class="org-ul">
<li>all nodes share same /home</li>
<li>users can access same files from all nodes</li>
<li>cluster behaves like a real HPC environment</li>
</ul>
</div>
<div id="outline-container-org49e8751" class="outline-3">
<h3 id="org49e8751"><span class="section-number-3">10.1.</span> Cluster Role Architecture</h3>
<div class="outline-text-3" id="text-10-1">
</div>
<ol class="org-ol">
<li><a id="orga5dce35"></a>Master Node<br />
<div class="outline-text-4" id="text-10-1-1">
<p>
Purpose:
</p>

<ul class="org-ul">
<li>cluster management</li>
<li>NFS server</li>
<li>future Slurm controller</li>
<li>future Munge authority</li>
<li>future LDAP server</li>
</ul>

<p>
Services:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Service</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">nfs-server</td>
<td class="org-left">shared storage</td>
</tr>

<tr>
<td class="org-left">future slurmctld</td>
<td class="org-left">scheduler controller</td>
</tr>

<tr>
<td class="org-left">future munge</td>
<td class="org-left">authentication</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="orgaa50d16"></a>Login Node<br />
<div class="outline-text-4" id="text-10-1-2">
<p>
Purpose:
</p>

<ul class="org-ul">
<li>user login</li>
<li>compilation</li>
<li>job submission</li>
</ul>

<p>
Users should:
</p>
<ul class="org-ul">
<li>SSH into login node</li>
<li>compile programs</li>
<li>submit jobs using Slurm</li>
</ul>
</div>
</li>
<li><a id="org11dc2e6"></a>Compute Nodes<br />
<div class="outline-text-4" id="text-10-1-3">
<p>
Purpose:
</p>

<ul class="org-ul">
<li>execute jobs only</li>
</ul>

<p>
Future services:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Service</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">slurmd</td>
<td class="org-left">compute daemon</td>
</tr>

<tr>
<td class="org-left">munge</td>
<td class="org-left">authentication</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>
