README.org
** Verify User Consistency

IMPORTANT:

NFS shared storage requires same UID/GID across all nodes.

Verify user identity on all nodes:

#+begin_src bash
id hpcadmin
#+end_src

Expected:

#+begin_example
uid=1000(hpcadmin) gid=1000(hpcadmin)
#+end_example

All nodes must match.

** Passwordless SSH Configuration

Purpose:

- MPI communication
- Slurm execution
- cluster automation
- remote management

SSH trust is generated ONLY from login node.

This mimics real HPC architecture:

#+begin_example
User -> Login Node -> Compute Nodes
#+end_example

** Generate SSH Key on Login Node

SSH into login node from host:

#+begin_src bash
ssh -p 2222 hpcadmin@localhost
#+end_src

Generate SSH key:

#+begin_src bash
ssh-keygen
#+end_src

Press Enter for all prompts.

Generated files:

#+begin_example
~/.ssh/id_rsa
~/.ssh/id_rsa.pub
#+end_example

** Copy SSH Keys to Cluster Nodes
*** Master

#+begin_src bash
ssh-copy-id hpcadmin@master
#+end_src

*** Compute01

#+begin_src bash
ssh-copy-id hpcadmin@compute01
#+end_src

*** Compute02

#+begin_src bash
ssh-copy-id hpcadmin@compute02
#+end_src

*** Compute03

#+begin_src bash
ssh-copy-id hpcadmin@compute03
#+end_src

** Verify Passwordless SSH
*** Test Master

#+begin_src bash
ssh master hostname
#+end_src

Expected:

#+begin_example
master.local
#+end_example

*** Test Compute01

#+begin_src bash
ssh compute01 hostname
#+end_src

Expected:

#+begin_example
compute01.local
#+end_example

*** Test Compute02

#+begin_src bash
ssh compute02 hostname
#+end_src

*** Test Compute03

#+begin_src bash
ssh compute03 hostname
#+end_src

No password prompts should appear.

** HPC Concept — Why Passwordless SSH Matters

Passwordless SSH becomes essential for:

| Feature | Purpose |
|----------+----------|
| MPI | remote process launch |
| Slurm | distributed execution |
| automation | orchestration |
| monitoring | remote administration |

** NFS Shared Storage Setup

Purpose:

Provide shared home directories across all cluster nodes.

This is a core HPC architecture requirement.

Without shared storage:

- source code differs per node
- binaries differ
- scripts unavailable across nodes
- MPI execution becomes difficult

Real HPC systems commonly use:

- NFS
- Lustre
- BeeGFS
- GPFS

This lab begins with NFS.

** Install NFS Packages

Install on ALL nodes:

#+begin_src bash
sudo dnf install -y nfs-utils
#+end_src

** Configure NFS Server on Master

SSH into master node.

** Enable NFS Services

#+begin_src bash
sudo systemctl enable --now nfs-server
#+end_src

Verify:

#+begin_src bash
systemctl status nfs-server
#+end_src

Expected:

#+begin_example
active (running)
#+end_example

** Configure NFS Exports

Edit exports file:

#+begin_src bash
sudo vim /etc/exports
#+end_src

Add:

#+begin_example
/home 10.10.10.0/24(rw,sync,no_root_squash)
#+end_example

** Export Option Explanation

| Option | Meaning |
|---------+----------|
| rw | read/write access |
| sync | synchronous writes |
| no_root_squash | preserve root privileges |

** Apply Exports

#+begin_src bash
sudo exportfs -rav
#+end_src

** Verify Exports

#+begin_src bash
sudo exportfs -v
#+end_src

Expected export:

#+begin_example
/home 10.10.10.0/24(...)
#+end_example

** Configure NFS Clients

Perform on:

- login
- compute01
- compute02
- compute03

** Backup Existing Home Directory

#+begin_src bash
sudo mv /home /home.local
#+end_src

Purpose:

Preserve original local home directory.

** Create New Mount Point

#+begin_src bash
sudo mkdir /home
#+end_src

** Mount Shared NFS Home

#+begin_src bash
sudo mount master:/home /home
#+end_src

** Verify Mount

#+begin_src bash
df -h
#+end_src

Expected:

#+begin_example
master:/home
#+end_example

mounted on:

#+begin_example
/home
#+end_example

** Verify Shared Filesystem

From login node:

#+begin_src bash
touch ~/shared_test
#+end_src

From compute01:

#+begin_src bash
ls ~
#+end_src

Expected:

#+begin_example
shared_test
#+end_example

This confirms successful shared filesystem operation.

** Configure Persistent NFS Mounts

Without this configuration:

- NFS mount disappears after reboot

