README.html
<div id="outline-container-org3d66193" class="outline-3">
<h3 id="org3d66193"><span class="section-number-3">10.2.</span> Verify User Consistency</h3>
<div class="outline-text-3" id="text-10-2">
<p>
IMPORTANT:
</p>

<p>
NFS shared storage requires same UID/GID across all nodes.
</p>

<p>
Verify user identity on all nodes:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>id hpcadmin
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org3960931">
uid=1000(hpcadmin) gid=1000(hpcadmin)
</pre>

<p>
All nodes must match.
</p>
</div>
</div>
<div id="outline-container-orgfcd6cb4" class="outline-3">
<h3 id="orgfcd6cb4"><span class="section-number-3">10.3.</span> Passwordless SSH Configuration</h3>
<div class="outline-text-3" id="text-10-3">
<p>
Purpose:
</p>

<ul class="org-ul">
<li>MPI communication</li>
<li>Slurm execution</li>
<li>cluster automation</li>
<li>remote management</li>
</ul>

<p>
SSH trust is generated ONLY from login node.
</p>

<p>
This mimics real HPC architecture:
</p>

<pre class="example" id="orgab807c3">
User -&gt; Login Node -&gt; Compute Nodes
</pre>
</div>
</div>
<div id="outline-container-org35055a3" class="outline-3">
<h3 id="org35055a3"><span class="section-number-3">10.4.</span> Generate SSH Key on Login Node</h3>
<div class="outline-text-3" id="text-10-4">
<p>
SSH into login node from host:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ssh -p 2222 hpcadmin@localhost
</code></pre>
</div>

<p>
Generate SSH key:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ssh-keygen
</code></pre>
</div>

<p>
Press Enter for all prompts.
</p>

<p>
Generated files:
</p>

<pre class="example" id="org12dba89">
~/.ssh/id_rsa
~/.ssh/id_rsa.pub
</pre>
</div>
</div>
<div id="outline-container-org938701a" class="outline-3">
<h3 id="org938701a"><span class="section-number-3">10.5.</span> Copy SSH Keys to Cluster Nodes</h3>
<div class="outline-text-3" id="text-10-5">
</div>
<ol class="org-ol">
<li><a id="org6a14c05"></a>Master<br />
<div class="outline-text-4" id="text-10-5-1">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh-copy-id hpcadmin@master
</code></pre>
</div>
</div>
</li>
<li><a id="org7afd98c"></a>Compute01<br />
<div class="outline-text-4" id="text-10-5-2">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh-copy-id hpcadmin@compute01
</code></pre>
</div>
</div>
</li>
<li><a id="org95157bd"></a>Compute02<br />
<div class="outline-text-4" id="text-10-5-3">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh-copy-id hpcadmin@compute02
</code></pre>
</div>
</div>
</li>
<li><a id="orge7e777e"></a>Compute03<br />
<div class="outline-text-4" id="text-10-5-4">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh-copy-id hpcadmin@compute03
</code></pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org1511c11" class="outline-3">
<h3 id="org1511c11"><span class="section-number-3">10.6.</span> Verify Passwordless SSH</h3>
<div class="outline-text-3" id="text-10-6">
</div>
<ol class="org-ol">
<li><a id="org54379ac"></a>Test Master<br />
<div class="outline-text-4" id="text-10-6-1">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh master hostname
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org5a27df4">
master.local
</pre>
</div>
</li>
<li><a id="org82cf3dd"></a>Test Compute01<br />
<div class="outline-text-4" id="text-10-6-2">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh compute01 hostname
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org3a1a95e">
compute01.local
</pre>
</div>
</li>
<li><a id="org4a16b58"></a>Test Compute02<br />
<div class="outline-text-4" id="text-10-6-3">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh compute02 hostname
</code></pre>
</div>
</div>
</li>
<li><a id="org0a7602b"></a>Test Compute03<br />
<div class="outline-text-4" id="text-10-6-4">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh compute03 hostname
</code></pre>
</div>

<p>
No password prompts should appear.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgbfc9a7c" class="outline-3">
<h3 id="orgbfc9a7c"><span class="section-number-3">10.7.</span> HPC Concept — Why Passwordless SSH Matters</h3>
<div class="outline-text-3" id="text-10-7">
<p>
Passwordless SSH becomes essential for:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">MPI</td>
<td class="org-left">remote process launch</td>
</tr>

<tr>
<td class="org-left">Slurm</td>
<td class="org-left">distributed execution</td>
</tr>

<tr>
<td class="org-left">automation</td>
<td class="org-left">orchestration</td>
</tr>

<tr>
<td class="org-left">monitoring</td>
<td class="org-left">remote administration</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org2f76b87" class="outline-3">
<h3 id="org2f76b87"><span class="section-number-3">10.8.</span> NFS Shared Storage Setup</h3>
<div class="outline-text-3" id="text-10-8">
<p>
Purpose:
</p>

<p>
Provide shared home directories across all cluster nodes.
</p>

<p>
This is a core HPC architecture requirement.
</p>

<p>
Without shared storage:
</p>

<ul class="org-ul">
<li>source code differs per node</li>
<li>binaries differ</li>
<li>scripts unavailable across nodes</li>
<li>MPI execution becomes difficult</li>
</ul>

<p>
Real HPC systems commonly use:
</p>

<ul class="org-ul">
<li>NFS</li>
<li>Lustre</li>
<li>BeeGFS</li>
<li>GPFS</li>
</ul>

<p>
This lab begins with NFS.
</p>
</div>
</div>
<div id="outline-container-org93f30a9" class="outline-3">
<h3 id="org93f30a9"><span class="section-number-3">10.9.</span> Install NFS Packages</h3>
<div class="outline-text-3" id="text-10-9">
<p>
Install on ALL nodes:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo dnf install -y nfs-utils
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgdee3859" class="outline-3">
<h3 id="orgdee3859"><span class="section-number-3">10.10.</span> Configure NFS Server on Master</h3>
<div class="outline-text-3" id="text-10-10">
<p>
SSH into master node.
</p>
</div>
</div>
<div id="outline-container-org92d91b5" class="outline-3">
<h3 id="org92d91b5"><span class="section-number-3">10.11.</span> Enable NFS Services</h3>
<div class="outline-text-3" id="text-10-11">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl enable --now nfs-server
</code></pre>
</div>

<p>
Verify:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>systemctl status nfs-server
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgd3285f4">
active (running)
</pre>
</div>
</div>
<div id="outline-container-orge1bf621" class="outline-3">
<h3 id="orge1bf621"><span class="section-number-3">10.12.</span> Configure NFS Exports</h3>
<div class="outline-text-3" id="text-10-12">
<p>
Edit exports file:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/exports
</code></pre>
</div>

<p>
Add:
</p>

<pre class="example" id="org7badaee">
/home 10.10.10.0/24(rw,sync,no_root_squash)
</pre>
</div>
</div>
<div id="outline-container-org5a0c56a" class="outline-3">
<h3 id="org5a0c56a"><span class="section-number-3">10.13.</span> Export Option Explanation</h3>
<div class="outline-text-3" id="text-10-13">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Option</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">rw</td>
<td class="org-left">read/write access</td>
</tr>

<tr>
<td class="org-left">sync</td>
<td class="org-left">synchronous writes</td>
</tr>

<tr>
<td class="org-left">no_root_squash</td>
<td class="org-left">preserve root privileges</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org45e41fa" class="outline-3">
<h3 id="org45e41fa"><span class="section-number-3">10.14.</span> Apply Exports</h3>
<div class="outline-text-3" id="text-10-14">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo exportfs -rav
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org62fb0fe" class="outline-3">
<h3 id="org62fb0fe"><span class="section-number-3">10.15.</span> Verify Exports</h3>
<div class="outline-text-3" id="text-10-15">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo exportfs -v
</code></pre>
</div>

<p>
Expected export:
</p>

<pre class="example" id="orga9005f5">
/home 10.10.10.0/24(...)
</pre>
</div>
</div>
<div id="outline-container-org9029016" class="outline-3">
<h3 id="org9029016"><span class="section-number-3">10.16.</span> Configure NFS Clients</h3>
<div class="outline-text-3" id="text-10-16">
<p>
Perform on:
</p>

<ul class="org-ul">
<li>login</li>
<li>compute01</li>
<li>compute02</li>
<li>compute03</li>
</ul>
</div>
</div>
<div id="outline-container-orge17f7f7" class="outline-3">
<h3 id="orge17f7f7"><span class="section-number-3">10.17.</span> Backup Existing Home Directory</h3>
<div class="outline-text-3" id="text-10-17">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo mv /home /home.local
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Preserve original local home directory.
</p>
</div>
</div>
<div id="outline-container-org6e641c8" class="outline-3">
<h3 id="org6e641c8"><span class="section-number-3">10.18.</span> Create New Mount Point</h3>
<div class="outline-text-3" id="text-10-18">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo mkdir /home
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org19152a9" class="outline-3">
<h3 id="org19152a9"><span class="section-number-3">10.19.</span> Mount Shared NFS Home</h3>
<div class="outline-text-3" id="text-10-19">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo mount master:/home /home
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgfae1b42" class="outline-3">
<h3 id="orgfae1b42"><span class="section-number-3">10.20.</span> Verify Mount</h3>
<div class="outline-text-3" id="text-10-20">
<div class="org-src-container">
<pre class="src src-bash"><code>df -h
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgb2dbb0e">
master:/home
</pre>

<p>
mounted on:
</p>

<pre class="example" id="org7c1fa98">
/home
</pre>
</div>
</div>
<div id="outline-container-org32953f5" class="outline-3">
<h3 id="org32953f5"><span class="section-number-3">10.21.</span> Verify Shared Filesystem</h3>
<div class="outline-text-3" id="text-10-21">
<p>
From login node:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>touch ~/shared_test
</code></pre>
</div>

<p>
From compute01:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ls ~
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org5f30845">
shared_test
</pre>

<p>
This confirms successful shared filesystem operation.
</p>
</div>
</div>
<div id="outline-container-orgad2d0bf" class="outline-3">
<h3 id="orgad2d0bf"><span class="section-number-3">10.22.</span> Configure Persistent NFS Mounts</h3>
<div class="outline-text-3" id="text-10-22">
<p>
Without this configuration:
</p>

<ul class="org-ul">
<li>NFS mount disappears after reboot</li>
</ul>
</div>
</div>
