README.org
** Configure /etc/fstab

On ALL client nodes:

#+begin_src bash
sudo vim /etc/fstab
#+end_src

Add:

#+begin_example
master:/home   /home   nfs   defaults   0 0
#+end_example

** Verify fstab Before Reboot

IMPORTANT:

Always validate fstab before rebooting.

Run:

#+begin_src bash
sudo mount -a
#+end_src

If no errors appear:
- fstab configuration is correct

** Reboot Validation Procedure

Purpose:

Validate persistent cluster infrastructure after reboot.

This is important real-world HPC administration practice.

** Reboot Order
*** Reboot Master First

#+begin_src bash
sudo reboot
#+end_src

Wait until:
- SSH becomes available
- NFS server active

Verify:

#+begin_src bash
systemctl status nfs-server
#+end_src

*** Reboot Login Node

#+begin_src bash
sudo reboot
#+end_src

*** Reboot Compute Nodes

#+begin_src bash
sudo reboot
#+end_src

Perform for:
- compute01
- compute02
- compute03

** Verify Persistent Mounts After Reboot

On login node:

#+begin_src bash
df -h
#+end_src

Expected:

#+begin_example
master:/home
#+end_example

mounted automatically.

** Verify Active NFS Mount

#+begin_src bash
mount | grep home
#+end_src

Expected:

#+begin_example
master:/home on /home type nfs
#+end_example

** Verify Shared Files After Reboot

#+begin_src bash
ls ~
#+end_src

Expected:
- previously created shared files still visible
  
* Munge Authentication + Slurm Scheduler

Goal:

Transform the cluster into a scheduler-managed HPC environment.

This phase includes:

- Munge authentication
- Slurm controller setup
- Compute node daemon setup
- Scheduler configuration
- Partition creation
- Multi-node execution
- Resource allocation testing

By the end of this phase:

- cluster nodes authenticate securely
- Slurm manages compute resources
- jobs execute across nodes
- scheduler topology becomes operational

** HPC Scheduler Architecture
*** Master Node

Purpose:

- Slurm controller
- cluster scheduler
- resource manager
- Munge authority

Services:

| Service | Purpose |
|----------+----------|
| munged | cluster authentication |
| slurmctld | scheduler controller |

*** Login Node

Purpose:

- user login
- compilation
- job submission

Users should:

- login here
- compile here
- submit jobs here

*** Compute Nodes

Purpose:

- execute jobs

Services:

| Service | Purpose |
|----------+----------|
| munged | authentication |
| slurmd | compute execution daemon |

** IMPORTANT Rocky Linux 10 Issue

Originally the cluster was created using:

#+begin_example
Rocky Linux 10
#+end_example

Problem encountered:

#+begin_example
No match for argument: slurm
#+end_example

Reason:

- Rocky Linux 10 HPC ecosystem still immature
- Slurm packages unavailable in standard repos
- OpenHPC EL10 support incomplete

Resolution:

- cluster rebuilt using Rocky Linux 9 Minimal

Important HPC lesson:

Production HPC clusters usually avoid bleeding-edge enterprise releases because:

- scheduler ecosystems lag behind
- HPC repos may not exist
- compatibility becomes unstable

** Install EPEL Repository

Install on ALL nodes:

#+begin_src bash
sudo dnf install -y epel-release
#+end_src

** Enable CRB Repository

Required on Rocky Linux 9 and 10.

Install on ALL nodes:

#+begin_src bash
sudo crb enable
#+end_src

** Install Munge + Slurm Packages

Install on ALL nodes:

#+begin_src bash
sudo dnf install -y \
munge munge-libs \
slurm slurm-slurmd slurm-slurmctld
#+end_src

** Verify Installed Packages
*** Verify Munge

#+begin_src bash
rpm -qa | grep munge
#+end_src

Expected:

#+begin_example
munge
munge-libs
#+end_example

*** Verify Slurm

#+begin_src bash
rpm -qa | grep slurm
#+end_src

Expected:

#+begin_example
slurm
slurm-slurmd
slurm-slurmctld
#+end_example

** Verify System Users
*** Verify Munge User

#+begin_src bash
id munge
#+end_src

*** Verify Slurm User

#+begin_src bash
id slurm
#+end_src

** IMPORTANT Issue Encountered — Missing slurm User

Problem:

#+begin_example
id: 'slurm': no such user
#+end_example

Reason:

Some Slurm packages on Rocky Linux do not automatically create the slurm user.

Resolution:

Create manually on ALL nodes.

** Create Slurm Group

#+begin_src bash
sudo groupadd slurm
#+end_src

