README.html
<div id="outline-container-org1c671ef" class="outline-3">
<h3 id="org1c671ef"><span class="section-number-3">10.23.</span> Configure /etc/fstab</h3>
<div class="outline-text-3" id="text-10-23">
<p>
On ALL client nodes:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/fstab
</code></pre>
</div>

<p>
Add:
</p>

<pre class="example" id="orgc965dd0">
master:/home   /home   nfs   defaults   0 0
</pre>
</div>
</div>
<div id="outline-container-org64632e5" class="outline-3">
<h3 id="org64632e5"><span class="section-number-3">10.24.</span> Verify fstab Before Reboot</h3>
<div class="outline-text-3" id="text-10-24">
<p>
IMPORTANT:
</p>

<p>
Always validate fstab before rebooting.
</p>

<p>
Run:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo mount -a
</code></pre>
</div>

<p>
If no errors appear:
</p>
<ul class="org-ul">
<li>fstab configuration is correct</li>
</ul>
</div>
</div>
<div id="outline-container-org53b550a" class="outline-3">
<h3 id="org53b550a"><span class="section-number-3">10.25.</span> Reboot Validation Procedure</h3>
<div class="outline-text-3" id="text-10-25">
<p>
Purpose:
</p>

<p>
Validate persistent cluster infrastructure after reboot.
</p>

<p>
This is important real-world HPC administration practice.
</p>
</div>
</div>
<div id="outline-container-orgc3c5f2a" class="outline-3">
<h3 id="orgc3c5f2a"><span class="section-number-3">10.26.</span> Reboot Order</h3>
<div class="outline-text-3" id="text-10-26">
</div>
<ol class="org-ol">
<li><a id="orgec20b65"></a>Reboot Master First<br />
<div class="outline-text-4" id="text-10-26-1">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo reboot
</code></pre>
</div>

<p>
Wait until:
</p>
<ul class="org-ul">
<li>SSH becomes available</li>
<li>NFS server active</li>
</ul>

<p>
Verify:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>systemctl status nfs-server
</code></pre>
</div>
</div>
</li>
<li><a id="org6cf6af8"></a>Reboot Login Node<br />
<div class="outline-text-4" id="text-10-26-2">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo reboot
</code></pre>
</div>
</div>
</li>
<li><a id="org6659d72"></a>Reboot Compute Nodes<br />
<div class="outline-text-4" id="text-10-26-3">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo reboot
</code></pre>
</div>

<p>
Perform for:
</p>
<ul class="org-ul">
<li>compute01</li>
<li>compute02</li>
<li>compute03</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org0bb9c56" class="outline-3">
<h3 id="org0bb9c56"><span class="section-number-3">10.27.</span> Verify Persistent Mounts After Reboot</h3>
<div class="outline-text-3" id="text-10-27">
<p>
On login node:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>df -h
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org8ac0885">
master:/home
</pre>

<p>
mounted automatically.
</p>
</div>
</div>
<div id="outline-container-org78c1e32" class="outline-3">
<h3 id="org78c1e32"><span class="section-number-3">10.28.</span> Verify Active NFS Mount</h3>
<div class="outline-text-3" id="text-10-28">
<div class="org-src-container">
<pre class="src src-bash"><code>mount | grep home
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgdfd85af">
master:/home on /home type nfs
</pre>
</div>
</div>
<div id="outline-container-org8b170bf" class="outline-3">
<h3 id="org8b170bf"><span class="section-number-3">10.29.</span> Verify Shared Files After Reboot</h3>
<div class="outline-text-3" id="text-10-29">
<div class="org-src-container">
<pre class="src src-bash"><code>ls ~
</code></pre>
</div>

<p>
Expected:
</p>
<ul class="org-ul">
<li>previously created shared files still visible</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org98e686e" class="outline-2">
<h2 id="org98e686e"><span class="section-number-2">11.</span> Munge Authentication + Slurm Scheduler</h2>
<div class="outline-text-2" id="text-11">
<p>
Goal:
</p>

<p>
Transform the cluster into a scheduler-managed HPC environment.
</p>

<p>
This phase includes:
</p>

<ul class="org-ul">
<li>Munge authentication</li>
<li>Slurm controller setup</li>
<li>Compute node daemon setup</li>
<li>Scheduler configuration</li>
<li>Partition creation</li>
<li>Multi-node execution</li>
<li>Resource allocation testing</li>
</ul>

<p>
By the end of this phase:
</p>

<ul class="org-ul">
<li>cluster nodes authenticate securely</li>
<li>Slurm manages compute resources</li>
<li>jobs execute across nodes</li>
<li>scheduler topology becomes operational</li>
</ul>
</div>
<div id="outline-container-org92e2c91" class="outline-3">
<h3 id="org92e2c91"><span class="section-number-3">11.1.</span> HPC Scheduler Architecture</h3>
<div class="outline-text-3" id="text-11-1">
</div>
<ol class="org-ol">
<li><a id="orgdafd76c"></a>Master Node<br />
<div class="outline-text-4" id="text-11-1-1">
<p>
Purpose:
</p>

<ul class="org-ul">
<li>Slurm controller</li>
<li>cluster scheduler</li>
<li>resource manager</li>
<li>Munge authority</li>
</ul>

<p>
Services:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Service</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">munged</td>
<td class="org-left">cluster authentication</td>
</tr>

<tr>
<td class="org-left">slurmctld</td>
<td class="org-left">scheduler controller</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="orgd58dbb0"></a>Login Node<br />
<div class="outline-text-4" id="text-11-1-2">
<p>
Purpose:
</p>

<ul class="org-ul">
<li>user login</li>
<li>compilation</li>
<li>job submission</li>
</ul>

<p>
Users should:
</p>

<ul class="org-ul">
<li>login here</li>
<li>compile here</li>
<li>submit jobs here</li>
</ul>
</div>
</li>
<li><a id="org9c461ed"></a>Compute Nodes<br />
<div class="outline-text-4" id="text-11-1-3">
<p>
Purpose:
</p>

<ul class="org-ul">
<li>execute jobs</li>
</ul>

<p>
Services:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Service</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">munged</td>
<td class="org-left">authentication</td>
</tr>

<tr>
<td class="org-left">slurmd</td>
<td class="org-left">compute execution daemon</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgcd0f57b" class="outline-3">
<h3 id="orgcd0f57b"><span class="section-number-3">11.2.</span> IMPORTANT Rocky Linux 10 Issue</h3>
<div class="outline-text-3" id="text-11-2">
<p>
Originally the cluster was created using:
</p>

<pre class="example" id="orge6bc96a">
Rocky Linux 10
</pre>

<p>
Problem encountered:
</p>

<pre class="example" id="orgd4841f8">
No match for argument: slurm
</pre>

<p>
Reason:
</p>

<ul class="org-ul">
<li>Rocky Linux 10 HPC ecosystem still immature</li>
<li>Slurm packages unavailable in standard repos</li>
<li>OpenHPC EL10 support incomplete</li>
</ul>

<p>
Resolution:
</p>

<ul class="org-ul">
<li>cluster rebuilt using Rocky Linux 9 Minimal</li>
</ul>

<p>
Important HPC lesson:
</p>

<p>
Production HPC clusters usually avoid bleeding-edge enterprise releases because:
</p>

<ul class="org-ul">
<li>scheduler ecosystems lag behind</li>
<li>HPC repos may not exist</li>
<li>compatibility becomes unstable</li>
</ul>
</div>
</div>
<div id="outline-container-orgbb8ca8a" class="outline-3">
<h3 id="orgbb8ca8a"><span class="section-number-3">11.3.</span> Install EPEL Repository</h3>
<div class="outline-text-3" id="text-11-3">
<p>
Install on ALL nodes:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo dnf install -y epel-release
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgf70cff6" class="outline-3">
<h3 id="orgf70cff6"><span class="section-number-3">11.4.</span> Enable CRB Repository</h3>
<div class="outline-text-3" id="text-11-4">
<p>
Required on Rocky Linux 9 and 10.
</p>

<p>
Install on ALL nodes:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo crb enable
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org94f3913" class="outline-3">
<h3 id="org94f3913"><span class="section-number-3">11.5.</span> Install Munge + Slurm Packages</h3>
<div class="outline-text-3" id="text-11-5">
<p>
Install on ALL nodes:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo dnf install -y \
munge munge-libs \
slurm slurm-slurmd slurm-slurmctld
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org3b86ee9" class="outline-3">
<h3 id="org3b86ee9"><span class="section-number-3">11.6.</span> Verify Installed Packages</h3>
<div class="outline-text-3" id="text-11-6">
</div>
<ol class="org-ol">
<li><a id="org1553b42"></a>Verify Munge<br />
<div class="outline-text-4" id="text-11-6-1">
<div class="org-src-container">
<pre class="src src-bash"><code>rpm -qa | grep munge
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgea18627">
munge
munge-libs
</pre>
</div>
</li>
<li><a id="org998606b"></a>Verify Slurm<br />
<div class="outline-text-4" id="text-11-6-2">
<div class="org-src-container">
<pre class="src src-bash"><code>rpm -qa | grep slurm
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orga356b0d">
slurm
slurm-slurmd
slurm-slurmctld
</pre>
</div>
</li>
</ol>
</div>
<div id="outline-container-org27e3ff3" class="outline-3">
<h3 id="org27e3ff3"><span class="section-number-3">11.7.</span> Verify System Users</h3>
<div class="outline-text-3" id="text-11-7">
</div>
<ol class="org-ol">
<li><a id="orga661c87"></a>Verify Munge User<br />
<div class="outline-text-4" id="text-11-7-1">
<div class="org-src-container">
<pre class="src src-bash"><code>id munge
</code></pre>
</div>
</div>
</li>
<li><a id="orga6e70fa"></a>Verify Slurm User<br />
<div class="outline-text-4" id="text-11-7-2">
<div class="org-src-container">
<pre class="src src-bash"><code>id slurm
</code></pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org69de3c4" class="outline-3">
<h3 id="org69de3c4"><span class="section-number-3">11.8.</span> IMPORTANT Issue Encountered — Missing slurm User</h3>
<div class="outline-text-3" id="text-11-8">
<p>
Problem:
</p>

<pre class="example" id="org34b5190">
id: 'slurm': no such user
</pre>

<p>
Reason:
</p>

<p>
Some Slurm packages on Rocky Linux do not automatically create the slurm user.
</p>

<p>
Resolution:
</p>

<p>
Create manually on ALL nodes.
</p>
</div>
</div>
<div id="outline-container-orgb5f8bdb" class="outline-3">
<h3 id="orgb5f8bdb"><span class="section-number-3">11.9.</span> Create Slurm Group</h3>
<div class="outline-text-3" id="text-11-9">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo groupadd slurm
</code></pre>
</div>
</div>
</div>
