README.org
** Create Slurm User

#+begin_src bash
sudo useradd -r -g slurm -s /sbin/nologin slurm
#+end_src

Explanation:

| Option | Meaning |
|---------+----------|
| -r | system account |
| -g slurm | primary group |
| -s /sbin/nologin | disable shell login |

** Verify Slurm User

#+begin_src bash
id slurm
#+end_src

Expected:

#+begin_example
uid=...
gid=...
#+end_example

** IMPORTANT HPC Security Concept

Cluster daemons should not run permanently as root.

Therefore:

- Munge runs as munge user
- Slurm runs as slurm user

This is standard enterprise daemon security practice.

** Configure Munge Authentication

Purpose:

Create secure trust relationship between all cluster nodes.

IMPORTANT:

All nodes MUST use the same:

#+begin_example
/etc/munge/munge.key
#+end_example

This key acts as the cluster-wide shared secret.

** Generate Munge Key on Master

ONLY on master node:

#+begin_src bash
sudo /usr/sbin/create-munge-key
#+end_src

** Verify Munge Key

#+begin_src bash
ls -l /etc/munge/munge.key
#+end_src

Expected:

#+begin_example
-rw-------
#+end_example

owned by:

#+begin_example
munge munge
#+end_example

** IMPORTANT Mistake Encountered — Munge Key Generated on All Nodes

Problem:

Munge key accidentally generated independently on all nodes.

Result:

Nodes could not authenticate each other.

Important HPC lesson:

Munge works using a:

#+begin_example
shared trust model
#+end_example

All nodes MUST share identical munge.key.

** Correct Munge Key Distribution
*** Copy Key Temporarily

On master:

#+begin_src bash
sudo cp /etc/munge/munge.key /tmp/
#+end_src

*** Temporary Permission Adjustment

#+begin_src bash
sudo chmod 644 /tmp/munge.key
#+end_src

Purpose:

Allow normal user SCP transfer.

** IMPORTANT SSH Root Login Issue

Problem encountered:

#+begin_example
Permission denied (publickey,gssapi-keyex,gssapi-with-mic,password)
#+end_example

Reason:

Using:

#+begin_src bash
sudo scp ...
#+end_src

attempted root SSH login.

Rocky Linux disables direct root SSH login by default.

Resolution:

Use normal user SCP.

** Copy Munge Key to Login Node

#+begin_src bash
scp /tmp/munge.key login:/tmp/
#+end_src

** Copy Munge Key to Compute01

#+begin_src bash
scp /tmp/munge.key compute01:/tmp/
#+end_src

** Copy Munge Key to Compute02

#+begin_src bash
scp /tmp/munge.key compute02:/tmp/
#+end_src

** Copy Munge Key to Compute03

#+begin_src bash
scp /tmp/munge.key compute03:/tmp/
#+end_src

** Remove Temporary Key Copy

On master:

#+begin_src bash
sudo rm -f /tmp/munge.key
#+end_src

** Install Munge Key on Client Nodes

Perform on:

- login
- compute01
- compute02
- compute03

** Stop Munge Service

#+begin_src bash
sudo systemctl stop munge
#+end_src

** Install Key

#+begin_src bash
sudo mv /tmp/munge.key /etc/munge/
#+end_src

** Fix Ownership

#+begin_src bash
sudo chown munge:munge /etc/munge/munge.key
#+end_src

** Fix Permissions

#+begin_src bash
sudo chmod 400 /etc/munge/munge.key
#+end_src

** Start Munge

On ALL nodes:

#+begin_src bash
sudo systemctl enable --now munge
#+end_src

** IMPORTANT Issue Encountered — Munge Not Running on Master

Problem:

#+begin_example
munge: Error: Failed to access "/var/run/munge/munge.socket.2"
#+end_example

Reason:

Munge service never started on master.

Resolution:

#+begin_src bash
sudo systemctl enable --now munge
#+end_src

Important lesson:

Difference between:

| State | Meaning |
|--------+----------|
| inactive | service not started |
| failed | service crashed |

** Verify Munge Service

#+begin_src bash
systemctl status munge
#+end_src

Expected:

#+begin_example
active (running)
#+end_example

** Verify Munge Authentication

From master:

#+begin_src bash
munge -n | ssh compute01 unmunge
#+end_src

** Test Compute02

#+begin_src bash
munge -n | ssh compute02 unmunge
#+end_src

** Test Compute03

#+begin_src bash
munge -n | ssh compute03 unmunge
#+end_src

** Test Login Node

#+begin_src bash
munge -n | ssh login unmunge
#+end_src

Expected:

#+begin_example
STATUS: Success
#+end_example

