README.html
<div id="outline-container-org15c49a0" class="outline-3">
<h3 id="org15c49a0"><span class="section-number-3">11.10.</span> Create Slurm User</h3>
<div class="outline-text-3" id="text-11-10">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo useradd -r -g slurm -s /sbin/nologin slurm
</code></pre>
</div>

<p>
Explanation:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Option</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">-r</td>
<td class="org-left">system account</td>
</tr>

<tr>
<td class="org-left">-g slurm</td>
<td class="org-left">primary group</td>
</tr>

<tr>
<td class="org-left">-s /sbin/nologin</td>
<td class="org-left">disable shell login</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgbb0aa39" class="outline-3">
<h3 id="orgbb0aa39"><span class="section-number-3">11.11.</span> Verify Slurm User</h3>
<div class="outline-text-3" id="text-11-11">
<div class="org-src-container">
<pre class="src src-bash"><code>id slurm
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org5f2facf">
uid=...
gid=...
</pre>
</div>
</div>
<div id="outline-container-orgadb2599" class="outline-3">
<h3 id="orgadb2599"><span class="section-number-3">11.12.</span> IMPORTANT HPC Security Concept</h3>
<div class="outline-text-3" id="text-11-12">
<p>
Cluster daemons should not run permanently as root.
</p>

<p>
Therefore:
</p>

<ul class="org-ul">
<li>Munge runs as munge user</li>
<li>Slurm runs as slurm user</li>
</ul>

<p>
This is standard enterprise daemon security practice.
</p>
</div>
</div>
<div id="outline-container-orgf97f031" class="outline-3">
<h3 id="orgf97f031"><span class="section-number-3">11.13.</span> Configure Munge Authentication</h3>
<div class="outline-text-3" id="text-11-13">
<p>
Purpose:
</p>

<p>
Create secure trust relationship between all cluster nodes.
</p>

<p>
IMPORTANT:
</p>

<p>
All nodes MUST use the same:
</p>

<pre class="example" id="orgb97cd25">
/etc/munge/munge.key
</pre>

<p>
This key acts as the cluster-wide shared secret.
</p>
</div>
</div>
<div id="outline-container-org040b752" class="outline-3">
<h3 id="org040b752"><span class="section-number-3">11.14.</span> Generate Munge Key on Master</h3>
<div class="outline-text-3" id="text-11-14">
<p>
ONLY on master node:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo /usr/sbin/create-munge-key
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org4bf7c97" class="outline-3">
<h3 id="org4bf7c97"><span class="section-number-3">11.15.</span> Verify Munge Key</h3>
<div class="outline-text-3" id="text-11-15">
<div class="org-src-container">
<pre class="src src-bash"><code>ls -l /etc/munge/munge.key
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org77c2a59">
-rw-------
</pre>

<p>
owned by:
</p>

<pre class="example" id="org67a5b99">
munge munge
</pre>
</div>
</div>
<div id="outline-container-org4eebf14" class="outline-3">
<h3 id="org4eebf14"><span class="section-number-3">11.16.</span> IMPORTANT Mistake Encountered — Munge Key Generated on All Nodes</h3>
<div class="outline-text-3" id="text-11-16">
<p>
Problem:
</p>

<p>
Munge key accidentally generated independently on all nodes.
</p>

<p>
Result:
</p>

<p>
Nodes could not authenticate each other.
</p>

<p>
Important HPC lesson:
</p>

<p>
Munge works using a:
</p>

<pre class="example" id="org25f9b4d">
shared trust model
</pre>

<p>
All nodes MUST share identical munge.key.
</p>
</div>
</div>
<div id="outline-container-org0b9059f" class="outline-3">
<h3 id="org0b9059f"><span class="section-number-3">11.17.</span> Correct Munge Key Distribution</h3>
<div class="outline-text-3" id="text-11-17">
</div>
<ol class="org-ol">
<li><a id="org376ecff"></a>Copy Key Temporarily<br />
<div class="outline-text-4" id="text-11-17-1">
<p>
On master:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo cp /etc/munge/munge.key /tmp/
</code></pre>
</div>
</div>
</li>
<li><a id="org7d043c4"></a>Temporary Permission Adjustment<br />
<div class="outline-text-4" id="text-11-17-2">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo chmod 644 /tmp/munge.key
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Allow normal user SCP transfer.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org3e98449" class="outline-3">
<h3 id="org3e98449"><span class="section-number-3">11.18.</span> IMPORTANT SSH Root Login Issue</h3>
<div class="outline-text-3" id="text-11-18">
<p>
Problem encountered:
</p>

<pre class="example" id="org1e4a72e">
Permission denied (publickey,gssapi-keyex,gssapi-with-mic,password)
</pre>

<p>
Reason:
</p>

<p>
Using:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo scp ...
</code></pre>
</div>

<p>
attempted root SSH login.
</p>

<p>
Rocky Linux disables direct root SSH login by default.
</p>

<p>
Resolution:
</p>

<p>
Use normal user SCP.
</p>
</div>
</div>
<div id="outline-container-orga3febcd" class="outline-3">
<h3 id="orga3febcd"><span class="section-number-3">11.19.</span> Copy Munge Key to Login Node</h3>
<div class="outline-text-3" id="text-11-19">
<div class="org-src-container">
<pre class="src src-bash"><code>scp /tmp/munge.key login:/tmp/
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org108314a" class="outline-3">
<h3 id="org108314a"><span class="section-number-3">11.20.</span> Copy Munge Key to Compute01</h3>
<div class="outline-text-3" id="text-11-20">
<div class="org-src-container">
<pre class="src src-bash"><code>scp /tmp/munge.key compute01:/tmp/
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org6094168" class="outline-3">
<h3 id="org6094168"><span class="section-number-3">11.21.</span> Copy Munge Key to Compute02</h3>
<div class="outline-text-3" id="text-11-21">
<div class="org-src-container">
<pre class="src src-bash"><code>scp /tmp/munge.key compute02:/tmp/
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org955292a" class="outline-3">
<h3 id="org955292a"><span class="section-number-3">11.22.</span> Copy Munge Key to Compute03</h3>
<div class="outline-text-3" id="text-11-22">
<div class="org-src-container">
<pre class="src src-bash"><code>scp /tmp/munge.key compute03:/tmp/
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org322ac43" class="outline-3">
<h3 id="org322ac43"><span class="section-number-3">11.23.</span> Remove Temporary Key Copy</h3>
<div class="outline-text-3" id="text-11-23">
<p>
On master:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo rm -f /tmp/munge.key
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org90c04c6" class="outline-3">
<h3 id="org90c04c6"><span class="section-number-3">11.24.</span> Install Munge Key on Client Nodes</h3>
<div class="outline-text-3" id="text-11-24">
<p>
Perform on:
</p>

<ul class="org-ul">
<li>login</li>
<li>compute01</li>
<li>compute02</li>
<li>compute03</li>
</ul>
</div>
</div>
<div id="outline-container-org5d6111d" class="outline-3">
<h3 id="org5d6111d"><span class="section-number-3">11.25.</span> Stop Munge Service</h3>
<div class="outline-text-3" id="text-11-25">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl stop munge
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org4c373ec" class="outline-3">
<h3 id="org4c373ec"><span class="section-number-3">11.26.</span> Install Key</h3>
<div class="outline-text-3" id="text-11-26">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo mv /tmp/munge.key /etc/munge/
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org4669fdf" class="outline-3">
<h3 id="org4669fdf"><span class="section-number-3">11.27.</span> Fix Ownership</h3>
<div class="outline-text-3" id="text-11-27">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo chown munge:munge /etc/munge/munge.key
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org7899a48" class="outline-3">
<h3 id="org7899a48"><span class="section-number-3">11.28.</span> Fix Permissions</h3>
<div class="outline-text-3" id="text-11-28">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo chmod 400 /etc/munge/munge.key
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orged2f2ac" class="outline-3">
<h3 id="orged2f2ac"><span class="section-number-3">11.29.</span> Start Munge</h3>
<div class="outline-text-3" id="text-11-29">
<p>
On ALL nodes:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl enable --now munge
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org565712f" class="outline-3">
<h3 id="org565712f"><span class="section-number-3">11.30.</span> IMPORTANT Issue Encountered — Munge Not Running on Master</h3>
<div class="outline-text-3" id="text-11-30">
<p>
Problem:
</p>

<pre class="example" id="orgbddba57">
munge: Error: Failed to access "/var/run/munge/munge.socket.2"
</pre>

<p>
Reason:
</p>

<p>
Munge service never started on master.
</p>

<p>
Resolution:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl enable --now munge
</code></pre>
</div>

<p>
Important lesson:
</p>

<p>
Difference between:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">State</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">inactive</td>
<td class="org-left">service not started</td>
</tr>

<tr>
<td class="org-left">failed</td>
<td class="org-left">service crashed</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orga46c5f5" class="outline-3">
<h3 id="orga46c5f5"><span class="section-number-3">11.31.</span> Verify Munge Service</h3>
<div class="outline-text-3" id="text-11-31">
<div class="org-src-container">
<pre class="src src-bash"><code>systemctl status munge
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org8c3595e">
active (running)
</pre>
</div>
</div>
<div id="outline-container-orgb389ab3" class="outline-3">
<h3 id="orgb389ab3"><span class="section-number-3">11.32.</span> Verify Munge Authentication</h3>
<div class="outline-text-3" id="text-11-32">
<p>
From master:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>munge -n | ssh compute01 unmunge
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgea24ebf" class="outline-3">
<h3 id="orgea24ebf"><span class="section-number-3">11.33.</span> Test Compute02</h3>
<div class="outline-text-3" id="text-11-33">
<div class="org-src-container">
<pre class="src src-bash"><code>munge -n | ssh compute02 unmunge
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgc5b77a7" class="outline-3">
<h3 id="orgc5b77a7"><span class="section-number-3">11.34.</span> Test Compute03</h3>
<div class="outline-text-3" id="text-11-34">
<div class="org-src-container">
<pre class="src src-bash"><code>munge -n | ssh compute03 unmunge
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgd5e84df" class="outline-3">
<h3 id="orgd5e84df"><span class="section-number-3">11.35.</span> Test Login Node</h3>
<div class="outline-text-3" id="text-11-35">
<div class="org-src-container">
<pre class="src src-bash"><code>munge -n | ssh login unmunge
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org38e604b">
STATUS: Success
</pre>
</div>
</div>
