README.org
** HPC Concepts Learned

Munge introduced:

- cluster-wide authentication
- distributed trust model
- shared secret authentication
- daemon security
- inter-node trust validation

** Configure Slurm Scheduler

Purpose:

Enable centralized resource scheduling.

IMPORTANT:

#+begin_example
/etc/slurm/slurm.conf
#+end_example

must be IDENTICAL on ALL nodes.

** IMPORTANT Issue Encountered — Default localhost Configuration

Problem:

#+begin_example
sinfo
-> localhost
#+end_example

Reason:

Default example slurm.conf remained active.

Resolution:

Replace configuration with custom cluster topology.

Important HPC lesson:

Incorrect topology configuration is one of the most common Slurm admin problems.

** Create Slurm Configuration

On master:

#+begin_src bash
sudo vim /etc/slurm/slurm.conf
#+end_src

Replace ENTIRE file with:

#+begin_src ini :tangle slurm.conf
ClusterName=hpccluster
SlurmctldHost=master

MpiDefault=none
ProctrackType=proctrack/cgroup
ReturnToService=2

SlurmctldPidFile=/run/slurmctld.pid
SlurmdPidFile=/run/slurmd.pid

SlurmdSpoolDir=/var/spool/slurmd
StateSaveLocation=/var/spool/slurmctld

SlurmUser=slurm

SwitchType=switch/none
TaskPlugin=task/affinity

SchedulerType=sched/backfill

SelectType=select/cons_tres
SelectTypeParameters=CR_Core

AuthType=auth/munge

NodeName=compute01 CPUs=2 State=UNKNOWN
NodeName=compute02 CPUs=2 State=UNKNOWN
NodeName=compute03 CPUs=2 State=UNKNOWN

PartitionName=debug Nodes=ALL Default=YES MaxTime=INFINITE State=UP
#+end_src

** Configuration Explanation

| Parameter | Purpose |
|------------+----------|
| ClusterName | cluster identifier |
| SlurmctldHost | controller node |
| NodeName | compute nodes |
| CPUs=2 | available CPUs |
| PartitionName | scheduler queue |

** Create Slurm Runtime Directories
*** On Master

#+begin_src bash
sudo mkdir -p /var/spool/slurmctld
#+end_src

#+begin_src bash
sudo mkdir -p /var/spool/slurmd
#+end_src

** Set Ownership

#+begin_src bash
sudo chown slurm:slurm /var/spool/slurmctld
#+end_src

#+begin_src bash
sudo chown slurm:slurm /var/spool/slurmd
#+end_src

** Create slurmd Directories on Compute Nodes
*** Compute01

#+begin_src bash
ssh compute01 sudo -S mkdir -p /var/spool/slurmd
#+end_src

*** Compute02

#+begin_src bash
ssh compute02 sudo -S mkdir -p /var/spool/slurmd
#+end_src

*** Compute03

#+begin_src bash
ssh compute03 sudo -S mkdir -p /var/spool/slurmd
#+end_src

** IMPORTANT sudo Over SSH Issue

Problem:

#+begin_example
sudo: a terminal is required to read the password
#+end_example

Resolution:

Use:

#+begin_src bash
sudo -S
#+end_src

Important Linux administration concept:

sudo over non-interactive SSH requires stdin password handling.

** Fix Ownership on Compute Nodes
*** Compute01

#+begin_src bash
ssh compute01 sudo -S chown slurm:slurm /var/spool/slurmd
#+end_src

*** Compute02

#+begin_src bash
ssh compute02 sudo -S chown slurm:slurm /var/spool/slurmd
#+end_src

*** Compute03

#+begin_src bash
ssh compute03 sudo -S chown slurm:slurm /var/spool/slurmd
#+end_src

** Verify Runtime Directories

#+begin_src bash
ls -ld /var/spool/slurmctld
#+end_src

Expected:

#+begin_example
slurm slurm
#+end_example

** Distribute slurm.conf
*** Login

#+begin_src bash
scp /etc/slurm/slurm.conf login:/tmp/
#+end_src

*** Compute01

#+begin_src bash
scp /etc/slurm/slurm.conf compute01:/tmp/
#+end_src

*** Compute02

#+begin_src bash
scp /etc/slurm/slurm.conf compute02:/tmp/
#+end_src

*** Compute03

#+begin_src bash
scp /etc/slurm/slurm.conf compute03:/tmp/
#+end_src

** Install Configuration on Nodes

On ALL nodes:

#+begin_src bash
sudo mv /tmp/slurm.conf /etc/slurm/slurm.conf
#+end_src

** Start Slurm Controller

ONLY on master:

#+begin_src bash
sudo systemctl enable --now slurmctld
#+end_src

** Verify Controller

#+begin_src bash
systemctl status slurmctld
#+end_src

Expected:

#+begin_example
active (running)
#+end_example

** Start slurmd on Compute Nodes

On:
- compute01
- compute02
- compute03

#+begin_src bash
sudo systemctl enable --now slurmd
#+end_src

** Verify slurmd

#+begin_src bash
systemctl status slurmd
#+end_src

Expected:

#+begin_example
active (running)
#+end_example

** Reconfigure Slurm

On master:

#+begin_src bash
sudo scontrol reconfigure
#+end_src

