README.html
<div id="outline-container-orga1312be" class="outline-3">
<h3 id="orga1312be"><span class="section-number-3">11.36.</span> HPC Concepts Learned</h3>
<div class="outline-text-3" id="text-11-36">
<p>
Munge introduced:
</p>

<ul class="org-ul">
<li>cluster-wide authentication</li>
<li>distributed trust model</li>
<li>shared secret authentication</li>
<li>daemon security</li>
<li>inter-node trust validation</li>
</ul>
</div>
</div>
<div id="outline-container-org109c94d" class="outline-3">
<h3 id="org109c94d"><span class="section-number-3">11.37.</span> Configure Slurm Scheduler</h3>
<div class="outline-text-3" id="text-11-37">
<p>
Purpose:
</p>

<p>
Enable centralized resource scheduling.
</p>

<p>
IMPORTANT:
</p>

<pre class="example" id="org035ce8d">
/etc/slurm/slurm.conf
</pre>

<p>
must be IDENTICAL on ALL nodes.
</p>
</div>
</div>
<div id="outline-container-org6691db3" class="outline-3">
<h3 id="org6691db3"><span class="section-number-3">11.38.</span> IMPORTANT Issue Encountered — Default localhost Configuration</h3>
<div class="outline-text-3" id="text-11-38">
<p>
Problem:
</p>

<pre class="example" id="org87037c4">
sinfo
-&gt; localhost
</pre>

<p>
Reason:
</p>

<p>
Default example slurm.conf remained active.
</p>

<p>
Resolution:
</p>

<p>
Replace configuration with custom cluster topology.
</p>

<p>
Important HPC lesson:
</p>

<p>
Incorrect topology configuration is one of the most common Slurm admin problems.
</p>
</div>
</div>
<div id="outline-container-orgcf249dc" class="outline-3">
<h3 id="orgcf249dc"><span class="section-number-3">11.39.</span> Create Slurm Configuration</h3>
<div class="outline-text-3" id="text-11-39">
<p>
On master:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/slurm/slurm.conf
</code></pre>
</div>

<p>
Replace ENTIRE file with:
</p>

<div class="org-src-container">
<pre class="src src-ini"><code>ClusterName=hpccluster
SlurmctldHost=master

MpiDefault=none
ProctrackType=proctrack/cgroup
ReturnToService=2

SlurmctldPidFile=/run/slurmctld.pid
SlurmdPidFile=/run/slurmd.pid

SlurmdSpoolDir=/var/spool/slurmd
StateSaveLocation=/var/spool/slurmctld

SlurmUser=slurm

SwitchType=switch/none
TaskPlugin=task/affinity

SchedulerType=sched/backfill

SelectType=select/cons_tres
SelectTypeParameters=CR_Core

AuthType=auth/munge

NodeName=compute01 CPUs=2 State=UNKNOWN
NodeName=compute02 CPUs=2 State=UNKNOWN
NodeName=compute03 CPUs=2 State=UNKNOWN

PartitionName=debug Nodes=ALL Default=YES MaxTime=INFINITE State=UP
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orga537f0b" class="outline-3">
<h3 id="orga537f0b"><span class="section-number-3">11.40.</span> Configuration Explanation</h3>
<div class="outline-text-3" id="text-11-40">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Parameter</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ClusterName</td>
<td class="org-left">cluster identifier</td>
</tr>

<tr>
<td class="org-left">SlurmctldHost</td>
<td class="org-left">controller node</td>
</tr>

<tr>
<td class="org-left">NodeName</td>
<td class="org-left">compute nodes</td>
</tr>

<tr>
<td class="org-left">CPUs=2</td>
<td class="org-left">available CPUs</td>
</tr>

<tr>
<td class="org-left">PartitionName</td>
<td class="org-left">scheduler queue</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgbcdcf8c" class="outline-3">
<h3 id="orgbcdcf8c"><span class="section-number-3">11.41.</span> Create Slurm Runtime Directories</h3>
<div class="outline-text-3" id="text-11-41">
</div>
<ol class="org-ol">
<li><a id="orgbf7126f"></a>On Master<br />
<div class="outline-text-4" id="text-11-41-1">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo mkdir -p /var/spool/slurmctld
</code></pre>
</div>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo mkdir -p /var/spool/slurmd
</code></pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgeb110de" class="outline-3">
<h3 id="orgeb110de"><span class="section-number-3">11.42.</span> Set Ownership</h3>
<div class="outline-text-3" id="text-11-42">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo chown slurm:slurm /var/spool/slurmctld
</code></pre>
</div>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo chown slurm:slurm /var/spool/slurmd
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org80e5964" class="outline-3">
<h3 id="org80e5964"><span class="section-number-3">11.43.</span> Create slurmd Directories on Compute Nodes</h3>
<div class="outline-text-3" id="text-11-43">
</div>
<ol class="org-ol">
<li><a id="org5c6257a"></a>Compute01<br />
<div class="outline-text-4" id="text-11-43-1">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh compute01 sudo -S mkdir -p /var/spool/slurmd
</code></pre>
</div>
</div>
</li>
<li><a id="org91f980d"></a>Compute02<br />
<div class="outline-text-4" id="text-11-43-2">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh compute02 sudo -S mkdir -p /var/spool/slurmd
</code></pre>
</div>
</div>
</li>
<li><a id="org79814ec"></a>Compute03<br />
<div class="outline-text-4" id="text-11-43-3">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh compute03 sudo -S mkdir -p /var/spool/slurmd
</code></pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org2de2be7" class="outline-3">
<h3 id="org2de2be7"><span class="section-number-3">11.44.</span> IMPORTANT sudo Over SSH Issue</h3>
<div class="outline-text-3" id="text-11-44">
<p>
Problem:
</p>

<pre class="example" id="org8723eb2">
sudo: a terminal is required to read the password
</pre>

<p>
Resolution:
</p>

<p>
Use:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo -S
</code></pre>
</div>

<p>
Important Linux administration concept:
</p>

<p>
sudo over non-interactive SSH requires stdin password handling.
</p>
</div>
</div>
<div id="outline-container-org1d771b0" class="outline-3">
<h3 id="org1d771b0"><span class="section-number-3">11.45.</span> Fix Ownership on Compute Nodes</h3>
<div class="outline-text-3" id="text-11-45">
</div>
<ol class="org-ol">
<li><a id="orge8534f4"></a>Compute01<br />
<div class="outline-text-4" id="text-11-45-1">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh compute01 sudo -S chown slurm:slurm /var/spool/slurmd
</code></pre>
</div>
</div>
</li>
<li><a id="org96affd2"></a>Compute02<br />
<div class="outline-text-4" id="text-11-45-2">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh compute02 sudo -S chown slurm:slurm /var/spool/slurmd
</code></pre>
</div>
</div>
</li>
<li><a id="orge67bdb9"></a>Compute03<br />
<div class="outline-text-4" id="text-11-45-3">
<div class="org-src-container">
<pre class="src src-bash"><code>ssh compute03 sudo -S chown slurm:slurm /var/spool/slurmd
</code></pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-org0818501" class="outline-3">
<h3 id="org0818501"><span class="section-number-3">11.46.</span> Verify Runtime Directories</h3>
<div class="outline-text-3" id="text-11-46">
<div class="org-src-container">
<pre class="src src-bash"><code>ls -ld /var/spool/slurmctld
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org880cb01">
slurm slurm
</pre>
</div>
</div>
<div id="outline-container-orgd64a468" class="outline-3">
<h3 id="orgd64a468"><span class="section-number-3">11.47.</span> Distribute slurm.conf</h3>
<div class="outline-text-3" id="text-11-47">
</div>
<ol class="org-ol">
<li><a id="org459d91e"></a>Login<br />
<div class="outline-text-4" id="text-11-47-1">
<div class="org-src-container">
<pre class="src src-bash"><code>scp /etc/slurm/slurm.conf login:/tmp/
</code></pre>
</div>
</div>
</li>
<li><a id="orgb0f3e0c"></a>Compute01<br />
<div class="outline-text-4" id="text-11-47-2">
<div class="org-src-container">
<pre class="src src-bash"><code>scp /etc/slurm/slurm.conf compute01:/tmp/
</code></pre>
</div>
</div>
</li>
<li><a id="org69fc2bb"></a>Compute02<br />
<div class="outline-text-4" id="text-11-47-3">
<div class="org-src-container">
<pre class="src src-bash"><code>scp /etc/slurm/slurm.conf compute02:/tmp/
</code></pre>
</div>
</div>
</li>
<li><a id="org0bb08a0"></a>Compute03<br />
<div class="outline-text-4" id="text-11-47-4">
<div class="org-src-container">
<pre class="src src-bash"><code>scp /etc/slurm/slurm.conf compute03:/tmp/
</code></pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orge8a7688" class="outline-3">
<h3 id="orge8a7688"><span class="section-number-3">11.48.</span> Install Configuration on Nodes</h3>
<div class="outline-text-3" id="text-11-48">
<p>
On ALL nodes:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo mv /tmp/slurm.conf /etc/slurm/slurm.conf
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org218d434" class="outline-3">
<h3 id="org218d434"><span class="section-number-3">11.49.</span> Start Slurm Controller</h3>
<div class="outline-text-3" id="text-11-49">
<p>
ONLY on master:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl enable --now slurmctld
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org147409f" class="outline-3">
<h3 id="org147409f"><span class="section-number-3">11.50.</span> Verify Controller</h3>
<div class="outline-text-3" id="text-11-50">
<div class="org-src-container">
<pre class="src src-bash"><code>systemctl status slurmctld
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org88efcc9">
active (running)
</pre>
</div>
</div>
<div id="outline-container-org8fa168c" class="outline-3">
<h3 id="org8fa168c"><span class="section-number-3">11.51.</span> Start slurmd on Compute Nodes</h3>
<div class="outline-text-3" id="text-11-51">
<p>
On:
</p>
<ul class="org-ul">
<li>compute01</li>
<li>compute02</li>
<li>compute03</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl enable --now slurmd
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org75ce03c" class="outline-3">
<h3 id="org75ce03c"><span class="section-number-3">11.52.</span> Verify slurmd</h3>
<div class="outline-text-3" id="text-11-52">
<div class="org-src-container">
<pre class="src src-bash"><code>systemctl status slurmd
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org41c6b2f">
active (running)
</pre>
</div>
</div>
<div id="outline-container-org733c92c" class="outline-3">
<h3 id="org733c92c"><span class="section-number-3">11.53.</span> Reconfigure Slurm</h3>
<div class="outline-text-3" id="text-11-53">
<p>
On master:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo scontrol reconfigure
</code></pre>
</div>
</div>
</div>
