README.org
** IMPORTANT Issue Encountered — Nodes in DRAIN State

Problem:

Nodes entered:

#+begin_example
DRAIN
#+end_example

after CPU topology changes.

Reason:

Slurm detected mismatch between:
- configured CPUs
- detected hardware topology

Resolution:

Clear stale slurmd state.

** Stop slurmd

On compute nodes:

#+begin_src bash
sudo systemctl stop slurmd
#+end_src

** Remove Old State

#+begin_src bash
sudo rm -rf /var/spool/slurmd/*
#+end_src

** Restart slurmd

#+begin_src bash
sudo systemctl start slurmd
#+end_src

** Resume Nodes

On master:

#+begin_src bash
sudo scontrol update NodeName=compute01 State=RESUME
#+end_src

#+begin_src bash
sudo scontrol update NodeName=compute02 State=RESUME
#+end_src

#+begin_src bash
sudo scontrol update NodeName=compute03 State=RESUME
#+end_src

** Verify Cluster Status

#+begin_src bash
sinfo
#+end_src

Expected:

#+begin_example
PARTITION AVAIL TIMELIMIT NODES STATE NODELIST
debug* up infinite 3 idle compute[01-03]
#+end_example

** Verify Node Details

#+begin_src bash
scontrol show nodes
#+end_src

This displays:

- CPU information
- memory
- node states
- scheduler topology
- resource allocation

** Test Slurm Execution
*** Single Node Test

From login node:

#+begin_src bash
srun hostname
#+end_src

Expected:

#+begin_example
compute01.local
#+end_example

** Multi-node Execution

#+begin_src bash
srun -N 3 hostname
#+end_src

Expected:

#+begin_example
compute01.local
compute02.local
compute03.local
#+end_example

** Multi-task Multi-node Execution

#+begin_src bash
srun -N 3 -n 6 hostname
#+end_src

This verifies:

- task distribution
- multi-node scheduling
- CPU allocation

** Multi-core Single-node Execution

#+begin_src bash
srun -N 1 -n 2 hostname
#+end_src

Expected:

#+begin_example
compute01.local
compute01.local
#+end_example

** IMPORTANT Slurm Scheduling Concept

Earlier:

#+begin_src bash
srun -N 1 -n 2 hostname
#+end_src

failed because nodes initially had:

#+begin_example
CPUs=1
#+end_example

After increasing VM CPUs and updating slurm.conf:

#+begin_example
CPUs=2
#+end_example

the scheduler successfully allocated 2 tasks on a single node.

Important HPC lesson:

Slurm strictly enforces:
- CPU limits
- task allocation
- topology constraints
- resource consistency
  
* Shared Software Filesystem (/apps)

Goal:

Create a dedicated shared software filesystem for:

- Spack
- compilers
- MPI stacks
- scientific applications
- modulefiles
- HPC software hierarchy

This phase transitions the cluster from:

#+begin_example
basic scheduler infrastructure
#+end_example

to:

#+begin_example
realistic HPC software environment
#+end_example

** Why Separate /apps Filesystem?

Initially:

- each VM had a 30 GB local disk
- /home was exported from master over NFS

Concern encountered:

#+begin_example
Shared /home only had ~30 GB available.
Spack and HPC software stacks can become very large.
#+end_example

Important HPC storage concept:

Real HPC clusters usually separate:

| Filesystem | Purpose |
|-------------+----------|
| /home | user files |
| /apps | software stack |
| /scratch | temporary runtime data |
| /archive | long-term storage |

Therefore a dedicated:

#+begin_example
/apps
#+end_example

filesystem was created.

This is significantly closer to real HPC architecture.

** IMPORTANT Storage Architecture Concept

Each VM still has its own independent local storage.

Example:

| Node | Local Disk |
|-------+-------------|
| master | 30 GB |
| login | 30 GB |
| compute01 | 30 GB |
| compute02 | 30 GB |
| compute03 | 30 GB |

When:

#+begin_example
master:/home
#+end_example

was mounted via NFS:

- compute node local /home became hidden
- but local disks still exist

Only the exported filesystem becomes shared.

Therefore:

#+begin_example
/apps
#+end_example

was created as a dedicated shared software layer.

** Add New Virtual Disk to Master

A second virtual disk was attached ONLY to:

#+begin_example
master
#+end_example

Purpose:

- centralized software storage
- shared application filesystem
- Spack software stack

Disk size selected:

#+begin_example
60 GB
#+end_example

Disk type:

#+begin_example
VDI (Dynamically Allocated)
#+end_example

** Verify New Disk Detection

After booting master:

#+begin_src bash
lsblk
#+end_src

Expected:

#+begin_example
sda    30G
sdb    60G
#+end_example

Important:

| Device | Purpose |
|---------+----------|
| sda | OS disk |
| sdb | New apps disk |

Only:

#+begin_example
sdb
#+end_example

was modified.

