README.html
<div id="outline-container-orgebc79d1" class="outline-3">
<h3 id="orgebc79d1"><span class="section-number-3">11.54.</span> IMPORTANT Issue Encountered — Nodes in DRAIN State</h3>
<div class="outline-text-3" id="text-11-54">
<p>
Problem:
</p>

<p>
Nodes entered:
</p>

<pre class="example" id="orgef98dff">
DRAIN
</pre>

<p>
after CPU topology changes.
</p>

<p>
Reason:
</p>

<p>
Slurm detected mismatch between:
</p>
<ul class="org-ul">
<li>configured CPUs</li>
<li>detected hardware topology</li>
</ul>

<p>
Resolution:
</p>

<p>
Clear stale slurmd state.
</p>
</div>
</div>
<div id="outline-container-orgaa2e46e" class="outline-3">
<h3 id="orgaa2e46e"><span class="section-number-3">11.55.</span> Stop slurmd</h3>
<div class="outline-text-3" id="text-11-55">
<p>
On compute nodes:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl stop slurmd
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org2008f95" class="outline-3">
<h3 id="org2008f95"><span class="section-number-3">11.56.</span> Remove Old State</h3>
<div class="outline-text-3" id="text-11-56">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo rm -rf /var/spool/slurmd/*
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgb7176e3" class="outline-3">
<h3 id="orgb7176e3"><span class="section-number-3">11.57.</span> Restart slurmd</h3>
<div class="outline-text-3" id="text-11-57">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl start slurmd
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org2097847" class="outline-3">
<h3 id="org2097847"><span class="section-number-3">11.58.</span> Resume Nodes</h3>
<div class="outline-text-3" id="text-11-58">
<p>
On master:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo scontrol update NodeName=compute01 State=RESUME
</code></pre>
</div>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo scontrol update NodeName=compute02 State=RESUME
</code></pre>
</div>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo scontrol update NodeName=compute03 State=RESUME
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org3ebb772" class="outline-3">
<h3 id="org3ebb772"><span class="section-number-3">11.59.</span> Verify Cluster Status</h3>
<div class="outline-text-3" id="text-11-59">
<div class="org-src-container">
<pre class="src src-bash"><code>sinfo
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orga992e5e">
PARTITION AVAIL TIMELIMIT NODES STATE NODELIST
debug* up infinite 3 idle compute[01-03]
</pre>
</div>
</div>
<div id="outline-container-orgf6fc7d6" class="outline-3">
<h3 id="orgf6fc7d6"><span class="section-number-3">11.60.</span> Verify Node Details</h3>
<div class="outline-text-3" id="text-11-60">
<div class="org-src-container">
<pre class="src src-bash"><code>scontrol show nodes
</code></pre>
</div>

<p>
This displays:
</p>

<ul class="org-ul">
<li>CPU information</li>
<li>memory</li>
<li>node states</li>
<li>scheduler topology</li>
<li>resource allocation</li>
</ul>
</div>
</div>
<div id="outline-container-org40d6901" class="outline-3">
<h3 id="org40d6901"><span class="section-number-3">11.61.</span> Test Slurm Execution</h3>
<div class="outline-text-3" id="text-11-61">
</div>
<ol class="org-ol">
<li><a id="orgf0859c6"></a>Single Node Test<br />
<div class="outline-text-4" id="text-11-61-1">
<p>
From login node:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>srun hostname
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org56659a6">
compute01.local
</pre>
</div>
</li>
</ol>
</div>
<div id="outline-container-org6cd8adb" class="outline-3">
<h3 id="org6cd8adb"><span class="section-number-3">11.62.</span> Multi-node Execution</h3>
<div class="outline-text-3" id="text-11-62">
<div class="org-src-container">
<pre class="src src-bash"><code>srun -N 3 hostname
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org47f96ec">
compute01.local
compute02.local
compute03.local
</pre>
</div>
</div>
<div id="outline-container-org653fc7b" class="outline-3">
<h3 id="org653fc7b"><span class="section-number-3">11.63.</span> Multi-task Multi-node Execution</h3>
<div class="outline-text-3" id="text-11-63">
<div class="org-src-container">
<pre class="src src-bash"><code>srun -N 3 -n 6 hostname
</code></pre>
</div>

<p>
This verifies:
</p>

<ul class="org-ul">
<li>task distribution</li>
<li>multi-node scheduling</li>
<li>CPU allocation</li>
</ul>
</div>
</div>
<div id="outline-container-orgdb7e395" class="outline-3">
<h3 id="orgdb7e395"><span class="section-number-3">11.64.</span> Multi-core Single-node Execution</h3>
<div class="outline-text-3" id="text-11-64">
<div class="org-src-container">
<pre class="src src-bash"><code>srun -N 1 -n 2 hostname
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgb158eb2">
compute01.local
compute01.local
</pre>
</div>
</div>
<div id="outline-container-org8b9ff5f" class="outline-3">
<h3 id="org8b9ff5f"><span class="section-number-3">11.65.</span> IMPORTANT Slurm Scheduling Concept</h3>
<div class="outline-text-3" id="text-11-65">
<p>
Earlier:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>srun -N 1 -n 2 hostname
</code></pre>
</div>

<p>
failed because nodes initially had:
</p>

<pre class="example" id="org022107e">
CPUs=1
</pre>

<p>
After increasing VM CPUs and updating slurm.conf:
</p>

<pre class="example" id="org1bef474">
CPUs=2
</pre>

<p>
the scheduler successfully allocated 2 tasks on a single node.
</p>

<p>
Important HPC lesson:
</p>

<p>
Slurm strictly enforces:
</p>
<ul class="org-ul">
<li>CPU limits</li>
<li>task allocation</li>
<li>topology constraints</li>
<li>resource consistency</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge296905" class="outline-2">
<h2 id="orge296905"><span class="section-number-2">12.</span> Shared Software Filesystem (/apps)</h2>
<div class="outline-text-2" id="text-12">
<p>
Goal:
</p>

<p>
Create a dedicated shared software filesystem for:
</p>

<ul class="org-ul">
<li>Spack</li>
<li>compilers</li>
<li>MPI stacks</li>
<li>scientific applications</li>
<li>modulefiles</li>
<li>HPC software hierarchy</li>
</ul>

<p>
This phase transitions the cluster from:
</p>

<pre class="example" id="orgdecf392">
basic scheduler infrastructure
</pre>

<p>
to:
</p>

<pre class="example" id="orgba9aa58">
realistic HPC software environment
</pre>
</div>
<div id="outline-container-org444dc0d" class="outline-3">
<h3 id="org444dc0d"><span class="section-number-3">12.1.</span> Why Separate /apps Filesystem?</h3>
<div class="outline-text-3" id="text-12-1">
<p>
Initially:
</p>

<ul class="org-ul">
<li>each VM had a 30 GB local disk</li>
<li>/home was exported from master over NFS</li>
</ul>

<p>
Concern encountered:
</p>

<pre class="example" id="org14602b2">
Shared /home only had ~30 GB available.
Spack and HPC software stacks can become very large.
</pre>

<p>
Important HPC storage concept:
</p>

<p>
Real HPC clusters usually separate:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Filesystem</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">/home</td>
<td class="org-left">user files</td>
</tr>

<tr>
<td class="org-left">/apps</td>
<td class="org-left">software stack</td>
</tr>

<tr>
<td class="org-left">/scratch</td>
<td class="org-left">temporary runtime data</td>
</tr>

<tr>
<td class="org-left">/archive</td>
<td class="org-left">long-term storage</td>
</tr>
</tbody>
</table>

<p>
Therefore a dedicated:
</p>

<pre class="example" id="org80e464e">
/apps
</pre>

<p>
filesystem was created.
</p>

<p>
This is significantly closer to real HPC architecture.
</p>
</div>
</div>
<div id="outline-container-org8e21d2a" class="outline-3">
<h3 id="org8e21d2a"><span class="section-number-3">12.2.</span> IMPORTANT Storage Architecture Concept</h3>
<div class="outline-text-3" id="text-12-2">
<p>
Each VM still has its own independent local storage.
</p>

<p>
Example:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Node</th>
<th scope="col" class="org-left">Local Disk</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">master</td>
<td class="org-left">30 GB</td>
</tr>

<tr>
<td class="org-left">login</td>
<td class="org-left">30 GB</td>
</tr>

<tr>
<td class="org-left">compute01</td>
<td class="org-left">30 GB</td>
</tr>

<tr>
<td class="org-left">compute02</td>
<td class="org-left">30 GB</td>
</tr>

<tr>
<td class="org-left">compute03</td>
<td class="org-left">30 GB</td>
</tr>
</tbody>
</table>

<p>
When:
</p>

<pre class="example" id="orgf7354ce">
master:/home
</pre>

<p>
was mounted via NFS:
</p>

<ul class="org-ul">
<li>compute node local /home became hidden</li>
<li>but local disks still exist</li>
</ul>

<p>
Only the exported filesystem becomes shared.
</p>

<p>
Therefore:
</p>

<pre class="example" id="orge85486a">
/apps
</pre>

<p>
was created as a dedicated shared software layer.
</p>
</div>
</div>
<div id="outline-container-org549e17f" class="outline-3">
<h3 id="org549e17f"><span class="section-number-3">12.3.</span> Add New Virtual Disk to Master</h3>
<div class="outline-text-3" id="text-12-3">
<p>
A second virtual disk was attached ONLY to:
</p>

<pre class="example" id="orgd9ab128">
master
</pre>

<p>
Purpose:
</p>

<ul class="org-ul">
<li>centralized software storage</li>
<li>shared application filesystem</li>
<li>Spack software stack</li>
</ul>

<p>
Disk size selected:
</p>

<pre class="example" id="org42c119c">
60 GB
</pre>

<p>
Disk type:
</p>

<pre class="example" id="org73cc825">
VDI (Dynamically Allocated)
</pre>
</div>
</div>
<div id="outline-container-orga7ea767" class="outline-3">
<h3 id="orga7ea767"><span class="section-number-3">12.4.</span> Verify New Disk Detection</h3>
<div class="outline-text-3" id="text-12-4">
<p>
After booting master:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>lsblk
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgc6132d9">
sda    30G
sdb    60G
</pre>

<p>
Important:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Device</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">sda</td>
<td class="org-left">OS disk</td>
</tr>

<tr>
<td class="org-left">sdb</td>
<td class="org-left">New apps disk</td>
</tr>
</tbody>
</table>

<p>
Only:
</p>

<pre class="example" id="org5a067bd">
sdb
</pre>

<p>
was modified.
</p>
</div>
</div>
