README.org
** Create GPT Partition Table

#+begin_src bash
sudo fdisk /dev/sdb
#+end_src

Inside fdisk:

Create GPT label:

#+begin_example
g
#+end_example

Create partition:

#+begin_example
n
#+end_example

Accept defaults.

Write changes:

#+begin_example
w
#+end_example

** Verify Partition

#+begin_src bash
lsblk
#+end_src

Expected:

#+begin_example
sdb
└── sdb1
#+end_example

** Create XFS Filesystem

#+begin_src bash
sudo mkfs.xfs /dev/sdb1
#+end_src

Why XFS?

- default enterprise filesystem
- highly scalable
- excellent for large filesystems
- commonly used in HPC

** Create Mount Point

#+begin_src bash
sudo mkdir -p /apps
#+end_src

** Get Filesystem UUID

#+begin_src bash
sudo blkid /dev/sdb1
#+end_src

Example:

#+begin_example
UUID="xxxxxxxx-xxxx-xxxx"
#+end_example

** Configure Persistent Mount

Edit:

#+begin_src bash
sudo vim /etc/fstab
#+end_src

Add:

#+begin_src fstab
UUID=YOUR_UUID_HERE   /apps   xfs   defaults   0 0
#+end_src

Important Linux administration concept:

UUIDs are preferred over:

#+begin_example
/dev/sdb1
#+end_example

because device names can change after reboot.

** Mount Filesystem

#+begin_src bash
sudo mount -a
#+end_src

** Verify Mount

#+begin_src bash
df -h
#+end_src

Expected:

#+begin_example
/apps
#+end_example

mounted with approximately:

#+begin_example
60 GB
#+end_example

** Configure Ownership

#+begin_src bash
sudo chown hpcadmin:hpcadmin /apps
#+end_src

** Create Shared HPC Software Hierarchy

#+begin_src bash
mkdir -p /apps/{spack,modulefiles,software,sources}
#+end_src

Resulting structure:

#+begin_example
/apps
├── spack
├── modulefiles
├── software
└── sources
#+end_example

** HPC Software Hierarchy Concept

Purpose of directories:

| Directory | Purpose |
|------------+----------|
| spack | Spack package manager |
| modulefiles | custom modulefiles |
| software | installed software |
| sources | downloaded sources |

This is similar to production HPC software layouts.

** Export /apps via NFS

Edit exports file:

#+begin_src bash
sudo vim /etc/exports
#+end_src

Add:

#+begin_src exports
/apps 10.10.10.0/24(rw,sync,no_root_squash)
#+end_src

** Apply NFS Exports

#+begin_src bash
sudo exportfs -rav
#+end_src

** Verify Exports

#+begin_src bash
showmount -e localhost
#+end_src

Expected:

#+begin_example
/apps
/home
#+end_example

** Create Mount Points on Client Nodes

On:
- login
- compute01
- compute02
- compute03

Create:

#+begin_src bash
sudo mkdir -p /apps
#+end_src

** Configure Persistent NFS Mounts

Edit:

#+begin_src bash
sudo vim /etc/fstab
#+end_src

Add:

#+begin_src fstab
master:/apps   /apps   nfs   defaults,_netdev   0 0
#+end_src

** Mount Shared /apps Filesystem

#+begin_src bash
sudo mount -a
#+end_src

** Verify Shared Mount

#+begin_src bash
df -h
#+end_src

Expected:

#+begin_example
master:/apps
#+end_example

mounted on all nodes.

** Verify Shared Filesystem Functionality

On master:

#+begin_src bash
touch /apps/testfile
#+end_src

On compute node:

#+begin_src bash
ls /apps
#+end_src

Expected:

#+begin_example
testfile
#+end_example

This verifies:

- shared software filesystem
- NFS functionality
- cluster-wide software visibility

** HPC Architecture After /apps Setup

Current cluster storage architecture:

| Filesystem | Purpose |
|-------------+----------|
| /home | user files |
| /apps | software stack |
| local disks | local runtime storage |

This resembles real HPC environments significantly more closely.

* Spack Software Stack + MPI Runtime Validation

Goal:

Create centralized HPC software stack using:

- Spack
- shared software filesystem
- shared compilers
- shared MPI stack
- scheduler-aware runtime execution

This phase validates:

- software distribution
- multinode execution
- Slurm integration
- MPI runtime functionality

After completing this section you will be able to:

- install HPC software using Spack
- manage multiple compiler versions
- manage multiple MPI versions
- load software dynamically
- compile MPI applications
- execute distributed jobs using Slurm
- monitor and debug jobs
- understand performance metrics

