README.html
<div id="outline-container-org442d5f7" class="outline-3">
<h3 id="org442d5f7"><span class="section-number-3">12.5.</span> Create GPT Partition Table</h3>
<div class="outline-text-3" id="text-12-5">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo fdisk /dev/sdb
</code></pre>
</div>

<p>
Inside fdisk:
</p>

<p>
Create GPT label:
</p>

<pre class="example" id="org2d7441e">
g
</pre>

<p>
Create partition:
</p>

<pre class="example" id="orga171639">
n
</pre>

<p>
Accept defaults.
</p>

<p>
Write changes:
</p>

<pre class="example" id="org062e93f">
w
</pre>
</div>
</div>
<div id="outline-container-org544dcc7" class="outline-3">
<h3 id="org544dcc7"><span class="section-number-3">12.6.</span> Verify Partition</h3>
<div class="outline-text-3" id="text-12-6">
<div class="org-src-container">
<pre class="src src-bash"><code>lsblk
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org75fdee1">
sdb
└── sdb1
</pre>
</div>
</div>
<div id="outline-container-org0f07ce6" class="outline-3">
<h3 id="org0f07ce6"><span class="section-number-3">12.7.</span> Create XFS Filesystem</h3>
<div class="outline-text-3" id="text-12-7">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo mkfs.xfs /dev/sdb1
</code></pre>
</div>

<p>
Why XFS?
</p>

<ul class="org-ul">
<li>default enterprise filesystem</li>
<li>highly scalable</li>
<li>excellent for large filesystems</li>
<li>commonly used in HPC</li>
</ul>
</div>
</div>
<div id="outline-container-orgc86cbc8" class="outline-3">
<h3 id="orgc86cbc8"><span class="section-number-3">12.8.</span> Create Mount Point</h3>
<div class="outline-text-3" id="text-12-8">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo mkdir -p /apps
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orga42bb8a" class="outline-3">
<h3 id="orga42bb8a"><span class="section-number-3">12.9.</span> Get Filesystem UUID</h3>
<div class="outline-text-3" id="text-12-9">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo blkid /dev/sdb1
</code></pre>
</div>

<p>
Example:
</p>

<pre class="example" id="org9197d2f">
UUID="xxxxxxxx-xxxx-xxxx"
</pre>
</div>
</div>
<div id="outline-container-orga4248db" class="outline-3">
<h3 id="orga4248db"><span class="section-number-3">12.10.</span> Configure Persistent Mount</h3>
<div class="outline-text-3" id="text-12-10">
<p>
Edit:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/fstab
</code></pre>
</div>

<p>
Add:
</p>

<div class="org-src-container">
<pre class="src src-fstab"><code>UUID=YOUR_UUID_HERE   /apps   xfs   defaults   0 0
</code></pre>
</div>

<p>
Important Linux administration concept:
</p>

<p>
UUIDs are preferred over:
</p>

<pre class="example" id="orgca3ae1f">
/dev/sdb1
</pre>

<p>
because device names can change after reboot.
</p>
</div>
</div>
<div id="outline-container-org8d93b67" class="outline-3">
<h3 id="org8d93b67"><span class="section-number-3">12.11.</span> Mount Filesystem</h3>
<div class="outline-text-3" id="text-12-11">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo mount -a
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org614aa71" class="outline-3">
<h3 id="org614aa71"><span class="section-number-3">12.12.</span> Verify Mount</h3>
<div class="outline-text-3" id="text-12-12">
<div class="org-src-container">
<pre class="src src-bash"><code>df -h
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org348f4c0">
/apps
</pre>

<p>
mounted with approximately:
</p>

<pre class="example" id="orgda4c5e1">
60 GB
</pre>
</div>
</div>
<div id="outline-container-org2473277" class="outline-3">
<h3 id="org2473277"><span class="section-number-3">12.13.</span> Configure Ownership</h3>
<div class="outline-text-3" id="text-12-13">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo chown hpcadmin:hpcadmin /apps
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org9d98432" class="outline-3">
<h3 id="org9d98432"><span class="section-number-3">12.14.</span> Create Shared HPC Software Hierarchy</h3>
<div class="outline-text-3" id="text-12-14">
<div class="org-src-container">
<pre class="src src-bash"><code>mkdir -p /apps/{spack,modulefiles,software,sources}
</code></pre>
</div>

<p>
Resulting structure:
</p>

<pre class="example" id="orgae9628f">
/apps
├── spack
├── modulefiles
├── software
└── sources
</pre>
</div>
</div>
<div id="outline-container-orge3e6647" class="outline-3">
<h3 id="orge3e6647"><span class="section-number-3">12.15.</span> HPC Software Hierarchy Concept</h3>
<div class="outline-text-3" id="text-12-15">
<p>
Purpose of directories:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Directory</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">spack</td>
<td class="org-left">Spack package manager</td>
</tr>

<tr>
<td class="org-left">modulefiles</td>
<td class="org-left">custom modulefiles</td>
</tr>

<tr>
<td class="org-left">software</td>
<td class="org-left">installed software</td>
</tr>

<tr>
<td class="org-left">sources</td>
<td class="org-left">downloaded sources</td>
</tr>
</tbody>
</table>

<p>
This is similar to production HPC software layouts.
</p>
</div>
</div>
<div id="outline-container-org52b326c" class="outline-3">
<h3 id="org52b326c"><span class="section-number-3">12.16.</span> Export /apps via NFS</h3>
<div class="outline-text-3" id="text-12-16">
<p>
Edit exports file:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/exports
</code></pre>
</div>

<p>
Add:
</p>

<div class="org-src-container">
<pre class="src src-exports"><code>/apps 10.10.10.0/24(rw,sync,no_root_squash)
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org510cd5a" class="outline-3">
<h3 id="org510cd5a"><span class="section-number-3">12.17.</span> Apply NFS Exports</h3>
<div class="outline-text-3" id="text-12-17">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo exportfs -rav
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgeab4000" class="outline-3">
<h3 id="orgeab4000"><span class="section-number-3">12.18.</span> Verify Exports</h3>
<div class="outline-text-3" id="text-12-18">
<div class="org-src-container">
<pre class="src src-bash"><code>showmount -e localhost
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orga0ede2d">
/apps
/home
</pre>
</div>
</div>
<div id="outline-container-org09721e2" class="outline-3">
<h3 id="org09721e2"><span class="section-number-3">12.19.</span> Create Mount Points on Client Nodes</h3>
<div class="outline-text-3" id="text-12-19">
<p>
On:
</p>
<ul class="org-ul">
<li>login</li>
<li>compute01</li>
<li>compute02</li>
<li>compute03</li>
</ul>

<p>
Create:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo mkdir -p /apps
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgc78a72f" class="outline-3">
<h3 id="orgc78a72f"><span class="section-number-3">12.20.</span> Configure Persistent NFS Mounts</h3>
<div class="outline-text-3" id="text-12-20">
<p>
Edit:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/fstab
</code></pre>
</div>

<p>
Add:
</p>

<div class="org-src-container">
<pre class="src src-fstab"><code>master:/apps   /apps   nfs   defaults,_netdev   0 0
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org4c3bf58" class="outline-3">
<h3 id="org4c3bf58"><span class="section-number-3">12.21.</span> Mount Shared /apps Filesystem</h3>
<div class="outline-text-3" id="text-12-21">
<div class="org-src-container">
<pre class="src src-bash"><code>sudo mount -a
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgd45e06f" class="outline-3">
<h3 id="orgd45e06f"><span class="section-number-3">12.22.</span> Verify Shared Mount</h3>
<div class="outline-text-3" id="text-12-22">
<div class="org-src-container">
<pre class="src src-bash"><code>df -h
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orga399c5f">
master:/apps
</pre>

<p>
mounted on all nodes.
</p>
</div>
</div>
<div id="outline-container-org926264c" class="outline-3">
<h3 id="org926264c"><span class="section-number-3">12.23.</span> Verify Shared Filesystem Functionality</h3>
<div class="outline-text-3" id="text-12-23">
<p>
On master:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>touch /apps/testfile
</code></pre>
</div>

<p>
On compute node:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ls /apps
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org8170e54">
testfile
</pre>

<p>
This verifies:
</p>

<ul class="org-ul">
<li>shared software filesystem</li>
<li>NFS functionality</li>
<li>cluster-wide software visibility</li>
</ul>
</div>
</div>
<div id="outline-container-org4c76312" class="outline-3">
<h3 id="org4c76312"><span class="section-number-3">12.24.</span> HPC Architecture After /apps Setup</h3>
<div class="outline-text-3" id="text-12-24">
<p>
Current cluster storage architecture:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Filesystem</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">/home</td>
<td class="org-left">user files</td>
</tr>

<tr>
<td class="org-left">/apps</td>
<td class="org-left">software stack</td>
</tr>

<tr>
<td class="org-left">local disks</td>
<td class="org-left">local runtime storage</td>
</tr>
</tbody>
</table>

<p>
This resembles real HPC environments significantly more closely.
</p>
</div>
</div>
</div>
<div id="outline-container-orga5533da" class="outline-2">
<h2 id="orga5533da"><span class="section-number-2">13.</span> Spack Software Stack + MPI Runtime Validation</h2>
<div class="outline-text-2" id="text-13">
<p>
Goal:
</p>

<p>
Create centralized HPC software stack using:
</p>

<ul class="org-ul">
<li>Spack</li>
<li>shared software filesystem</li>
<li>shared compilers</li>
<li>shared MPI stack</li>
<li>scheduler-aware runtime execution</li>
</ul>

<p>
This phase validates:
</p>

<ul class="org-ul">
<li>software distribution</li>
<li>multinode execution</li>
<li>Slurm integration</li>
<li>MPI runtime functionality</li>
</ul>

<p>
After completing this section you will be able to:
</p>

<ul class="org-ul">
<li>install HPC software using Spack</li>
<li>manage multiple compiler versions</li>
<li>manage multiple MPI versions</li>
<li>load software dynamically</li>
<li>compile MPI applications</li>
<li>execute distributed jobs using Slurm</li>
<li>monitor and debug jobs</li>
<li>understand performance metrics</li>
</ul>
</div>
