README.org
** IMPORTANT HPC Software Stack Concept

Instead of:

#+begin_example
dnf install openmpi
#+end_example

a centralized HPC software stack was created.

Benefits:

- software installed once
- accessible cluster-wide
- compiler hierarchy support
- reproducible builds
- module-based software environments
- centralized software management

This approach is significantly closer to real HPC centers.

In production HPC environments:

- operating system packages are separated
- scientific software stack is separated
- compiler stacks are separated
- MPI stacks are separated

This separation improves:

- portability
- reproducibility
- scalability
- maintenance

** IMPORTANT Shared Filesystem Concept

The cluster uses:

#+begin_example
/apps
#+end_example

as shared application storage.

Because:

#+begin_example
/apps
#+end_example

is mounted cluster-wide through NFS:

- software installed once becomes visible everywhere
- compute nodes automatically access installed software
- users share common software stack
- recompilation is unnecessary on compute nodes

This is one of the MOST important HPC architecture concepts.

** Install Development Tools

Installed manually on ALL nodes:

#+begin_src bash
sudo dnf groupinstall -y "Development Tools"
#+end_src

Purpose:

Provides:

- gcc
- g++
- gfortran
- make
- linker tools
- build utilities
- development environment

Important note:

#+begin_example
System compilers are still required even when using Spack.
#+end_example

Reason:

Spack builds software from source code and therefore still requires:

- assembler
- linker
- basic compiler toolchain

** Move into Shared Application Filesystem

Run on:

#+begin_example
master
#+end_example

Move into shared applications directory:

#+begin_src bash
cd /apps
#+end_src

Verify:

#+begin_src bash
pwd
#+end_src

Expected:

#+begin_example
/apps
#+end_example

** Clone Spack into Shared Filesystem

Clone Spack:

#+begin_src bash
git clone https://github.com/spack/spack.git
#+end_src

Expected:

#+begin_example
/apps/spack
#+end_example

This creates centralized package manager installation.

** Enter Spack Directory

#+begin_src bash
cd spack
#+end_src

Verify:

#+begin_src bash
pwd
#+end_src

Expected:

#+begin_example
/apps/spack
#+end_example

** Initialize Spack Environment

Initialize Spack:

#+begin_src bash
source share/spack/setup-env.sh
#+end_src

Purpose:

Adds:

- spack command
- shell integration
- environment variables
- package management environment

to current shell session.

Without initialization:

- spack command will not work
- spack load will fail
- software environments will not activate

** IMPORTANT Shell Environment Concept

#+begin_example
source
#+end_example

does NOT execute script normally.

Instead:

#+begin_example
it modifies current shell environment
#+end_example

This is extremely important in:

- Spack
- modules
- MPI environments
- compiler environments

** Make Spack Permanent

To avoid sourcing manually every session:

Edit:

#+begin_src bash
vim ~/.bashrc
#+end_src

Add:

#+begin_src bash
source /apps/spack/share/spack/setup-env.sh
#+end_src

Reload shell:

#+begin_src bash
source ~/.bashrc
#+end_src

Verify:

#+begin_src bash
spack --version
#+end_src

Expected:
- Spack version information

** Clone Additional Spack Repository

Clone repository:

#+begin_src bash
git clone https://github.com/spack/spack-packages.git
#+end_src

Purpose:

Adds additional package definitions.

** Configure Spack Repository

#+begin_src bash
spack repo set --destination "$(pwd)/spack-packages" builtin
#+end_src

Purpose:

Configure additional repository support.

This allows:

- package metadata
- package recipes
- software definitions

to become visible to Spack.

** Verify Spack Functionality

#+begin_src bash
spack info gcc
#+end_src

Expected:

Detailed GCC package information.

This verifies:

- Spack environment working
- package repository functional
- package metadata accessible

** IMPORTANT HPC Software Stack Concept

Spack operates as:

#+begin_example
source-based HPC package manager
#+end_example

Unlike:

| Package Manager | Purpose |
|------------------+----------|
| dnf | operating system |
| Spack | HPC software ecosystem |

Production HPC systems commonly separate:

- OS packages
- scientific software stacks

exactly like this setup.

** IMPORTANT Spack Build Concept

When installing software using Spack:

#+begin_example
software is compiled from source
#+end_example

Advantages:

- architecture optimization
- compiler flexibility
- dependency control
- reproducibility
- variant support

Disadvantages:

- longer installation time

** Detect Available Compilers

Before installing software:

#+begin_src bash
spack compiler find
#+end_src

Purpose:

Detect system compilers available for building software.

Verify detected compilers:

#+begin_src bash
spack compilers
#+end_src

Expected:
- compiler list

