README.html
<div id="outline-container-org6cd56a0" class="outline-3">
<h3 id="org6cd56a0"><span class="section-number-3">13.1.</span> IMPORTANT HPC Software Stack Concept</h3>
<div class="outline-text-3" id="text-13-1">
<p>
Instead of:
</p>

<pre class="example" id="org54e3ad2">
dnf install openmpi
</pre>

<p>
a centralized HPC software stack was created.
</p>

<p>
Benefits:
</p>

<ul class="org-ul">
<li>software installed once</li>
<li>accessible cluster-wide</li>
<li>compiler hierarchy support</li>
<li>reproducible builds</li>
<li>module-based software environments</li>
<li>centralized software management</li>
</ul>

<p>
This approach is significantly closer to real HPC centers.
</p>

<p>
In production HPC environments:
</p>

<ul class="org-ul">
<li>operating system packages are separated</li>
<li>scientific software stack is separated</li>
<li>compiler stacks are separated</li>
<li>MPI stacks are separated</li>
</ul>

<p>
This separation improves:
</p>

<ul class="org-ul">
<li>portability</li>
<li>reproducibility</li>
<li>scalability</li>
<li>maintenance</li>
</ul>
</div>
</div>
<div id="outline-container-orgd2fae9c" class="outline-3">
<h3 id="orgd2fae9c"><span class="section-number-3">13.2.</span> IMPORTANT Shared Filesystem Concept</h3>
<div class="outline-text-3" id="text-13-2">
<p>
The cluster uses:
</p>

<pre class="example" id="orgea5295f">
/apps
</pre>

<p>
as shared application storage.
</p>

<p>
Because:
</p>

<pre class="example" id="orgc765296">
/apps
</pre>

<p>
is mounted cluster-wide through NFS:
</p>

<ul class="org-ul">
<li>software installed once becomes visible everywhere</li>
<li>compute nodes automatically access installed software</li>
<li>users share common software stack</li>
<li>recompilation is unnecessary on compute nodes</li>
</ul>

<p>
This is one of the MOST important HPC architecture concepts.
</p>
</div>
</div>
<div id="outline-container-orgf25115b" class="outline-3">
<h3 id="orgf25115b"><span class="section-number-3">13.3.</span> Install Development Tools</h3>
<div class="outline-text-3" id="text-13-3">
<p>
Installed manually on ALL nodes:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo dnf groupinstall -y "Development Tools"
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Provides:
</p>

<ul class="org-ul">
<li>gcc</li>
<li>g++</li>
<li>gfortran</li>
<li>make</li>
<li>linker tools</li>
<li>build utilities</li>
<li>development environment</li>
</ul>

<p>
Important note:
</p>

<pre class="example" id="org700c81e">
System compilers are still required even when using Spack.
</pre>

<p>
Reason:
</p>

<p>
Spack builds software from source code and therefore still requires:
</p>

<ul class="org-ul">
<li>assembler</li>
<li>linker</li>
<li>basic compiler toolchain</li>
</ul>
</div>
</div>
<div id="outline-container-org9778fdf" class="outline-3">
<h3 id="org9778fdf"><span class="section-number-3">13.4.</span> Move into Shared Application Filesystem</h3>
<div class="outline-text-3" id="text-13-4">
<p>
Run on:
</p>

<pre class="example" id="org996a07f">
master
</pre>

<p>
Move into shared applications directory:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>cd /apps
</code></pre>
</div>

<p>
Verify:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>pwd
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org688fc72">
/apps
</pre>
</div>
</div>
<div id="outline-container-org4332128" class="outline-3">
<h3 id="org4332128"><span class="section-number-3">13.5.</span> Clone Spack into Shared Filesystem</h3>
<div class="outline-text-3" id="text-13-5">
<p>
Clone Spack:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>git clone https://github.com/spack/spack.git
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgbc4cb16">
/apps/spack
</pre>

<p>
This creates centralized package manager installation.
</p>
</div>
</div>
<div id="outline-container-orgcaaebdd" class="outline-3">
<h3 id="orgcaaebdd"><span class="section-number-3">13.6.</span> Enter Spack Directory</h3>
<div class="outline-text-3" id="text-13-6">
<div class="org-src-container">
<pre class="src src-bash"><code>cd spack
</code></pre>
</div>

<p>
Verify:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>pwd
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgf748ac6">
/apps/spack
</pre>
</div>
</div>
<div id="outline-container-org06ef3fa" class="outline-3">
<h3 id="org06ef3fa"><span class="section-number-3">13.7.</span> Initialize Spack Environment</h3>
<div class="outline-text-3" id="text-13-7">
<p>
Initialize Spack:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>source share/spack/setup-env.sh
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Adds:
</p>

<ul class="org-ul">
<li>spack command</li>
<li>shell integration</li>
<li>environment variables</li>
<li>package management environment</li>
</ul>

<p>
to current shell session.
</p>

<p>
Without initialization:
</p>

<ul class="org-ul">
<li>spack command will not work</li>
<li>spack load will fail</li>
<li>software environments will not activate</li>
</ul>
</div>
</div>
<div id="outline-container-org46c2b9f" class="outline-3">
<h3 id="org46c2b9f"><span class="section-number-3">13.8.</span> IMPORTANT Shell Environment Concept</h3>
<div class="outline-text-3" id="text-13-8">
<pre class="example" id="orgd5923bf">
source
</pre>

<p>
does NOT execute script normally.
</p>

<p>
Instead:
</p>

<pre class="example" id="org0d3f437">
it modifies current shell environment
</pre>

<p>
This is extremely important in:
</p>

<ul class="org-ul">
<li>Spack</li>
<li>modules</li>
<li>MPI environments</li>
<li>compiler environments</li>
</ul>
</div>
</div>
<div id="outline-container-org8cfdcdc" class="outline-3">
<h3 id="org8cfdcdc"><span class="section-number-3">13.9.</span> Make Spack Permanent</h3>
<div class="outline-text-3" id="text-13-9">
<p>
To avoid sourcing manually every session:
</p>

<p>
Edit:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>vim ~/.bashrc
</code></pre>
</div>

<p>
Add:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>source /apps/spack/share/spack/setup-env.sh
</code></pre>
</div>

<p>
Reload shell:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>source ~/.bashrc
</code></pre>
</div>

<p>
Verify:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>spack --version
</code></pre>
</div>

<p>
Expected:
</p>
<ul class="org-ul">
<li>Spack version information</li>
</ul>
</div>
</div>
<div id="outline-container-org97d4382" class="outline-3">
<h3 id="org97d4382"><span class="section-number-3">13.10.</span> Clone Additional Spack Repository</h3>
<div class="outline-text-3" id="text-13-10">
<p>
Clone repository:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>git clone https://github.com/spack/spack-packages.git
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Adds additional package definitions.
</p>
</div>
</div>
<div id="outline-container-org66649db" class="outline-3">
<h3 id="org66649db"><span class="section-number-3">13.11.</span> Configure Spack Repository</h3>
<div class="outline-text-3" id="text-13-11">
<div class="org-src-container">
<pre class="src src-bash"><code>spack repo set --destination "$(pwd)/spack-packages" builtin
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Configure additional repository support.
</p>

<p>
This allows:
</p>

<ul class="org-ul">
<li>package metadata</li>
<li>package recipes</li>
<li>software definitions</li>
</ul>

<p>
to become visible to Spack.
</p>
</div>
</div>
<div id="outline-container-org912a9b4" class="outline-3">
<h3 id="org912a9b4"><span class="section-number-3">13.12.</span> Verify Spack Functionality</h3>
<div class="outline-text-3" id="text-13-12">
<div class="org-src-container">
<pre class="src src-bash"><code>spack info gcc
</code></pre>
</div>

<p>
Expected:
</p>

<p>
Detailed GCC package information.
</p>

<p>
This verifies:
</p>

<ul class="org-ul">
<li>Spack environment working</li>
<li>package repository functional</li>
<li>package metadata accessible</li>
</ul>
</div>
</div>
<div id="outline-container-org841984b" class="outline-3">
<h3 id="org841984b"><span class="section-number-3">13.13.</span> IMPORTANT HPC Software Stack Concept</h3>
<div class="outline-text-3" id="text-13-13">
<p>
Spack operates as:
</p>

<pre class="example" id="org7ea744b">
source-based HPC package manager
</pre>

<p>
Unlike:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Package Manager</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">dnf</td>
<td class="org-left">operating system</td>
</tr>

<tr>
<td class="org-left">Spack</td>
<td class="org-left">HPC software ecosystem</td>
</tr>
</tbody>
</table>

<p>
Production HPC systems commonly separate:
</p>

<ul class="org-ul">
<li>OS packages</li>
<li>scientific software stacks</li>
</ul>

<p>
exactly like this setup.
</p>
</div>
</div>
<div id="outline-container-org56090f0" class="outline-3">
<h3 id="org56090f0"><span class="section-number-3">13.14.</span> IMPORTANT Spack Build Concept</h3>
<div class="outline-text-3" id="text-13-14">
<p>
When installing software using Spack:
</p>

<pre class="example" id="org8f0fd4b">
software is compiled from source
</pre>

<p>
Advantages:
</p>

<ul class="org-ul">
<li>architecture optimization</li>
<li>compiler flexibility</li>
<li>dependency control</li>
<li>reproducibility</li>
<li>variant support</li>
</ul>

<p>
Disadvantages:
</p>

<ul class="org-ul">
<li>longer installation time</li>
</ul>
</div>
</div>
<div id="outline-container-org2bedc9a" class="outline-3">
<h3 id="org2bedc9a"><span class="section-number-3">13.15.</span> Detect Available Compilers</h3>
<div class="outline-text-3" id="text-13-15">
<p>
Before installing software:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>spack compiler find
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Detect system compilers available for building software.
</p>

<p>
Verify detected compilers:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>spack compilers
</code></pre>
</div>

<p>
Expected:
</p>
<ul class="org-ul">
<li>compiler list</li>
</ul>
</div>
</div>
