README.org
** Install GCC Using Spack

Install GCC version:

#+begin_src bash
spack install gcc@13.4.0
#+end_src

Purpose:

Create dedicated HPC compiler stack.

This may take considerable time because:

- GCC itself is compiled from source
- dependencies are built
- optimization occurs

** IMPORTANT Multiple Compiler Version Concept

Production HPC systems frequently maintain multiple compiler versions simultaneously.

Example:

#+begin_example
gcc@11
gcc@12
gcc@13
intel
nvhpc
clang
#+end_example

Reasons:

- application compatibility
- compiler ABI differences
- reproducibility
- benchmark consistency

** Verify Installed Software

List installed packages:

#+begin_src bash
spack find
#+end_src

Expected example:

#+begin_example
==> 1 installed package
gcc@13.4.0
#+end_example

** Load Installed GCC Compiler

#+begin_src bash
spack load gcc@13.4.0
#+end_src

Purpose:

Activate compiler environment.

Verify compiler path:

#+begin_src bash
which gcc
#+end_src

Expected:
- Spack GCC path

Verify version:

#+begin_src bash
gcc --version
#+end_src

Expected:
- GCC 13.4.0

** IMPORTANT Runtime Environment Concept

When software is loaded:

- PATH changes
- LD_LIBRARY_PATH changes
- MANPATH changes

This allows applications to locate:

- executables
- shared libraries
- runtime dependencies

automatically.

** Register Newly Installed Compiler

After installing GCC:

#+begin_src bash
spack compiler find
#+end_src

Purpose:

Allow Spack to use newly installed GCC for future package builds.

Verify:

#+begin_src bash
spack compilers
#+end_src

Expected:
- new GCC compiler entry

** Install OpenMPI Using Spack

Install MPI runtime:

#+begin_src bash
spack install openmpi
#+end_src

Purpose:

Create shared MPI runtime stack.

This installation includes:

- MPI runtime
- MPI compiler wrappers
- MPI libraries
- distributed runtime environment

** IMPORTANT MPI Compiler Dependency Concept

MPI stacks are tightly coupled with compiler toolchains.

Example:

#+begin_example
openmpi built using gcc@13
#+end_example

This is important because:

- ABI compatibility matters
- runtime compatibility matters
- mixed compiler environments may fail

** Verify Installed Software Tree

Show dependency tree:

#+begin_src bash
spack find -d
#+end_src

Purpose:

Displays:

- dependency hierarchy
- compiler hierarchy
- runtime dependencies

Example:

#+begin_example
openmpi
   ^gcc@13.4.0
#+end_example

** IMPORTANT Spack Spec Concept

Every Spack installation contains:

- package version
- compiler information
- dependency tree
- unique installation hash

Example:

#+begin_example
openmpi@5.0.7%gcc@13.4.0
#+end_example

Meaning:

| Component | Meaning |
|------------+----------|
| openmpi | package |
| 5.0.7 | package version |
| gcc@13.4.0 | compiler used |

** IMPORTANT Hash-Based Software Loading

Sometimes multiple builds of same version exist because of:

- different compilers
- different variants
- different dependencies

Spack assigns:

#+begin_example
unique hashes
#+end_example

View hashes:

#+begin_src bash
spack find -l
#+end_src

Expected:

#+begin_example
abc1234 gcc@13.4.0
xyz5678 openmpi@5.0.7
#+end_example

Load using hash:

#+begin_src bash
spack load /xyz5678
#+end_src

This is extremely common in production HPC systems.

** Load OpenMPI Environment

#+begin_src bash
spack load openmpi
#+end_src

Verify:

#+begin_src bash
which mpicc
#+end_src

Expected:
- Spack OpenMPI wrapper path

Verify MPI runtime:

#+begin_src bash
mpirun --version
#+end_src

Expected:
- OpenMPI version information

** IMPORTANT MPI Wrapper Concept

#+begin_example
mpicc
#+end_example

is NOT a compiler itself.

It is a wrapper that automatically injects:

- MPI headers
- MPI libraries
- runtime linker flags

around GCC.

This is a critical HPC build concept.

** Verify Loaded Software

Display loaded packages:

#+begin_src bash
spack find --loaded
#+end_src

Unload OpenMPI:

#+begin_src bash
spack unload openmpi
#+end_src

Unload all software:

#+begin_src bash
spack unload --all
#+end_src

Verify:

#+begin_src bash
spack find --loaded
#+end_src

Expected:
- no loaded packages

