README.html
<div id="outline-container-orgde434d2" class="outline-3">
<h3 id="orgde434d2"><span class="section-number-3">13.16.</span> Install GCC Using Spack</h3>
<div class="outline-text-3" id="text-13-16">
<p>
Install GCC version:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>spack install gcc@13.4.0
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Create dedicated HPC compiler stack.
</p>

<p>
This may take considerable time because:
</p>

<ul class="org-ul">
<li>GCC itself is compiled from source</li>
<li>dependencies are built</li>
<li>optimization occurs</li>
</ul>
</div>
</div>
<div id="outline-container-org4c66a1c" class="outline-3">
<h3 id="org4c66a1c"><span class="section-number-3">13.17.</span> IMPORTANT Multiple Compiler Version Concept</h3>
<div class="outline-text-3" id="text-13-17">
<p>
Production HPC systems frequently maintain multiple compiler versions simultaneously.
</p>

<p>
Example:
</p>

<pre class="example" id="org7f434ed">
gcc@11
gcc@12
gcc@13
intel
nvhpc
clang
</pre>

<p>
Reasons:
</p>

<ul class="org-ul">
<li>application compatibility</li>
<li>compiler ABI differences</li>
<li>reproducibility</li>
<li>benchmark consistency</li>
</ul>
</div>
</div>
<div id="outline-container-org23b51dd" class="outline-3">
<h3 id="org23b51dd"><span class="section-number-3">13.18.</span> Verify Installed Software</h3>
<div class="outline-text-3" id="text-13-18">
<p>
List installed packages:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>spack find
</code></pre>
</div>

<p>
Expected example:
</p>

<pre class="example" id="org01658bf">
==&gt; 1 installed package
gcc@13.4.0
</pre>
</div>
</div>
<div id="outline-container-org00753d7" class="outline-3">
<h3 id="org00753d7"><span class="section-number-3">13.19.</span> Load Installed GCC Compiler</h3>
<div class="outline-text-3" id="text-13-19">
<div class="org-src-container">
<pre class="src src-bash"><code>spack load gcc@13.4.0
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Activate compiler environment.
</p>

<p>
Verify compiler path:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>which gcc
</code></pre>
</div>

<p>
Expected:
</p>
<ul class="org-ul">
<li>Spack GCC path</li>
</ul>

<p>
Verify version:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>gcc --version
</code></pre>
</div>

<p>
Expected:
</p>
<ul class="org-ul">
<li>GCC 13.4.0</li>
</ul>
</div>
</div>
<div id="outline-container-orgb1b398d" class="outline-3">
<h3 id="orgb1b398d"><span class="section-number-3">13.20.</span> IMPORTANT Runtime Environment Concept</h3>
<div class="outline-text-3" id="text-13-20">
<p>
When software is loaded:
</p>

<ul class="org-ul">
<li>PATH changes</li>
<li>LD_LIBRARY_PATH changes</li>
<li>MANPATH changes</li>
</ul>

<p>
This allows applications to locate:
</p>

<ul class="org-ul">
<li>executables</li>
<li>shared libraries</li>
<li>runtime dependencies</li>
</ul>

<p>
automatically.
</p>
</div>
</div>
<div id="outline-container-org5dcaf36" class="outline-3">
<h3 id="org5dcaf36"><span class="section-number-3">13.21.</span> Register Newly Installed Compiler</h3>
<div class="outline-text-3" id="text-13-21">
<p>
After installing GCC:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>spack compiler find
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Allow Spack to use newly installed GCC for future package builds.
</p>

<p>
Verify:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>spack compilers
</code></pre>
</div>

<p>
Expected:
</p>
<ul class="org-ul">
<li>new GCC compiler entry</li>
</ul>
</div>
</div>
<div id="outline-container-orgcb7e0ad" class="outline-3">
<h3 id="orgcb7e0ad"><span class="section-number-3">13.22.</span> Install OpenMPI Using Spack</h3>
<div class="outline-text-3" id="text-13-22">
<p>
Install MPI runtime:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>spack install openmpi
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Create shared MPI runtime stack.
</p>

<p>
This installation includes:
</p>

<ul class="org-ul">
<li>MPI runtime</li>
<li>MPI compiler wrappers</li>
<li>MPI libraries</li>
<li>distributed runtime environment</li>
</ul>
</div>
</div>
<div id="outline-container-org6373901" class="outline-3">
<h3 id="org6373901"><span class="section-number-3">13.23.</span> IMPORTANT MPI Compiler Dependency Concept</h3>
<div class="outline-text-3" id="text-13-23">
<p>
MPI stacks are tightly coupled with compiler toolchains.
</p>

<p>
Example:
</p>

<pre class="example" id="org4414a96">
openmpi built using gcc@13
</pre>

<p>
This is important because:
</p>

<ul class="org-ul">
<li>ABI compatibility matters</li>
<li>runtime compatibility matters</li>
<li>mixed compiler environments may fail</li>
</ul>
</div>
</div>
<div id="outline-container-orge0cb3ff" class="outline-3">
<h3 id="orge0cb3ff"><span class="section-number-3">13.24.</span> Verify Installed Software Tree</h3>
<div class="outline-text-3" id="text-13-24">
<p>
Show dependency tree:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>spack find -d
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Displays:
</p>

<ul class="org-ul">
<li>dependency hierarchy</li>
<li>compiler hierarchy</li>
<li>runtime dependencies</li>
</ul>

<p>
Example:
</p>

<pre class="example" id="org8643165">
openmpi
   ^gcc@13.4.0
</pre>
</div>
</div>
<div id="outline-container-org50f8638" class="outline-3">
<h3 id="org50f8638"><span class="section-number-3">13.25.</span> IMPORTANT Spack Spec Concept</h3>
<div class="outline-text-3" id="text-13-25">
<p>
Every Spack installation contains:
</p>

<ul class="org-ul">
<li>package version</li>
<li>compiler information</li>
<li>dependency tree</li>
<li>unique installation hash</li>
</ul>

<p>
Example:
</p>

<pre class="example" id="org242ee5f">
openmpi@5.0.7%gcc@13.4.0
</pre>

<p>
Meaning:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Component</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">openmpi</td>
<td class="org-left">package</td>
</tr>

<tr>
<td class="org-left">5.0.7</td>
<td class="org-left">package version</td>
</tr>

<tr>
<td class="org-left">gcc@13.4.0</td>
<td class="org-left">compiler used</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org2487268" class="outline-3">
<h3 id="org2487268"><span class="section-number-3">13.26.</span> IMPORTANT Hash-Based Software Loading</h3>
<div class="outline-text-3" id="text-13-26">
<p>
Sometimes multiple builds of same version exist because of:
</p>

<ul class="org-ul">
<li>different compilers</li>
<li>different variants</li>
<li>different dependencies</li>
</ul>

<p>
Spack assigns:
</p>

<pre class="example" id="org9186cb7">
unique hashes
</pre>

<p>
View hashes:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>spack find -l
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org816a020">
abc1234 gcc@13.4.0
xyz5678 openmpi@5.0.7
</pre>

<p>
Load using hash:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>spack load /xyz5678
</code></pre>
</div>

<p>
This is extremely common in production HPC systems.
</p>
</div>
</div>
<div id="outline-container-org37e915f" class="outline-3">
<h3 id="org37e915f"><span class="section-number-3">13.27.</span> Load OpenMPI Environment</h3>
<div class="outline-text-3" id="text-13-27">
<div class="org-src-container">
<pre class="src src-bash"><code>spack load openmpi
</code></pre>
</div>

<p>
Verify:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>which mpicc
</code></pre>
</div>

<p>
Expected:
</p>
<ul class="org-ul">
<li>Spack OpenMPI wrapper path</li>
</ul>

<p>
Verify MPI runtime:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>mpirun --version
</code></pre>
</div>

<p>
Expected:
</p>
<ul class="org-ul">
<li>OpenMPI version information</li>
</ul>
</div>
</div>
<div id="outline-container-org72eb78d" class="outline-3">
<h3 id="org72eb78d"><span class="section-number-3">13.28.</span> IMPORTANT MPI Wrapper Concept</h3>
<div class="outline-text-3" id="text-13-28">
<pre class="example" id="org4c93d51">
mpicc
</pre>

<p>
is NOT a compiler itself.
</p>

<p>
It is a wrapper that automatically injects:
</p>

<ul class="org-ul">
<li>MPI headers</li>
<li>MPI libraries</li>
<li>runtime linker flags</li>
</ul>

<p>
around GCC.
</p>

<p>
This is a critical HPC build concept.
</p>
</div>
</div>
<div id="outline-container-orga147439" class="outline-3">
<h3 id="orga147439"><span class="section-number-3">13.29.</span> Verify Loaded Software</h3>
<div class="outline-text-3" id="text-13-29">
<p>
Display loaded packages:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>spack find --loaded
</code></pre>
</div>

<p>
Unload OpenMPI:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>spack unload openmpi
</code></pre>
</div>

<p>
Unload all software:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>spack unload --all
</code></pre>
</div>

<p>
Verify:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>spack find --loaded
</code></pre>
</div>

<p>
Expected:
</p>
<ul class="org-ul">
<li>no loaded packages</li>
</ul>
</div>
</div>
