README.org
** Create MPI Performance Validation Program

Create source file:

#+begin_src bash
vim mpi_sum.c
#+end_src

Purpose:

- validate MPI runtime
- validate multinode execution
- validate scheduler-aware execution
- compare serial vs parallel runtime
- demonstrate reduction operations
- calculate speedup
- calculate efficiency

Paste:

#+begin_src c
#include <mpi.h>
#include <stdio.h>
#include <stdlib.h>

#define N 1000000000

double serial_sum()
{
    double sum = 0.0;

    for(long long int i = 0; i < N; i++)
    {
        sum += i;
    }

    return sum;
}

int main(int argc, char *argv[])
{
    int rank, size;

    long long int start_index;
    long long int end_index;
    long long int chunk;

    double local_sum = 0.0;
    double global_sum = 0.0;

    double serial_start;
    double serial_end;

    double parallel_start;
    double parallel_end;

    MPI_Init(&argc, &argv);

    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    MPI_Comm_size(MPI_COMM_WORLD, &size);

    if(rank == 0)
    {
        serial_start = MPI_Wtime();

        double serial_result = serial_sum();

        serial_end = MPI_Wtime();

        printf("\n");
        printf("========== SERIAL COMPUTATION ==========\n");
        printf("Sum = %.0f\n", serial_result);
        printf("Time taken = %f seconds\n",
               serial_end - serial_start);
    }

    MPI_Barrier(MPI_COMM_WORLD);

    chunk = N / size;

    start_index = rank * chunk;

    if(rank == size - 1)
        end_index = N;
    else
        end_index = start_index + chunk;

    parallel_start = MPI_Wtime();

    for(long long int i = start_index;
        i < end_index;
        i++)
    {
        local_sum += i;
    }

    MPI_Reduce(&local_sum,
               &global_sum,
               1,
               MPI_DOUBLE,
               MPI_SUM,
               0,
               MPI_COMM_WORLD);

    parallel_end = MPI_Wtime();

    if(rank == 0)
    {
        double parallel_time =
            parallel_end - parallel_start;

        double serial_time =
            serial_end - serial_start;

        printf("\n");
        printf("========== PARALLEL COMPUTATION ==========\n");
        printf("Processes used = %d\n", size);
        printf("Sum = %.0f\n", global_sum);
        printf("Time taken = %f seconds\n",
               parallel_time);

        printf("\n");
        printf("========== PERFORMANCE ==========\n");
        printf("Speedup = %f\n",
               serial_time / parallel_time);

        printf("Efficiency = %f\n",
               (serial_time / parallel_time) / size);
    }

    MPI_Finalize();

    return 0;
}
#+end_src

** IMPORTANT MPI Reduction Concept

This program uses:

#+begin_example
MPI_Reduce()
#+end_example

Purpose:

Combine partial sums from all MPI ranks into:

#+begin_example
single global result
#+end_example

Flow:

#+begin_example
local sums
    ↓
MPI_Reduce
    ↓
global sum
#+end_example

This is one of the MOST important MPI collective communication operations.

** IMPORTANT Parallel Execution Concept

Serial execution:

#+begin_example
single process computes entire workload
#+end_example

Parallel execution:

#+begin_example
multiple MPI ranks divide workload
#+end_example

Example:

| Rank  | Work         |
|-------+--------------|
| rank0 | 0 --> 25%    |
| rank1 | 25% --> 50%  |
| rank2 | 50% --> 75%  |
| rank3 | 75% --> 100% |

Advantages:

- reduced execution time
- distributed workload
- scalable computation

** Load Software Before Compilation

Initialize Spack:

#+begin_src bash
source /apps/spack/share/spack/setup-env.sh
#+end_src

Load compiler:

#+begin_src bash
spack load gcc@13.4.0
#+end_src

Load MPI runtime:

#+begin_src bash
spack load openmpi
#+end_src

Verify:

#+begin_src bash
which mpicc
#+end_src

Expected:
- MPI compiler wrapper path

** Compile MPI Program

Compile:

#+begin_src bash
mpicc mpi_sum.c -o mpi_sum
#+end_src

Verify executable:

#+begin_src bash
ls
#+end_src

Expected:

#+begin_example
mpi_sum
#+end_example

** IMPORTANT MPI Compilation Concept

MPI programs are compiled using:

#+begin_src bash
mpicc
#+end_src

instead of:

#+begin_src bash
gcc
#+end_src

because MPI wrapper automatically injects:

- MPI headers
- MPI libraries
- linker flags

** Interactive MPI Runtime Validation

Run interactively:

#+begin_src bash
mpirun -np 4 ./mpi_sum
#+end_src

Expected:

#+begin_example
========== SERIAL COMPUTATION ==========
...

========== PARALLEL COMPUTATION ==========
...

========== PERFORMANCE ==========
...
#+end_example

This validates:

- MPI runtime
- MPI communication
- reduction operations
- distributed execution

** IMPORTANT Shared Filesystem Advantage

Because:

- source code
- executable
- software stack

exist on shared filesystem:

#+begin_example
/apps
or
/home
#+end_example

compute nodes automatically access:

- compiled binaries
- runtime libraries
- MPI stack

without recompilation.

This is one of the major HPC architecture advantages.

** Create Slurm Batch Script

Create batch script:

#+begin_src bash
vim submit.sh
#+end_src

Paste:

#+begin_src bash
#!/bin/bash
#SBATCH -N 3
#SBATCH --ntasks-per-node=1
#SBATCH --job-name=test
#SBATCH --output=%J.out
#SBATCH --error=%J.err
#SBATCH --time=01:00:00
##SBATCH --nodelist=compute03,compute01

source /apps/spack/share/spack/setup-env.sh

spack load openmpi

mpirun -np $SLURM_NTASKS ./$1
#+end_src

Make executable:

#+begin_src bash
chmod +x submit.sh
#+end_src

