README.html
<div id="outline-container-org4876412" class="outline-3">
<h3 id="org4876412"><span class="section-number-3">13.30.</span> Create MPI Performance Validation Program</h3>
<div class="outline-text-3" id="text-13-30">
<p>
Create source file:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>vim mpi_sum.c
</code></pre>
</div>

<p>
Purpose:
</p>

<ul class="org-ul">
<li>validate MPI runtime</li>
<li>validate multinode execution</li>
<li>validate scheduler-aware execution</li>
<li>compare serial vs parallel runtime</li>
<li>demonstrate reduction operations</li>
<li>calculate speedup</li>
<li>calculate efficiency</li>
</ul>

<p>
Paste:
</p>

<div class="org-src-container">
<pre class="src src-c"><code>#include &lt;mpi.h&gt;
#include &lt;stdio.h&gt;
#include &lt;stdlib.h&gt;

#define N 1000000000

double serial_sum()
{
    double sum = 0.0;

    for(long long int i = 0; i &lt; N; i++)
    {
        sum += i;
    }

    return sum;
}

int main(int argc, char *argv[])
{
    int rank, size;

    long long int start_index;
    long long int end_index;
    long long int chunk;

    double local_sum = 0.0;
    double global_sum = 0.0;

    double serial_start;
    double serial_end;

    double parallel_start;
    double parallel_end;

    MPI_Init(&amp;argc, &amp;argv);

    MPI_Comm_rank(MPI_COMM_WORLD, &amp;rank);
    MPI_Comm_size(MPI_COMM_WORLD, &amp;size);

    if(rank == 0)
    {
        serial_start = MPI_Wtime();

        double serial_result = serial_sum();

        serial_end = MPI_Wtime();

        printf("\n");
        printf("========== SERIAL COMPUTATION ==========\n");
        printf("Sum = %.0f\n", serial_result);
        printf("Time taken = %f seconds\n",
               serial_end - serial_start);
    }

    MPI_Barrier(MPI_COMM_WORLD);

    chunk = N / size;

    start_index = rank * chunk;

    if(rank == size - 1)
        end_index = N;
    else
        end_index = start_index + chunk;

    parallel_start = MPI_Wtime();

    for(long long int i = start_index;
        i &lt; end_index;
        i++)
    {
        local_sum += i;
    }

    MPI_Reduce(&amp;local_sum,
               &amp;global_sum,
               1,
               MPI_DOUBLE,
               MPI_SUM,
               0,
               MPI_COMM_WORLD);

    parallel_end = MPI_Wtime();

    if(rank == 0)
    {
        double parallel_time =
            parallel_end - parallel_start;

        double serial_time =
            serial_end - serial_start;

        printf("\n");
        printf("========== PARALLEL COMPUTATION ==========\n");
        printf("Processes used = %d\n", size);
        printf("Sum = %.0f\n", global_sum);
        printf("Time taken = %f seconds\n",
               parallel_time);

        printf("\n");
        printf("========== PERFORMANCE ==========\n");
        printf("Speedup = %f\n",
               serial_time / parallel_time);

        printf("Efficiency = %f\n",
               (serial_time / parallel_time) / size);
    }

    MPI_Finalize();

    return 0;
}
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgdf17d54" class="outline-3">
<h3 id="orgdf17d54"><span class="section-number-3">13.31.</span> IMPORTANT MPI Reduction Concept</h3>
<div class="outline-text-3" id="text-13-31">
<p>
This program uses:
</p>

<pre class="example" id="org67b4c33">
MPI_Reduce()
</pre>

<p>
Purpose:
</p>

<p>
Combine partial sums from all MPI ranks into:
</p>

<pre class="example" id="orgf9ad2d4">
single global result
</pre>

<p>
Flow:
</p>

<pre class="example" id="orga3514b5">
local sums
    ↓
MPI_Reduce
    ↓
global sum
</pre>

<p>
This is one of the MOST important MPI collective communication operations.
</p>
</div>
</div>
<div id="outline-container-orgd29063a" class="outline-3">
<h3 id="orgd29063a"><span class="section-number-3">13.32.</span> IMPORTANT Parallel Execution Concept</h3>
<div class="outline-text-3" id="text-13-32">
<p>
Serial execution:
</p>

<pre class="example" id="org5147889">
single process computes entire workload
</pre>

<p>
Parallel execution:
</p>

<pre class="example" id="org274f833">
multiple MPI ranks divide workload
</pre>

<p>
Example:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Rank</th>
<th scope="col" class="org-left">Work</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">rank0</td>
<td class="org-left">0 &ndash;&gt; 25%</td>
</tr>

<tr>
<td class="org-left">rank1</td>
<td class="org-left">25% &ndash;&gt; 50%</td>
</tr>

<tr>
<td class="org-left">rank2</td>
<td class="org-left">50% &ndash;&gt; 75%</td>
</tr>

<tr>
<td class="org-left">rank3</td>
<td class="org-left">75% &ndash;&gt; 100%</td>
</tr>
</tbody>
</table>

<p>
Advantages:
</p>

<ul class="org-ul">
<li>reduced execution time</li>
<li>distributed workload</li>
<li>scalable computation</li>
</ul>
</div>
</div>
<div id="outline-container-org8f178a2" class="outline-3">
<h3 id="org8f178a2"><span class="section-number-3">13.33.</span> Load Software Before Compilation</h3>
<div class="outline-text-3" id="text-13-33">
<p>
Initialize Spack:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>source /apps/spack/share/spack/setup-env.sh
</code></pre>
</div>

<p>
Load compiler:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>spack load gcc@13.4.0
</code></pre>
</div>

<p>
Load MPI runtime:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>spack load openmpi
</code></pre>
</div>

<p>
Verify:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>which mpicc
</code></pre>
</div>

<p>
Expected:
</p>
<ul class="org-ul">
<li>MPI compiler wrapper path</li>
</ul>
</div>
</div>
<div id="outline-container-org793b951" class="outline-3">
<h3 id="org793b951"><span class="section-number-3">13.34.</span> Compile MPI Program</h3>
<div class="outline-text-3" id="text-13-34">
<p>
Compile:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>mpicc mpi_sum.c -o mpi_sum
</code></pre>
</div>

<p>
Verify executable:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ls
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgb6f6090">
mpi_sum
</pre>
</div>
</div>
<div id="outline-container-orgcebb222" class="outline-3">
<h3 id="orgcebb222"><span class="section-number-3">13.35.</span> IMPORTANT MPI Compilation Concept</h3>
<div class="outline-text-3" id="text-13-35">
<p>
MPI programs are compiled using:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>mpicc
</code></pre>
</div>

<p>
instead of:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>gcc
</code></pre>
</div>

<p>
because MPI wrapper automatically injects:
</p>

<ul class="org-ul">
<li>MPI headers</li>
<li>MPI libraries</li>
<li>linker flags</li>
</ul>
</div>
</div>
<div id="outline-container-org95afdfd" class="outline-3">
<h3 id="org95afdfd"><span class="section-number-3">13.36.</span> Interactive MPI Runtime Validation</h3>
<div class="outline-text-3" id="text-13-36">
<p>
Run interactively:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>mpirun -np 4 ./mpi_sum
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org4e6d479">
========== SERIAL COMPUTATION ==========
...

========== PARALLEL COMPUTATION ==========
...

========== PERFORMANCE ==========
...
</pre>

<p>
This validates:
</p>

<ul class="org-ul">
<li>MPI runtime</li>
<li>MPI communication</li>
<li>reduction operations</li>
<li>distributed execution</li>
</ul>
</div>
</div>
<div id="outline-container-org82253a9" class="outline-3">
<h3 id="org82253a9"><span class="section-number-3">13.37.</span> IMPORTANT Shared Filesystem Advantage</h3>
<div class="outline-text-3" id="text-13-37">
<p>
Because:
</p>

<ul class="org-ul">
<li>source code</li>
<li>executable</li>
<li>software stack</li>
</ul>

<p>
exist on shared filesystem:
</p>

<pre class="example" id="org47c1b56">
/apps
or
/home
</pre>

<p>
compute nodes automatically access:
</p>

<ul class="org-ul">
<li>compiled binaries</li>
<li>runtime libraries</li>
<li>MPI stack</li>
</ul>

<p>
without recompilation.
</p>

<p>
This is one of the major HPC architecture advantages.
</p>
</div>
</div>
<div id="outline-container-orga6a1ab2" class="outline-3">
<h3 id="orga6a1ab2"><span class="section-number-3">13.38.</span> Create Slurm Batch Script</h3>
<div class="outline-text-3" id="text-13-38">
<p>
Create batch script:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>vim submit.sh
</code></pre>
</div>

<p>
Paste:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>#!/bin/bash
#SBATCH -N 3
#SBATCH --ntasks-per-node=1
#SBATCH --job-name=test
#SBATCH --output=%J.out
#SBATCH --error=%J.err
#SBATCH --time=01:00:00
##SBATCH --nodelist=compute03,compute01

source /apps/spack/share/spack/setup-env.sh

spack load openmpi

mpirun -np $SLURM_NTASKS ./$1
</code></pre>
</div>

<p>
Make executable:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>chmod +x submit.sh
</code></pre>
</div>
</div>
</div>
