README.org
** IMPORTANT Slurm Script Explanation

| Line | Purpose |
|-------+----------|
| #SBATCH -N 3 | request 3 nodes |
| --ntasks-per-node=1 | one MPI rank per node |
| --job-name=test | job name |
| --output=%J.out | stdout file |
| --error=%J.err | stderr file |
| --time=01:00:00 | walltime limit |

** IMPORTANT Runtime Environment Section

Inside batch script:

#+begin_src bash
source /apps/spack/share/spack/setup-env.sh
#+end_src

initializes Spack environment.

#+begin_src bash
spack load openmpi
#+end_src

loads MPI runtime stack.

Without these:

- mpirun may fail
- MPI libraries may not load
- runtime linker errors may occur

** IMPORTANT Slurm Runtime Variable

#+begin_src bash
$SLURM_NTASKS
#+end_src

contains:

#+begin_example
total MPI process count allocated by Slurm
#+end_example

Example:

| Nodes | Tasks per node | Total |
|-------+-----------------+-------|
| 3 | 1 | 3 |

Therefore:

#+begin_src bash
mpirun -np $SLURM_NTASKS
#+end_src

automatically launches correct number of MPI ranks.

** Submit MPI Job

Submit job:

#+begin_src bash
sbatch submit.sh mpi_sum
#+end_src

Expected:

#+begin_example
Submitted batch job 101
#+end_example

This validates:

- Slurm scheduler
- distributed allocation
- multinode MPI execution
- scheduler-aware runtime launch

** Monitor Jobs

Check user jobs:

#+begin_src bash
squeue --me
#+end_src

Expected:

#+begin_example
JOBID PARTITION NAME USER ST TIME NODES NODELIST(REASON)
#+end_example

** IMPORTANT Job States

| State | Meaning |
|--------+----------|
| PD | pending |
| R | running |
| CG | completing |
| CD | completed |
| F | failed |

** View Detailed Job Information

Show detailed job info:

#+begin_src bash
scontrol show job <jobid>
#+end_src

Example:

#+begin_src bash
scontrol show job 101
#+end_src

Displays:

- allocated nodes
- CPUs
- runtime
- scheduling information
- execution directory
- output locations

** Check Cluster Status

Check cluster nodes:

#+begin_src bash
sinfo
#+end_src

Expected:

#+begin_example
debug* up infinite 3 idle compute[01-03]
#+end_example

** IMPORTANT Node States

| State | Meaning |
|--------+----------|
| idle | available |
| alloc | allocated |
| mix | partially used |
| drain | unavailable |
| down | offline |

** Check Output Files

After completion:

#+begin_src bash
ls
#+end_src

Expected:

#+begin_example
101.out
101.err
#+end_example

View output:

#+begin_src bash
cat 101.out
#+end_src

Expected:

- serial runtime
- parallel runtime
- speedup
- efficiency

** IMPORTANT HPC Performance Metrics

The program calculates:

| Metric | Meaning |
|---------+----------|
| Speedup | serial_time / parallel_time |
| Efficiency | speedup / processes |

Ideal values:

| Metric | Ideal |
|---------+-------|
| Speedup | near process count |
| Efficiency | near 1.0 |

Real systems experience:

- communication overhead
- synchronization cost
- MPI latency
- reduction overhead

** Cancel Jobs

Cancel job:

#+begin_src bash
scancel <jobid>
#+end_src

Example:

#+begin_src bash
scancel 101
#+end_src

Cancel all user jobs:

#+begin_src bash
scancel -u $USER
#+end_src

** Interactive Slurm Execution

Launch interactive shell:

#+begin_src bash
srun --pty bash
#+end_src

Distributed hostname test:

#+begin_src bash
srun -N 3 -n 3 hostname
#+end_src

Expected:
- hostnames from allocated nodes

This validates:

- scheduler allocation
- distributed execution
- runtime communication

** IMPORTANT HPC Workflow

Typical HPC workflow:

#+begin_example
Load software
    ↓
Compile application
    ↓
Prepare Slurm script
    ↓
Submit job
    ↓
Monitor execution
    ↓
Analyze outputs
#+end_example

** IMPORTANT Production HPC Concept

Production HPC systems usually separate:

- operating system packages
- scientific software stack
- compiler stack
- MPI runtime stack
- scheduler integration

exactly like this setup.

This architecture provides:

- reproducibility
- scalability
- centralized administration
- software consistency
- runtime portability 
  
