README.html
<div id="outline-container-org90773bc" class="outline-3">
<h3 id="org90773bc"><span class="section-number-3">13.39.</span> IMPORTANT Slurm Script Explanation</h3>
<div class="outline-text-3" id="text-13-39">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Line</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">#SBATCH -N 3</td>
<td class="org-left">request 3 nodes</td>
</tr>

<tr>
<td class="org-left">&ndash;ntasks-per-node=1</td>
<td class="org-left">one MPI rank per node</td>
</tr>

<tr>
<td class="org-left">&ndash;job-name=test</td>
<td class="org-left">job name</td>
</tr>

<tr>
<td class="org-left">&ndash;output=%J.out</td>
<td class="org-left">stdout file</td>
</tr>

<tr>
<td class="org-left">&ndash;error=%J.err</td>
<td class="org-left">stderr file</td>
</tr>

<tr>
<td class="org-left">&ndash;time=01:00:00</td>
<td class="org-left">walltime limit</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org97a810e" class="outline-3">
<h3 id="org97a810e"><span class="section-number-3">13.40.</span> IMPORTANT Runtime Environment Section</h3>
<div class="outline-text-3" id="text-13-40">
<p>
Inside batch script:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>source /apps/spack/share/spack/setup-env.sh
</code></pre>
</div>

<p>
initializes Spack environment.
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>spack load openmpi
</code></pre>
</div>

<p>
loads MPI runtime stack.
</p>

<p>
Without these:
</p>

<ul class="org-ul">
<li>mpirun may fail</li>
<li>MPI libraries may not load</li>
<li>runtime linker errors may occur</li>
</ul>
</div>
</div>
<div id="outline-container-org55beba7" class="outline-3">
<h3 id="org55beba7"><span class="section-number-3">13.41.</span> IMPORTANT Slurm Runtime Variable</h3>
<div class="outline-text-3" id="text-13-41">
<div class="org-src-container">
<pre class="src src-bash"><code>$SLURM_NTASKS
</code></pre>
</div>

<p>
contains:
</p>

<pre class="example" id="org1c2653b">
total MPI process count allocated by Slurm
</pre>

<p>
Example:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Nodes</th>
<th scope="col" class="org-right">Tasks per node</th>
<th scope="col" class="org-right">Total</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">3</td>
<td class="org-right">1</td>
<td class="org-right">3</td>
</tr>
</tbody>
</table>

<p>
Therefore:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>mpirun -np $SLURM_NTASKS
</code></pre>
</div>

<p>
automatically launches correct number of MPI ranks.
</p>
</div>
</div>
<div id="outline-container-org92e900e" class="outline-3">
<h3 id="org92e900e"><span class="section-number-3">13.42.</span> Submit MPI Job</h3>
<div class="outline-text-3" id="text-13-42">
<p>
Submit job:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sbatch submit.sh mpi_sum
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgca8af06">
Submitted batch job 101
</pre>

<p>
This validates:
</p>

<ul class="org-ul">
<li>Slurm scheduler</li>
<li>distributed allocation</li>
<li>multinode MPI execution</li>
<li>scheduler-aware runtime launch</li>
</ul>
</div>
</div>
<div id="outline-container-orgfe22644" class="outline-3">
<h3 id="orgfe22644"><span class="section-number-3">13.43.</span> Monitor Jobs</h3>
<div class="outline-text-3" id="text-13-43">
<p>
Check user jobs:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>squeue --me
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org4ba1d04">
JOBID PARTITION NAME USER ST TIME NODES NODELIST(REASON)
</pre>
</div>
</div>
<div id="outline-container-org19ac3be" class="outline-3">
<h3 id="org19ac3be"><span class="section-number-3">13.44.</span> IMPORTANT Job States</h3>
<div class="outline-text-3" id="text-13-44">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">State</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PD</td>
<td class="org-left">pending</td>
</tr>

<tr>
<td class="org-left">R</td>
<td class="org-left">running</td>
</tr>

<tr>
<td class="org-left">CG</td>
<td class="org-left">completing</td>
</tr>

<tr>
<td class="org-left">CD</td>
<td class="org-left">completed</td>
</tr>

<tr>
<td class="org-left">F</td>
<td class="org-left">failed</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org068088f" class="outline-3">
<h3 id="org068088f"><span class="section-number-3">13.45.</span> View Detailed Job Information</h3>
<div class="outline-text-3" id="text-13-45">
<p>
Show detailed job info:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>scontrol show job &lt;jobid&gt;
</code></pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>scontrol show job 101
</code></pre>
</div>

<p>
Displays:
</p>

<ul class="org-ul">
<li>allocated nodes</li>
<li>CPUs</li>
<li>runtime</li>
<li>scheduling information</li>
<li>execution directory</li>
<li>output locations</li>
</ul>
</div>
</div>
<div id="outline-container-org36c3836" class="outline-3">
<h3 id="org36c3836"><span class="section-number-3">13.46.</span> Check Cluster Status</h3>
<div class="outline-text-3" id="text-13-46">
<p>
Check cluster nodes:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sinfo
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgb31a577">
debug* up infinite 3 idle compute[01-03]
</pre>
</div>
</div>
<div id="outline-container-orge03325f" class="outline-3">
<h3 id="orge03325f"><span class="section-number-3">13.47.</span> IMPORTANT Node States</h3>
<div class="outline-text-3" id="text-13-47">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">State</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">idle</td>
<td class="org-left">available</td>
</tr>

<tr>
<td class="org-left">alloc</td>
<td class="org-left">allocated</td>
</tr>

<tr>
<td class="org-left">mix</td>
<td class="org-left">partially used</td>
</tr>

<tr>
<td class="org-left">drain</td>
<td class="org-left">unavailable</td>
</tr>

<tr>
<td class="org-left">down</td>
<td class="org-left">offline</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org291f243" class="outline-3">
<h3 id="org291f243"><span class="section-number-3">13.48.</span> Check Output Files</h3>
<div class="outline-text-3" id="text-13-48">
<p>
After completion:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ls
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgc92c645">
101.out
101.err
</pre>

<p>
View output:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>cat 101.out
</code></pre>
</div>

<p>
Expected:
</p>

<ul class="org-ul">
<li>serial runtime</li>
<li>parallel runtime</li>
<li>speedup</li>
<li>efficiency</li>
</ul>
</div>
</div>
<div id="outline-container-org433dbb8" class="outline-3">
<h3 id="org433dbb8"><span class="section-number-3">13.49.</span> IMPORTANT HPC Performance Metrics</h3>
<div class="outline-text-3" id="text-13-49">
<p>
The program calculates:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Metric</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Speedup</td>
<td class="org-left">serial_time / parallel_time</td>
</tr>

<tr>
<td class="org-left">Efficiency</td>
<td class="org-left">speedup / processes</td>
</tr>
</tbody>
</table>

<p>
Ideal values:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Metric</th>
<th scope="col" class="org-left">Ideal</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Speedup</td>
<td class="org-left">near process count</td>
</tr>

<tr>
<td class="org-left">Efficiency</td>
<td class="org-left">near 1.0</td>
</tr>
</tbody>
</table>

<p>
Real systems experience:
</p>

<ul class="org-ul">
<li>communication overhead</li>
<li>synchronization cost</li>
<li>MPI latency</li>
<li>reduction overhead</li>
</ul>
</div>
</div>
<div id="outline-container-org3b16ee9" class="outline-3">
<h3 id="org3b16ee9"><span class="section-number-3">13.50.</span> Cancel Jobs</h3>
<div class="outline-text-3" id="text-13-50">
<p>
Cancel job:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>scancel &lt;jobid&gt;
</code></pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>scancel 101
</code></pre>
</div>

<p>
Cancel all user jobs:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>scancel -u $USER
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgae15d4f" class="outline-3">
<h3 id="orgae15d4f"><span class="section-number-3">13.51.</span> Interactive Slurm Execution</h3>
<div class="outline-text-3" id="text-13-51">
<p>
Launch interactive shell:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>srun --pty bash
</code></pre>
</div>

<p>
Distributed hostname test:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>srun -N 3 -n 3 hostname
</code></pre>
</div>

<p>
Expected:
</p>
<ul class="org-ul">
<li>hostnames from allocated nodes</li>
</ul>

<p>
This validates:
</p>

<ul class="org-ul">
<li>scheduler allocation</li>
<li>distributed execution</li>
<li>runtime communication</li>
</ul>
</div>
</div>
<div id="outline-container-orgd6ae080" class="outline-3">
<h3 id="orgd6ae080"><span class="section-number-3">13.52.</span> IMPORTANT HPC Workflow</h3>
<div class="outline-text-3" id="text-13-52">
<p>
Typical HPC workflow:
</p>

<pre class="example" id="orga1da2e9">
Load software
    ↓
Compile application
    ↓
Prepare Slurm script
    ↓
Submit job
    ↓
Monitor execution
    ↓
Analyze outputs
</pre>
</div>
</div>
<div id="outline-container-org2257d6a" class="outline-3">
<h3 id="org2257d6a"><span class="section-number-3">13.53.</span> IMPORTANT Production HPC Concept</h3>
<div class="outline-text-3" id="text-13-53">
<p>
Production HPC systems usually separate:
</p>

<ul class="org-ul">
<li>operating system packages</li>
<li>scientific software stack</li>
<li>compiler stack</li>
<li>MPI runtime stack</li>
<li>scheduler integration</li>
</ul>

<p>
exactly like this setup.
</p>

<p>
This architecture provides:
</p>

<ul class="org-ul">
<li>reproducibility</li>
<li>scalability</li>
<li>centralized administration</li>
<li>software consistency</li>
<li>runtime portability</li>
</ul>
</div>
</div>
</div>
