README.org
* Centralized Identity Management using OpenLDAP + nslcd

Goal:

Transform the cluster from:

#+begin_example
local-user-only infrastructure
#+end_example

into:

#+begin_example
centralized multi-user HPC environment
#+end_example

using:

- OpenLDAP
- nslcd
- NSS
- PAM

This phase introduces centralized user management for the HPC cluster.

After completion:

- users are created once centrally
- login node recognizes LDAP users
- compute nodes recognize LDAP users
- centralized authentication works cluster-wide
- automatic home directory creation works
- Slurm can later use centralized identities

** Important Architecture

Cluster roles:

| Node | Role |
|-------+------|
| master | LDAP server |
| login | LDAP client |
| compute01 | LDAP client |
| compute02 | LDAP client |
| compute03 | LDAP client |

Important concept:

#+begin_example
Only master runs LDAP SERVER (slapd).

Login and compute nodes run LDAP CLIENTS (nslcd).
#+end_example

** Important Linux Authentication Concepts

Before starting, understand the layers.

| Component | Purpose |
|------------+----------|
| LDAP | centralized user database |
| NSS | user/group lookup |
| PAM | authentication |
| nslcd | bridge between Linux and LDAP |

Authentication flow:

#+begin_example
SSH Login
   ↓
PAM
   ↓
nslcd
   ↓
LDAP server
#+end_example

** Install OpenLDAP Server on Master Node

Run ONLY on:

#+begin_example
master
#+end_example

Install LDAP packages:

#+begin_src bash
sudo dnf install -y \
openldap \
openldap-servers \
openldap-clients
#+end_src

Package explanation:

| Package | Purpose |
|----------+----------|
| openldap | LDAP utilities |
| openldap-servers | slapd server daemon |
| openldap-clients | ldapsearch, ldapadd etc |

** Enable LDAP Server

Run ONLY on:

#+begin_example
master
#+end_example

Enable and start slapd:

#+begin_src bash
sudo systemctl enable --now slapd
#+end_src

Verify:

#+begin_src bash
systemctl status slapd
#+end_src

Expected:

#+begin_example
active (running)
#+end_example

** Generate LDAP Admin Password Hash

Run ONLY on:

#+begin_example
master
#+end_example

Generate secure LDAP admin password hash:

#+begin_src bash
slappasswd
#+end_src

Enter desired password.

Example:

#+begin_example
cluster123
#+end_example

Example output:

#+begin_example
{SSHA}xxxxxxxxxxxxxxxx
#+end_example

Important:

#+begin_example
Copy this hash carefully.
#+end_example

It will be used in LDAP database configuration.

** Configure LDAP Database

Run ONLY on:

#+begin_example
master
#+end_example

Create LDAP database configuration file:

#+begin_src bash
vim ~/db.ldif
#+end_src

Paste:

#+begin_src ldif
dn: olcDatabase={2}mdb,cn=config
changetype: modify
replace: olcSuffix
olcSuffix: dc=hpc,dc=local

dn: olcDatabase={2}mdb,cn=config
changetype: modify
replace: olcRootDN
olcRootDN: cn=Manager,dc=hpc,dc=local

dn: olcDatabase={2}mdb,cn=config
changetype: modify
replace: olcRootPW
olcRootPW: PASTE_HASH_HERE
#+end_src

Replace:

#+begin_example
PASTE_HASH_HERE
#+end_example

with the hash generated using:

#+begin_example
slappasswd
#+end_example

** Important LDAP Concepts

LDAP uses a hierarchical tree called:

#+begin_example
DIT -- Directory Information Tree
#+end_example

Example structure:

#+begin_example
dc=hpc,dc=local
 ├── ou=People
 └── ou=Groups
#+end_example

Meaning of terms:

| Term | Meaning |
|-------+---------|
| dc | domain component |
| ou | organizational unit |
| cn | common name |

** Apply LDAP Database Configuration

Run ONLY on:

#+begin_example
master
#+end_example

Apply configuration:

#+begin_src bash
sudo ldapmodify -Y EXTERNAL -H ldapi:/// \
-f ~/db.ldif
#+end_src

Expected:

#+begin_example
modifying entry
#+end_example

** Import LDAP Schemas

Schemas define:

- user attributes
- group attributes
- UNIX account structure

Run ONLY on:

#+begin_example
master
#+end_example

Import cosine schema:

#+begin_src bash
sudo ldapadd -Y EXTERNAL -H ldapi:/// \
-f /etc/openldap/schema/cosine.ldif
#+end_src

Import nis schema:

#+begin_src bash
sudo ldapadd -Y EXTERNAL -H ldapi:/// \
-f /etc/openldap/schema/nis.ldif
#+end_src

Import inetorgperson schema:

#+begin_src bash
sudo ldapadd -Y EXTERNAL -H ldapi:/// \
-f /etc/openldap/schema/inetorgperson.ldif
#+end_src

Schema explanation:

| Schema | Purpose |
|---------+----------|
| cosine | basic directory attributes |
| nis | UNIX/Linux account support |
| inetorgperson | user/person identity support |

** Create LDAP Base Tree

Run ONLY on:

#+begin_example
master
#+end_example

Create base LDAP tree:

#+begin_src bash
vim ~/base.ldif
#+end_src

Paste:

#+begin_src ldif
dn: dc=hpc,dc=local
objectClass: top
objectClass: dcObject
objectClass: organization
o: HPC Cluster
dc: hpc

dn: ou=People,dc=hpc,dc=local
objectClass: organizationalUnit
ou: People

dn: ou=Groups,dc=hpc,dc=local
objectClass: organizationalUnit
ou: Groups
#+end_src

Apply tree:

#+begin_src bash
ldapadd -x \
-D "cn=Manager,dc=hpc,dc=local" \
-W \
-f ~/base.ldif
#+end_src

Enter LDAP admin password.

