README.html
<div id="outline-container-orge06eed9" class="outline-2">
<h2 id="orge06eed9"><span class="section-number-2">14.</span> Centralized Identity Management using OpenLDAP + nslcd</h2>
<div class="outline-text-2" id="text-14">
<p>
Goal:
</p>

<p>
Transform the cluster from:
</p>

<pre class="example" id="org3fdc82a">
local-user-only infrastructure
</pre>

<p>
into:
</p>

<pre class="example" id="org2f5aec0">
centralized multi-user HPC environment
</pre>

<p>
using:
</p>

<ul class="org-ul">
<li>OpenLDAP</li>
<li>nslcd</li>
<li>NSS</li>
<li>PAM</li>
</ul>

<p>
This phase introduces centralized user management for the HPC cluster.
</p>

<p>
After completion:
</p>

<ul class="org-ul">
<li>users are created once centrally</li>
<li>login node recognizes LDAP users</li>
<li>compute nodes recognize LDAP users</li>
<li>centralized authentication works cluster-wide</li>
<li>automatic home directory creation works</li>
<li>Slurm can later use centralized identities</li>
</ul>
</div>
<div id="outline-container-org6208970" class="outline-3">
<h3 id="org6208970"><span class="section-number-3">14.1.</span> Important Architecture</h3>
<div class="outline-text-3" id="text-14-1">
<p>
Cluster roles:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Node</th>
<th scope="col" class="org-left">Role</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">master</td>
<td class="org-left">LDAP server</td>
</tr>

<tr>
<td class="org-left">login</td>
<td class="org-left">LDAP client</td>
</tr>

<tr>
<td class="org-left">compute01</td>
<td class="org-left">LDAP client</td>
</tr>

<tr>
<td class="org-left">compute02</td>
<td class="org-left">LDAP client</td>
</tr>

<tr>
<td class="org-left">compute03</td>
<td class="org-left">LDAP client</td>
</tr>
</tbody>
</table>

<p>
Important concept:
</p>

<pre class="example" id="org2a22d3f">
Only master runs LDAP SERVER (slapd).

Login and compute nodes run LDAP CLIENTS (nslcd).
</pre>
</div>
</div>
<div id="outline-container-org44ac12c" class="outline-3">
<h3 id="org44ac12c"><span class="section-number-3">14.2.</span> Important Linux Authentication Concepts</h3>
<div class="outline-text-3" id="text-14-2">
<p>
Before starting, understand the layers.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Component</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">LDAP</td>
<td class="org-left">centralized user database</td>
</tr>

<tr>
<td class="org-left">NSS</td>
<td class="org-left">user/group lookup</td>
</tr>

<tr>
<td class="org-left">PAM</td>
<td class="org-left">authentication</td>
</tr>

<tr>
<td class="org-left">nslcd</td>
<td class="org-left">bridge between Linux and LDAP</td>
</tr>
</tbody>
</table>

<p>
Authentication flow:
</p>

<pre class="example" id="org6871121">
SSH Login
   ↓
PAM
   ↓
nslcd
   ↓
LDAP server
</pre>
</div>
</div>
<div id="outline-container-orgffd4018" class="outline-3">
<h3 id="orgffd4018"><span class="section-number-3">14.3.</span> Install OpenLDAP Server on Master Node</h3>
<div class="outline-text-3" id="text-14-3">
<p>
Run ONLY on:
</p>

<pre class="example" id="org55d4242">
master
</pre>

<p>
Install LDAP packages:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo dnf install -y \
openldap \
openldap-servers \
openldap-clients
</code></pre>
</div>

<p>
Package explanation:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Package</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">openldap</td>
<td class="org-left">LDAP utilities</td>
</tr>

<tr>
<td class="org-left">openldap-servers</td>
<td class="org-left">slapd server daemon</td>
</tr>

<tr>
<td class="org-left">openldap-clients</td>
<td class="org-left">ldapsearch, ldapadd etc</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgbcaf1ff" class="outline-3">
<h3 id="orgbcaf1ff"><span class="section-number-3">14.4.</span> Enable LDAP Server</h3>
<div class="outline-text-3" id="text-14-4">
<p>
Run ONLY on:
</p>

<pre class="example" id="org19bdde4">
master
</pre>

<p>
Enable and start slapd:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl enable --now slapd
</code></pre>
</div>

<p>
Verify:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>systemctl status slapd
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org9d99126">
active (running)
</pre>
</div>
</div>
<div id="outline-container-orgd5256de" class="outline-3">
<h3 id="orgd5256de"><span class="section-number-3">14.5.</span> Generate LDAP Admin Password Hash</h3>
<div class="outline-text-3" id="text-14-5">
<p>
Run ONLY on:
</p>

<pre class="example" id="org3995ea7">
master
</pre>

<p>
Generate secure LDAP admin password hash:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>slappasswd
</code></pre>
</div>

<p>
Enter desired password.
</p>

<p>
Example:
</p>

<pre class="example" id="org4d7263c">
cluster123
</pre>

<p>
Example output:
</p>

<pre class="example" id="orgad91b34">
{SSHA}xxxxxxxxxxxxxxxx
</pre>

<p>
Important:
</p>

<pre class="example" id="org6fe27ab">
Copy this hash carefully.
</pre>

<p>
It will be used in LDAP database configuration.
</p>
</div>
</div>
<div id="outline-container-orgcc2215e" class="outline-3">
<h3 id="orgcc2215e"><span class="section-number-3">14.6.</span> Configure LDAP Database</h3>
<div class="outline-text-3" id="text-14-6">
<p>
Run ONLY on:
</p>

<pre class="example" id="org01ef567">
master
</pre>

<p>
Create LDAP database configuration file:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>vim ~/db.ldif
</code></pre>
</div>

<p>
Paste:
</p>

<div class="org-src-container">
<pre class="src src-ldif"><code>dn: olcDatabase={2}mdb,cn=config
changetype: modify
replace: olcSuffix
olcSuffix: dc=hpc,dc=local

dn: olcDatabase={2}mdb,cn=config
changetype: modify
replace: olcRootDN
olcRootDN: cn=Manager,dc=hpc,dc=local

dn: olcDatabase={2}mdb,cn=config
changetype: modify
replace: olcRootPW
olcRootPW: PASTE_HASH_HERE
</code></pre>
</div>

<p>
Replace:
</p>

<pre class="example" id="org21cb23f">
PASTE_HASH_HERE
</pre>

<p>
with the hash generated using:
</p>

<pre class="example" id="org80303c5">
slappasswd
</pre>
</div>
</div>
<div id="outline-container-orgae97c71" class="outline-3">
<h3 id="orgae97c71"><span class="section-number-3">14.7.</span> Important LDAP Concepts</h3>
<div class="outline-text-3" id="text-14-7">
<p>
LDAP uses a hierarchical tree called:
</p>

<pre class="example" id="orgd7f9b8e">
DIT -- Directory Information Tree
</pre>

<p>
Example structure:
</p>

<pre class="example" id="org90433d4">
dc=hpc,dc=local
 ├── ou=People
 └── ou=Groups
</pre>

<p>
Meaning of terms:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">dc</td>
<td class="org-left">domain component</td>
</tr>

<tr>
<td class="org-left">ou</td>
<td class="org-left">organizational unit</td>
</tr>

<tr>
<td class="org-left">cn</td>
<td class="org-left">common name</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8dd49a0" class="outline-3">
<h3 id="org8dd49a0"><span class="section-number-3">14.8.</span> Apply LDAP Database Configuration</h3>
<div class="outline-text-3" id="text-14-8">
<p>
Run ONLY on:
</p>

<pre class="example" id="orga54f9fd">
master
</pre>

<p>
Apply configuration:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo ldapmodify -Y EXTERNAL -H ldapi:/// \
-f ~/db.ldif
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org825683c">
modifying entry
</pre>
</div>
</div>
<div id="outline-container-org044e749" class="outline-3">
<h3 id="org044e749"><span class="section-number-3">14.9.</span> Import LDAP Schemas</h3>
<div class="outline-text-3" id="text-14-9">
<p>
Schemas define:
</p>

<ul class="org-ul">
<li>user attributes</li>
<li>group attributes</li>
<li>UNIX account structure</li>
</ul>

<p>
Run ONLY on:
</p>

<pre class="example" id="org30626fa">
master
</pre>

<p>
Import cosine schema:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo ldapadd -Y EXTERNAL -H ldapi:/// \
-f /etc/openldap/schema/cosine.ldif
</code></pre>
</div>

<p>
Import nis schema:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo ldapadd -Y EXTERNAL -H ldapi:/// \
-f /etc/openldap/schema/nis.ldif
</code></pre>
</div>

<p>
Import inetorgperson schema:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo ldapadd -Y EXTERNAL -H ldapi:/// \
-f /etc/openldap/schema/inetorgperson.ldif
</code></pre>
</div>

<p>
Schema explanation:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Schema</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">cosine</td>
<td class="org-left">basic directory attributes</td>
</tr>

<tr>
<td class="org-left">nis</td>
<td class="org-left">UNIX/Linux account support</td>
</tr>

<tr>
<td class="org-left">inetorgperson</td>
<td class="org-left">user/person identity support</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org87db5cb" class="outline-3">
<h3 id="org87db5cb"><span class="section-number-3">14.10.</span> Create LDAP Base Tree</h3>
<div class="outline-text-3" id="text-14-10">
<p>
Run ONLY on:
</p>

<pre class="example" id="orgcff4ddb">
master
</pre>

<p>
Create base LDAP tree:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>vim ~/base.ldif
</code></pre>
</div>

<p>
Paste:
</p>

<div class="org-src-container">
<pre class="src src-ldif"><code>dn: dc=hpc,dc=local
objectClass: top
objectClass: dcObject
objectClass: organization
o: HPC Cluster
dc: hpc

dn: ou=People,dc=hpc,dc=local
objectClass: organizationalUnit
ou: People

dn: ou=Groups,dc=hpc,dc=local
objectClass: organizationalUnit
ou: Groups
</code></pre>
</div>

<p>
Apply tree:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ldapadd -x \
-D "cn=Manager,dc=hpc,dc=local" \
-W \
-f ~/base.ldif
</code></pre>
</div>

<p>
Enter LDAP admin password.
</p>
</div>
</div>
