README.org
** Verify LDAP Tree

Run ONLY on:

#+begin_example
master
#+end_example

Verify tree:

#+begin_src bash
ldapsearch -x -b "dc=hpc,dc=local"
#+end_src

Expected:

- dc=hpc,dc=local
- ou=People
- ou=Groups

** Create LDAP Group

Run ONLY on:

#+begin_example
master
#+end_example

Create group file:

#+begin_src bash
vim ~/group.ldif
#+end_src

Paste:

#+begin_src ldif
dn: cn=hpcusers,ou=Groups,dc=hpc,dc=local
objectClass: posixGroup
cn: hpcusers
gidNumber: 10000
#+end_src

Add group:

#+begin_src bash
ldapadd -x \
-D "cn=Manager,dc=hpc,dc=local" \
-W \
-f ~/group.ldif
#+end_src

** Create LDAP User Password Hash

Run ONLY on:

#+begin_example
master
#+end_example

Generate password hash:

#+begin_src bash
slappasswd
#+end_src

Example password:

#+begin_example
test123
#+end_example

Copy generated hash carefully.

** Create LDAP User

Run ONLY on:

#+begin_example
master
#+end_example

Create user file:

#+begin_src bash
vim ~/user.ldif
#+end_src

Paste:

#+begin_src ldif
dn: uid=testUser,ou=People,dc=hpc,dc=local
objectClass: inetOrgPerson
objectClass: posixAccount
objectClass: shadowAccount
cn: Test User
sn: User
uid: testUser
uidNumber: 10001
gidNumber: 10000
homeDirectory: /home/testUser
loginShell: /bin/bash
userPassword: PASTE_HASH_HERE
#+end_src

Replace:

#+begin_example
PASTE_HASH_HERE
#+end_example

with actual hash from:

#+begin_example
slappasswd
#+end_example

Add user:

#+begin_src bash
ldapadd -x \
-D "cn=Manager,dc=hpc,dc=local" \
-W \
-f ~/user.ldif
#+end_src

** Important LDAP User Attributes

| Attribute | Purpose |
|------------+----------|
| uid | username |
| uidNumber | UNIX UID |
| gidNumber | primary group |
| homeDirectory | user home |
| loginShell | login shell |
| cn | common name |
| sn | surname |

** Verify LDAP User

Run ONLY on:

#+begin_example
master
#+end_example

Verify user:

#+begin_src bash
ldapsearch -x \
-b "dc=hpc,dc=local" uid=testUser
#+end_src

Expected:
- LDAP user entry

** Configure LDAP Client on Login Node

Now begin client-side integration.

Run ONLY on:

#+begin_example
login
#+end_example

Install LDAP client packages:

#+begin_src bash
sudo dnf install -y \
openldap-clients \
nss-pam-ldapd
#+end_src

** Configure nslcd

Run ONLY on:

#+begin_example
login
#+end_example

Create configuration:

#+begin_src bash
sudo vim /etc/nslcd.conf
#+end_src

Paste:

#+begin_src conf
uid nslcd
gid ldap

uri ldap://master
base dc=hpc,dc=local
#+end_src

Explanation:

| Parameter | Purpose |
|------------+----------|
| uri | LDAP server |
| base | LDAP search root |

Secure configuration:

#+begin_src bash
sudo chmod 600 /etc/nslcd.conf
#+end_src

** Enable nslcd

Run ONLY on:

#+begin_example
login
#+end_example

Enable service:

#+begin_src bash
sudo systemctl enable --now nslcd
#+end_src

Verify:

#+begin_src bash
systemctl status nslcd
#+end_src

Expected:

#+begin_example
active (running)
#+end_example

** Verify LDAP Connectivity

Run ONLY on:

#+begin_example
login
#+end_example

Test LDAP communication:

#+begin_src bash
ldapsearch -x \
-H ldap://master \
-b "dc=hpc,dc=local" uid=testUser
#+end_src

Expected:
- LDAP user entry

This verifies:
- login node can communicate with master LDAP server

** Configure NSS

Run ONLY on:

#+begin_example
login
#+end_example

Edit:

#+begin_src bash
sudo vim /etc/nsswitch.conf
#+end_src

Modify lines:

#+begin_src text
passwd: files ldap
group: files ldap
shadow: files ldap
#+end_src

Important:

#+begin_example
This tells Linux:
check local files first, then LDAP.
#+end_example

** Restart nslcd

Run ONLY on:

#+begin_example
login
#+end_example

Restart service:

#+begin_src bash
sudo systemctl restart nslcd
#+end_src

** Verify LDAP User Resolution

Run ONLY on:

#+begin_example
login
#+end_example

Test centralized user lookup:

#+begin_src bash
getent passwd testUser
#+end_src

Expected:

#+begin_example
testUser:x:10001:10000:Test User:/home/testUser:/bin/bash
#+end_example

Important concept:

#+begin_example
This proves Linux itself recognizes LDAP users.
#+end_example

This is one of the most important LDAP verification steps.

** NOTE (Do this for master too)
Now we must configure: *master* with EXACT same setup (master should be able to recognise the user).

** Install Automatic Home Directory Support

Run ONLY on:

#+begin_example
login
#+end_example

Install package:

#+begin_src bash
sudo dnf install -y oddjob-mkhomedir
#+end_src

Enable service:

#+begin_src bash
sudo systemctl enable --now oddjobd
#+end_src

Purpose:

#+begin_example
Automatically creates user home directory
during first successful login.
#+end_example

