README.html
<div id="outline-container-org700ca61" class="outline-3">
<h3 id="org700ca61"><span class="section-number-3">14.11.</span> Verify LDAP Tree</h3>
<div class="outline-text-3" id="text-14-11">
<p>
Run ONLY on:
</p>

<pre class="example" id="org4411afe">
master
</pre>

<p>
Verify tree:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ldapsearch -x -b "dc=hpc,dc=local"
</code></pre>
</div>

<p>
Expected:
</p>

<ul class="org-ul">
<li>dc=hpc,dc=local</li>
<li>ou=People</li>
<li>ou=Groups</li>
</ul>
</div>
</div>
<div id="outline-container-org606dde9" class="outline-3">
<h3 id="org606dde9"><span class="section-number-3">14.12.</span> Create LDAP Group</h3>
<div class="outline-text-3" id="text-14-12">
<p>
Run ONLY on:
</p>

<pre class="example" id="org4dca2b6">
master
</pre>

<p>
Create group file:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>vim ~/group.ldif
</code></pre>
</div>

<p>
Paste:
</p>

<div class="org-src-container">
<pre class="src src-ldif"><code>dn: cn=hpcusers,ou=Groups,dc=hpc,dc=local
objectClass: posixGroup
cn: hpcusers
gidNumber: 10000
</code></pre>
</div>

<p>
Add group:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ldapadd -x \
-D "cn=Manager,dc=hpc,dc=local" \
-W \
-f ~/group.ldif
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org5cd59f8" class="outline-3">
<h3 id="org5cd59f8"><span class="section-number-3">14.13.</span> Create LDAP User Password Hash</h3>
<div class="outline-text-3" id="text-14-13">
<p>
Run ONLY on:
</p>

<pre class="example" id="org97ba7a0">
master
</pre>

<p>
Generate password hash:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>slappasswd
</code></pre>
</div>

<p>
Example password:
</p>

<pre class="example" id="org930f14b">
test123
</pre>

<p>
Copy generated hash carefully.
</p>
</div>
</div>
<div id="outline-container-org171d0ff" class="outline-3">
<h3 id="org171d0ff"><span class="section-number-3">14.14.</span> Create LDAP User</h3>
<div class="outline-text-3" id="text-14-14">
<p>
Run ONLY on:
</p>

<pre class="example" id="orgc1190ce">
master
</pre>

<p>
Create user file:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>vim ~/user.ldif
</code></pre>
</div>

<p>
Paste:
</p>

<div class="org-src-container">
<pre class="src src-ldif"><code>dn: uid=testUser,ou=People,dc=hpc,dc=local
objectClass: inetOrgPerson
objectClass: posixAccount
objectClass: shadowAccount
cn: Test User
sn: User
uid: testUser
uidNumber: 10001
gidNumber: 10000
homeDirectory: /home/testUser
loginShell: /bin/bash
userPassword: PASTE_HASH_HERE
</code></pre>
</div>

<p>
Replace:
</p>

<pre class="example" id="orgca5d629">
PASTE_HASH_HERE
</pre>

<p>
with actual hash from:
</p>

<pre class="example" id="orgd017d1c">
slappasswd
</pre>

<p>
Add user:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ldapadd -x \
-D "cn=Manager,dc=hpc,dc=local" \
-W \
-f ~/user.ldif
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orge905198" class="outline-3">
<h3 id="orge905198"><span class="section-number-3">14.15.</span> Important LDAP User Attributes</h3>
<div class="outline-text-3" id="text-14-15">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Attribute</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">uid</td>
<td class="org-left">username</td>
</tr>

<tr>
<td class="org-left">uidNumber</td>
<td class="org-left">UNIX UID</td>
</tr>

<tr>
<td class="org-left">gidNumber</td>
<td class="org-left">primary group</td>
</tr>

<tr>
<td class="org-left">homeDirectory</td>
<td class="org-left">user home</td>
</tr>

<tr>
<td class="org-left">loginShell</td>
<td class="org-left">login shell</td>
</tr>

<tr>
<td class="org-left">cn</td>
<td class="org-left">common name</td>
</tr>

<tr>
<td class="org-left">sn</td>
<td class="org-left">surname</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org652f50b" class="outline-3">
<h3 id="org652f50b"><span class="section-number-3">14.16.</span> Verify LDAP User</h3>
<div class="outline-text-3" id="text-14-16">
<p>
Run ONLY on:
</p>

<pre class="example" id="org427bcca">
master
</pre>

<p>
Verify user:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ldapsearch -x \
-b "dc=hpc,dc=local" uid=testUser
</code></pre>
</div>

<p>
Expected:
</p>
<ul class="org-ul">
<li>LDAP user entry</li>
</ul>
</div>
</div>
<div id="outline-container-org5266d0d" class="outline-3">
<h3 id="org5266d0d"><span class="section-number-3">14.17.</span> Configure LDAP Client on Login Node</h3>
<div class="outline-text-3" id="text-14-17">
<p>
Now begin client-side integration.
</p>

<p>
Run ONLY on:
</p>

<pre class="example" id="orga7087ce">
login
</pre>

<p>
Install LDAP client packages:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo dnf install -y \
openldap-clients \
nss-pam-ldapd
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org120377b" class="outline-3">
<h3 id="org120377b"><span class="section-number-3">14.18.</span> Configure nslcd</h3>
<div class="outline-text-3" id="text-14-18">
<p>
Run ONLY on:
</p>

<pre class="example" id="orgd533754">
login
</pre>

<p>
Create configuration:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/nslcd.conf
</code></pre>
</div>

<p>
Paste:
</p>

<div class="org-src-container">
<pre class="src src-conf"><code>uid nslcd
gid ldap

uri ldap://master
base dc=hpc,dc=local
</code></pre>
</div>

<p>
Explanation:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Parameter</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">uri</td>
<td class="org-left">LDAP server</td>
</tr>

<tr>
<td class="org-left">base</td>
<td class="org-left">LDAP search root</td>
</tr>
</tbody>
</table>

<p>
Secure configuration:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo chmod 600 /etc/nslcd.conf
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgbe33600" class="outline-3">
<h3 id="orgbe33600"><span class="section-number-3">14.19.</span> Enable nslcd</h3>
<div class="outline-text-3" id="text-14-19">
<p>
Run ONLY on:
</p>

<pre class="example" id="orgf21e597">
login
</pre>

<p>
Enable service:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl enable --now nslcd
</code></pre>
</div>

<p>
Verify:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>systemctl status nslcd
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orge6935ff">
active (running)
</pre>
</div>
</div>
<div id="outline-container-orgcbae711" class="outline-3">
<h3 id="orgcbae711"><span class="section-number-3">14.20.</span> Verify LDAP Connectivity</h3>
<div class="outline-text-3" id="text-14-20">
<p>
Run ONLY on:
</p>

<pre class="example" id="orga543736">
login
</pre>

<p>
Test LDAP communication:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ldapsearch -x \
-H ldap://master \
-b "dc=hpc,dc=local" uid=testUser
</code></pre>
</div>

<p>
Expected:
</p>
<ul class="org-ul">
<li>LDAP user entry</li>
</ul>

<p>
This verifies:
</p>
<ul class="org-ul">
<li>login node can communicate with master LDAP server</li>
</ul>
</div>
</div>
<div id="outline-container-orgda3d12a" class="outline-3">
<h3 id="orgda3d12a"><span class="section-number-3">14.21.</span> Configure NSS</h3>
<div class="outline-text-3" id="text-14-21">
<p>
Run ONLY on:
</p>

<pre class="example" id="orga0b7980">
login
</pre>

<p>
Edit:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/nsswitch.conf
</code></pre>
</div>

<p>
Modify lines:
</p>

<div class="org-src-container">
<pre class="src src-text"><code>passwd: files ldap
group: files ldap
shadow: files ldap
</code></pre>
</div>

<p>
Important:
</p>

<pre class="example" id="org823190c">
This tells Linux:
check local files first, then LDAP.
</pre>
</div>
</div>
<div id="outline-container-orgf3a85ee" class="outline-3">
<h3 id="orgf3a85ee"><span class="section-number-3">14.22.</span> Restart nslcd</h3>
<div class="outline-text-3" id="text-14-22">
<p>
Run ONLY on:
</p>

<pre class="example" id="org8c11918">
login
</pre>

<p>
Restart service:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl restart nslcd
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org964d40d" class="outline-3">
<h3 id="org964d40d"><span class="section-number-3">14.23.</span> Verify LDAP User Resolution</h3>
<div class="outline-text-3" id="text-14-23">
<p>
Run ONLY on:
</p>

<pre class="example" id="org00b5f21">
login
</pre>

<p>
Test centralized user lookup:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>getent passwd testUser
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org7652d6b">
testUser:x:10001:10000:Test User:/home/testUser:/bin/bash
</pre>

<p>
Important concept:
</p>

<pre class="example" id="orgb11d779">
This proves Linux itself recognizes LDAP users.
</pre>

<p>
This is one of the most important LDAP verification steps.
</p>
</div>
</div>
<div id="outline-container-org5e79cf2" class="outline-3">
<h3 id="org5e79cf2"><span class="section-number-3">14.24.</span> NOTE (Do this for master too)</h3>
<div class="outline-text-3" id="text-14-24">
<p>
Now we must configure: <b>master</b> with EXACT same setup (master should be able to recognise the user).
</p>
</div>
</div>
<div id="outline-container-orgfcfa47c" class="outline-3">
<h3 id="orgfcfa47c"><span class="section-number-3">14.25.</span> Install Automatic Home Directory Support</h3>
<div class="outline-text-3" id="text-14-25">
<p>
Run ONLY on:
</p>

<pre class="example" id="org0dbb44f">
login
</pre>

<p>
Install package:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo dnf install -y oddjob-mkhomedir
</code></pre>
</div>

<p>
Enable service:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl enable --now oddjobd
</code></pre>
</div>

<p>
Purpose:
</p>

<pre class="example" id="orgcea7904">
Automatically creates user home directory
during first successful login.
</pre>
</div>
</div>
