README.org
** Configure PAM Authentication

Run ONLY on:

#+begin_example
login
#+end_example

Edit:

#+begin_src bash
sudo vim /etc/pam.d/system-auth
#+end_src

Add LDAP lines in appropriate sections.

Add in auth section:

#+begin_src text
auth        sufficient    pam_ldap.so use_first_pass
#+end_src

Add in account section:

#+begin_src text
account     sufficient    pam_ldap.so
#+end_src

Add in password section:

#+begin_src text
password    sufficient    pam_ldap.so use_authtok
#+end_src

Add in session section:

#+begin_src text
session     optional      pam_ldap.so
session     optional      pam_mkhomedir.so
#+end_src

Important:

#+begin_example
Do NOT remove pam_unix.so lines.
#+end_example

** Configure Second PAM File

Run ONLY on:

#+begin_example
login
#+end_example

Edit:

#+begin_src bash
sudo vim /etc/pam.d/password-auth
#+end_src

Add SAME LDAP PAM lines.

Reason:

#+begin_example
Different login methods use different PAM stacks.
#+end_example

** Restart Services

Run ONLY on:

#+begin_example
login
#+end_example

Restart services:

#+begin_src bash
sudo systemctl restart nslcd
sudo systemctl restart oddjobd
#+end_src

** Verify LDAP Authentication

Run ONLY on:

#+begin_example
login
#+end_example

Test login:

#+begin_src bash
su - testUser
#+end_src

Enter LDAP password.

Expected:

#+begin_example
Creating directory '/home/testUser'
#+end_example

Successful login indicates:

- LDAP authentication working
- PAM integration working
- automatic home directory creation working

** Verify User Home

Run ONLY on:

#+begin_example
login
#+end_example

After login:

#+begin_src bash
pwd
#+end_src

Expected:

#+begin_example
/home/testUser
#+end_example

*** NOW WE MUST REPLICATE TO COMPUTE NODES

Currently:

: login node works fully

Now we configure:

- compute01
- compute02
- compute03

with EXACT same client setup.

** Troubleshooting
*** Important Slurm + LDAP Troubleshooting

This section explains one of the MOST common HPC setup issues.

*** Symptom

LDAP users:

- can SSH login
- can use su
- appear in getent passwd

BUT:

#+begin_src bash
sbatch submit.sh
#+end_src

results in:

- jobs stuck in pending
- BeginTime state
- scheduler instability
- sinfo hanging
- Slurm credential errors
- slurmctld crashes

*** Root Cause

Slurm internally works using:

- UID
- GID
- NSS identity resolution

When launching jobs, Slurm performs internal user identity lookups.

If master node cannot resolve LDAP users correctly through:

- NSS
- nslcd
- LDAP

then:

- Slurm credential generation fails
- scheduler may crash
- jobs cannot launch

Common error:

#+begin_example
_fill_cred_gids: getpwuid failed for uid=10001
#+end_example

Meaning:

#+begin_example
Slurm cannot resolve LDAP user identity correctly.
#+end_example

*** Important Verification Commands

Run on:

#+begin_example
master
login
compute nodes
#+end_example

Verify LDAP resolution:

#+begin_src bash
getent passwd testUser
id testUser
#+end_src

Expected:

#+begin_example
uid=10001(testUser) gid=10000(hpcusers)
#+end_example

These commands MUST work correctly on ALL cluster nodes.

*** Important Master Node Verification

The master node MUST also resolve LDAP users correctly.

Verify:

#+begin_src bash
getent passwd testUser
#+end_src

If master cannot resolve LDAP users:

- slurmctld may fail
- scheduler may crash
- jobs remain pending

Verify nslcd configuration on master:

#+begin_src bash
sudo vim /etc/nslcd.conf
#+end_src

Example:

#+begin_src conf
uid nslcd
gid ldap

uri ldap://master
base dc=hpc,dc=local
#+end_src

Verify NSS configuration:

#+begin_src bash
sudo vim /etc/nsswitch.conf
#+end_src

Ensure:

#+begin_src text
passwd: files ldap
group: files ldap
shadow: files ldap
#+end_src

Restart LDAP client:

#+begin_src bash
sudo systemctl restart nslcd
#+end_src

*** Important Slurm Architecture

Correct architecture:

| Node | Service |
|-------+----------|
| master | slurmctld |
| login | login services only |
| compute01 | slurmd |
| compute02 | slurmd |
| compute03 | slurmd |

IMPORTANT:

#+begin_example
Login node should NOT run slurmd.
#+end_example

Because login node is NOT configured as a compute node in:

#+begin_example
/etc/slurm/slurm.conf
#+end_example

Attempting to start slurmd on login gives:

#+begin_example
slurmd: fatal: Unable to determine this slurmd's NodeName
#+end_example

This is NORMAL and expected.

Correct action on login node:

#+begin_src bash
sudo systemctl stop slurmd
sudo systemctl disable slurmd
#+end_src

Expected afterward:

#+begin_example
inactive (dead)
#+end_example

This is CORRECT for login nodes.

*** Important Slurm Recovery Commands

Whenever:

- LDAP users are added
- NSS configuration changes
- PAM configuration changes
- nslcd configuration changes

restart Slurm services.

Restart controller on master:

#+begin_src bash
sudo systemctl restart slurmctld
#+end_src

Restart compute daemons on compute nodes:

#+begin_src bash
sudo systemctl restart slurmd
#+end_src

Restart LDAP client:

#+begin_src bash
sudo systemctl restart nslcd
#+end_src

Verify cluster:

#+begin_src bash
sinfo
#+end_src

Expected:

#+begin_example
debug* up infinite 3 idle compute[01-03]
#+end_example

