README.html
<div id="outline-container-orgef7d6dc" class="outline-3">
<h3 id="orgef7d6dc"><span class="section-number-3">14.26.</span> Configure PAM Authentication</h3>
<div class="outline-text-3" id="text-14-26">
<p>
Run ONLY on:
</p>

<pre class="example" id="orgf5ece25">
login
</pre>

<p>
Edit:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/pam.d/system-auth
</code></pre>
</div>

<p>
Add LDAP lines in appropriate sections.
</p>

<p>
Add in auth section:
</p>

<div class="org-src-container">
<pre class="src src-text"><code>auth        sufficient    pam_ldap.so use_first_pass
</code></pre>
</div>

<p>
Add in account section:
</p>

<div class="org-src-container">
<pre class="src src-text"><code>account     sufficient    pam_ldap.so
</code></pre>
</div>

<p>
Add in password section:
</p>

<div class="org-src-container">
<pre class="src src-text"><code>password    sufficient    pam_ldap.so use_authtok
</code></pre>
</div>

<p>
Add in session section:
</p>

<div class="org-src-container">
<pre class="src src-text"><code>session     optional      pam_ldap.so
session     optional      pam_mkhomedir.so
</code></pre>
</div>

<p>
Important:
</p>

<pre class="example" id="orged066fc">
Do NOT remove pam_unix.so lines.
</pre>
</div>
</div>
<div id="outline-container-orgceb1042" class="outline-3">
<h3 id="orgceb1042"><span class="section-number-3">14.27.</span> Configure Second PAM File</h3>
<div class="outline-text-3" id="text-14-27">
<p>
Run ONLY on:
</p>

<pre class="example" id="org68eca76">
login
</pre>

<p>
Edit:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/pam.d/password-auth
</code></pre>
</div>

<p>
Add SAME LDAP PAM lines.
</p>

<p>
Reason:
</p>

<pre class="example" id="org9dec8d2">
Different login methods use different PAM stacks.
</pre>
</div>
</div>
<div id="outline-container-orga7b1309" class="outline-3">
<h3 id="orga7b1309"><span class="section-number-3">14.28.</span> Restart Services</h3>
<div class="outline-text-3" id="text-14-28">
<p>
Run ONLY on:
</p>

<pre class="example" id="org3773e75">
login
</pre>

<p>
Restart services:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl restart nslcd
sudo systemctl restart oddjobd
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org4c772f9" class="outline-3">
<h3 id="org4c772f9"><span class="section-number-3">14.29.</span> Verify LDAP Authentication</h3>
<div class="outline-text-3" id="text-14-29">
<p>
Run ONLY on:
</p>

<pre class="example" id="org18adc14">
login
</pre>

<p>
Test login:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>su - testUser
</code></pre>
</div>

<p>
Enter LDAP password.
</p>

<p>
Expected:
</p>

<pre class="example" id="orgb1bf113">
Creating directory '/home/testUser'
</pre>

<p>
Successful login indicates:
</p>

<ul class="org-ul">
<li>LDAP authentication working</li>
<li>PAM integration working</li>
<li>automatic home directory creation working</li>
</ul>
</div>
</div>
<div id="outline-container-orgd4e7adc" class="outline-3">
<h3 id="orgd4e7adc"><span class="section-number-3">14.30.</span> Verify User Home</h3>
<div class="outline-text-3" id="text-14-30">
<p>
Run ONLY on:
</p>

<pre class="example" id="orgaadd332">
login
</pre>

<p>
After login:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>pwd
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orga71f475">
/home/testUser
</pre>
</div>
<ol class="org-ol">
<li><a id="org16938e5"></a>NOW WE MUST REPLICATE TO COMPUTE NODES<br />
<div class="outline-text-4" id="text-14-30-1">
<p>
Currently:
</p>

<pre class="example">
login node works fully
</pre>

<p>
Now we configure:
</p>

<ul class="org-ul">
<li>compute01</li>
<li>compute02</li>
<li>compute03</li>
</ul>

<p>
with EXACT same client setup.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgb7f925d" class="outline-3">
<h3 id="orgb7f925d"><span class="section-number-3">14.31.</span> Troubleshooting</h3>
<div class="outline-text-3" id="text-14-31">
</div>
<ol class="org-ol">
<li><a id="orga664817"></a>Important Slurm + LDAP Troubleshooting<br />
<div class="outline-text-4" id="text-14-31-1">
<p>
This section explains one of the MOST common HPC setup issues.
</p>
</div>
</li>
<li><a id="org949c146"></a>Symptom<br />
<div class="outline-text-4" id="text-14-31-2">
<p>
LDAP users:
</p>

<ul class="org-ul">
<li>can SSH login</li>
<li>can use su</li>
<li>appear in getent passwd</li>
</ul>

<p>
BUT:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sbatch submit.sh
</code></pre>
</div>

<p>
results in:
</p>

<ul class="org-ul">
<li>jobs stuck in pending</li>
<li>BeginTime state</li>
<li>scheduler instability</li>
<li>sinfo hanging</li>
<li>Slurm credential errors</li>
<li>slurmctld crashes</li>
</ul>
</div>
</li>
<li><a id="orgb4cedf2"></a>Root Cause<br />
<div class="outline-text-4" id="text-14-31-3">
<p>
Slurm internally works using:
</p>

<ul class="org-ul">
<li>UID</li>
<li>GID</li>
<li>NSS identity resolution</li>
</ul>

<p>
When launching jobs, Slurm performs internal user identity lookups.
</p>

<p>
If master node cannot resolve LDAP users correctly through:
</p>

<ul class="org-ul">
<li>NSS</li>
<li>nslcd</li>
<li>LDAP</li>
</ul>

<p>
then:
</p>

<ul class="org-ul">
<li>Slurm credential generation fails</li>
<li>scheduler may crash</li>
<li>jobs cannot launch</li>
</ul>

<p>
Common error:
</p>

<pre class="example" id="org4a6eee4">
_fill_cred_gids: getpwuid failed for uid=10001
</pre>

<p>
Meaning:
</p>

<pre class="example" id="orgd9c5adb">
Slurm cannot resolve LDAP user identity correctly.
</pre>
</div>
</li>
<li><a id="org9105214"></a>Important Verification Commands<br />
<div class="outline-text-4" id="text-14-31-4">
<p>
Run on:
</p>

<pre class="example" id="org63a61e9">
master
login
compute nodes
</pre>

<p>
Verify LDAP resolution:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>getent passwd testUser
id testUser
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org1784333">
uid=10001(testUser) gid=10000(hpcusers)
</pre>

<p>
These commands MUST work correctly on ALL cluster nodes.
</p>
</div>
</li>
<li><a id="org4e955b2"></a>Important Master Node Verification<br />
<div class="outline-text-4" id="text-14-31-5">
<p>
The master node MUST also resolve LDAP users correctly.
</p>

<p>
Verify:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>getent passwd testUser
</code></pre>
</div>

<p>
If master cannot resolve LDAP users:
</p>

<ul class="org-ul">
<li>slurmctld may fail</li>
<li>scheduler may crash</li>
<li>jobs remain pending</li>
</ul>

<p>
Verify nslcd configuration on master:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/nslcd.conf
</code></pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-conf"><code>uid nslcd
gid ldap

uri ldap://master
base dc=hpc,dc=local
</code></pre>
</div>

<p>
Verify NSS configuration:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/nsswitch.conf
</code></pre>
</div>

<p>
Ensure:
</p>

<div class="org-src-container">
<pre class="src src-text"><code>passwd: files ldap
group: files ldap
shadow: files ldap
</code></pre>
</div>

<p>
Restart LDAP client:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl restart nslcd
</code></pre>
</div>
</div>
</li>
<li><a id="org3109f55"></a>Important Slurm Architecture<br />
<div class="outline-text-4" id="text-14-31-6">
<p>
Correct architecture:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Node</th>
<th scope="col" class="org-left">Service</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">master</td>
<td class="org-left">slurmctld</td>
</tr>

<tr>
<td class="org-left">login</td>
<td class="org-left">login services only</td>
</tr>

<tr>
<td class="org-left">compute01</td>
<td class="org-left">slurmd</td>
</tr>

<tr>
<td class="org-left">compute02</td>
<td class="org-left">slurmd</td>
</tr>

<tr>
<td class="org-left">compute03</td>
<td class="org-left">slurmd</td>
</tr>
</tbody>
</table>

<p>
IMPORTANT:
</p>

<pre class="example" id="org0f8f025">
Login node should NOT run slurmd.
</pre>

<p>
Because login node is NOT configured as a compute node in:
</p>

<pre class="example" id="org113e33c">
/etc/slurm/slurm.conf
</pre>

<p>
Attempting to start slurmd on login gives:
</p>

<pre class="example" id="org2d3c7cb">
slurmd: fatal: Unable to determine this slurmd's NodeName
</pre>

<p>
This is NORMAL and expected.
</p>

<p>
Correct action on login node:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl stop slurmd
sudo systemctl disable slurmd
</code></pre>
</div>

<p>
Expected afterward:
</p>

<pre class="example" id="org56f280e">
inactive (dead)
</pre>

<p>
This is CORRECT for login nodes.
</p>
</div>
</li>
<li><a id="org7e8a524"></a>Important Slurm Recovery Commands<br />
<div class="outline-text-4" id="text-14-31-7">
<p>
Whenever:
</p>

<ul class="org-ul">
<li>LDAP users are added</li>
<li>NSS configuration changes</li>
<li>PAM configuration changes</li>
<li>nslcd configuration changes</li>
</ul>

<p>
restart Slurm services.
</p>

<p>
Restart controller on master:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl restart slurmctld
</code></pre>
</div>

<p>
Restart compute daemons on compute nodes:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl restart slurmd
</code></pre>
</div>

<p>
Restart LDAP client:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl restart nslcd
</code></pre>
</div>

<p>
Verify cluster:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sinfo
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgab35618">
debug* up infinite 3 idle compute[01-03]
</pre>
</div>
</li>
