README.org
*** Important Scheduler Debugging

If:

#+begin_src bash
sinfo
#+end_src

hangs indefinitely:

Possible cause:

#+begin_example
slurmctld crashed
#+end_example

Verify:

#+begin_src bash
systemctl status slurmctld
#+end_src

or:

#+begin_src bash
journalctl -u slurmctld -n 50
#+end_src
** Current Cluster State After LDAP Setup

Cluster now contains:

| Component | Status |
|------------+---------|
| OpenLDAP server | working |
| centralized users | working |
| centralized authentication | working |
| nslcd integration | working |
| NSS integration | working |
| PAM authentication | working |
| automatic home creation | working |

** Important Debugging Commands

Verify LDAP tree:

#+begin_src bash
ldapsearch -x -b "dc=hpc,dc=local"
#+end_src

Verify LDAP user:

#+begin_src bash
ldapsearch -x -b "dc=hpc,dc=local" uid=testUser
#+end_src

Verify LDAP authentication:

#+begin_src bash
ldapwhoami -x \
-D "uid=testUser,ou=People,dc=hpc,dc=local" \
-W \
-H ldap://master
#+end_src

Verify Linux user resolution:

#+begin_src bash
getent passwd testUser
#+end_src

Verify nslcd service:

#+begin_src bash
systemctl status nslcd
#+end_src

** Important Architecture Understanding

Master node:
- provides centralized identity database

Login/compute nodes:
- authenticate users
- resolve LDAP users
- create user sessions

This separation is fundamental in distributed authentication systems.

* Automated LDAP User Creation Script

Managing users manually using individual LDIF files becomes difficult
as the number of users increases.

To simplify user management, an automation script can be used to:

- create LDAP group
- create LDAP user
- generate password automatically
- generate password hash automatically
- add entries into LDAP

This script automates complete LDAP user creation.

IMPORTANT:

#+begin_example
The script creates:

- private group for user
- LDAP user entry
- hashed LDAP password

automatically.
#+end_example

** Script Location

Example:

#+begin_src bash
cd ~/ldap-scripts
ls
#+end_src

Expected:

#+begin_example
createUser.sh
#+end_example

** User Creation Script

Create file:

#+begin_src bash
vim createUser.sh
#+end_src

Paste the complete script exactly as shown below:

#+begin_src bash :tangle createUser.sh
#!/bin/bash 

LDAP_ADMIN="cn=Manager,dc=hpc,dc=local"
BASE_DN="dc=hpc,dc=local"

USERNAME=$1
UIDNUM=$2
GIDNUM=$3

if [ $# -ne 3 ]; then
    echo "Usage: $0 <username> <uid> <gid>"
    exit 1
fi

# Check if user already exists
USER_EXISTS=$(ldapsearch -x \
-b "ou=People,${BASE_DN}" "(uid=${USERNAME})" dn \
| grep "^dn:")

if [ ! -z "$USER_EXISTS" ]; then
    echo "ERROR: User ${USERNAME} already exists!"
    exit 1
fi

# Check if group already exists
GROUP_EXISTS=$(ldapsearch -x \
-b "ou=Groups,${BASE_DN}" "(cn=${USERNAME})" dn \
| grep "^dn:")

if [ ! -z "$GROUP_EXISTS" ]; then
    echo "ERROR: Group ${USERNAME} already exists!"
    exit 1
fi

PASSWORD="${USERNAME}@@123"

PASSWORD_HASH=$(slappasswd -s "$PASSWORD")

echo
echo "=================================="
echo "Creating LDAP User"
echo "=================================="
echo "Username : ${USERNAME}"
echo "UID      : ${UIDNUM}"
echo "GID      : ${GIDNUM}"
echo "=================================="

# Create private group LDIF
cat > /tmp/${USERNAME}_group.ldif <<EOF
dn: cn=${USERNAME},ou=Groups,${BASE_DN}
objectClass: posixGroup
cn: ${USERNAME}
gidNumber: ${GIDNUM}
EOF

# Create user LDIF
cat > /tmp/${USERNAME}.ldif <<EOF
dn: uid=${USERNAME},ou=People,${BASE_DN}
objectClass: inetOrgPerson
objectClass: posixAccount
objectClass: shadowAccount
cn: ${USERNAME}
sn: ${USERNAME}
uid: ${USERNAME}
uidNumber: ${UIDNUM}
gidNumber: ${GIDNUM}
homeDirectory: /home/${USERNAME}
loginShell: /bin/bash
userPassword: ${PASSWORD_HASH}
EOF

echo
echo "Adding LDAP group..."

ldapadd -x \
-D "${LDAP_ADMIN}" \
-W \
-f /tmp/${USERNAME}_group.ldif

if [ $? -ne 0 ]; then
    echo "ERROR: Failed to create LDAP group!"
    exit 1
fi

echo
echo "Adding LDAP user..."

ldapadd -x \
-D "${LDAP_ADMIN}" \
-W \
-f /tmp/${USERNAME}.ldif

if [ $? -ne 0 ]; then
    echo "ERROR: Failed to create LDAP user!"
    exit 1
fi

echo
echo "=================================="
echo "LDAP User Created Successfully"
echo "=================================="
echo "Username : ${USERNAME}"
echo "Password : ${PASSWORD}"
echo "UID      : ${UIDNUM}"
echo "GID      : ${GIDNUM}"
echo "=================================="
#+end_src

** Make Script Executable

Before using the script:

#+begin_src bash
chmod +x createUser.sh
#+end_src

** Understanding Script Arguments

The script requires THREE arguments:

| Argument | Meaning |
|-----------+----------|
| username | LDAP username |
| uid | UNIX UID |
| gid | UNIX GID |

Syntax:

#+begin_src bash
./createUser.sh <username> <uid> <gid>
#+end_src

Example:

#+begin_src bash
./createUser.sh student01 11001 11001
#+end_src

Explanation:

| Value | Meaning |
|--------+----------|
| student01 | username |
| 11001 | UID |
| 11001 | GID |

IMPORTANT:

#+begin_example
The script creates a private group automatically.

Therefore username and group name become identical.
#+end_example

Example:

| Entity | Created Automatically |
|---------+------------------------|
| User | student01 |
| Group | student01 |
| Home Directory | /home/student01 |

