README.html
<li><a id="org0c09da4"></a>Important Scheduler Debugging<br />
<div class="outline-text-4" id="text-14-31-8">
<p>
If:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sinfo
</code></pre>
</div>

<p>
hangs indefinitely:
</p>

<p>
Possible cause:
</p>

<pre class="example" id="orgfd171f1">
slurmctld crashed
</pre>

<p>
Verify:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>systemctl status slurmctld
</code></pre>
</div>

<p>
or:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>journalctl -u slurmctld -n 50
</code></pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgda55d7d" class="outline-3">
<h3 id="orgda55d7d"><span class="section-number-3">14.32.</span> Current Cluster State After LDAP Setup</h3>
<div class="outline-text-3" id="text-14-32">
<p>
Cluster now contains:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Component</th>
<th scope="col" class="org-left">Status</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">OpenLDAP server</td>
<td class="org-left">working</td>
</tr>

<tr>
<td class="org-left">centralized users</td>
<td class="org-left">working</td>
</tr>

<tr>
<td class="org-left">centralized authentication</td>
<td class="org-left">working</td>
</tr>

<tr>
<td class="org-left">nslcd integration</td>
<td class="org-left">working</td>
</tr>

<tr>
<td class="org-left">NSS integration</td>
<td class="org-left">working</td>
</tr>

<tr>
<td class="org-left">PAM authentication</td>
<td class="org-left">working</td>
</tr>

<tr>
<td class="org-left">automatic home creation</td>
<td class="org-left">working</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org20e5da0" class="outline-3">
<h3 id="org20e5da0"><span class="section-number-3">14.33.</span> Important Debugging Commands</h3>
<div class="outline-text-3" id="text-14-33">
<p>
Verify LDAP tree:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ldapsearch -x -b "dc=hpc,dc=local"
</code></pre>
</div>

<p>
Verify LDAP user:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ldapsearch -x -b "dc=hpc,dc=local" uid=testUser
</code></pre>
</div>

<p>
Verify LDAP authentication:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ldapwhoami -x \
-D "uid=testUser,ou=People,dc=hpc,dc=local" \
-W \
-H ldap://master
</code></pre>
</div>

<p>
Verify Linux user resolution:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>getent passwd testUser
</code></pre>
</div>

<p>
Verify nslcd service:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>systemctl status nslcd
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org54f1555" class="outline-3">
<h3 id="org54f1555"><span class="section-number-3">14.34.</span> Important Architecture Understanding</h3>
<div class="outline-text-3" id="text-14-34">
<p>
Master node:
</p>
<ul class="org-ul">
<li>provides centralized identity database</li>
</ul>

<p>
Login/compute nodes:
</p>
<ul class="org-ul">
<li>authenticate users</li>
<li>resolve LDAP users</li>
<li>create user sessions</li>
</ul>

<p>
This separation is fundamental in distributed authentication systems.
</p>
</div>
</div>
</div>
<div id="outline-container-org39793a3" class="outline-2">
<h2 id="org39793a3"><span class="section-number-2">15.</span> Automated LDAP User Creation Script</h2>
<div class="outline-text-2" id="text-15">
<p>
Managing users manually using individual LDIF files becomes difficult
as the number of users increases.
</p>

<p>
To simplify user management, an automation script can be used to:
</p>

<ul class="org-ul">
<li>create LDAP group</li>
<li>create LDAP user</li>
<li>generate password automatically</li>
<li>generate password hash automatically</li>
<li>add entries into LDAP</li>
</ul>

<p>
This script automates complete LDAP user creation.
</p>

<p>
IMPORTANT:
</p>

<pre class="example" id="orgab8ddcd">
The script creates:

- private group for user
- LDAP user entry
- hashed LDAP password

automatically.
</pre>
</div>
<div id="outline-container-orgad9c1d7" class="outline-3">
<h3 id="orgad9c1d7"><span class="section-number-3">15.1.</span> Script Location</h3>
<div class="outline-text-3" id="text-15-1">
<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>cd ~/ldap-scripts
ls
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org2255feb">
createUser.sh
</pre>
</div>
</div>
<div id="outline-container-orga5d4a57" class="outline-3">
<h3 id="orga5d4a57"><span class="section-number-3">15.2.</span> User Creation Script</h3>
<div class="outline-text-3" id="text-15-2">
<p>
Create file:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>vim createUser.sh
</code></pre>
</div>

<p>
Paste the complete script exactly as shown below:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>#!/bin/bash 

LDAP_ADMIN="cn=Manager,dc=hpc,dc=local"
BASE_DN="dc=hpc,dc=local"

USERNAME=$1
UIDNUM=$2
GIDNUM=$3

if [ $# -ne 3 ]; then
    echo "Usage: $0 &lt;username&gt; &lt;uid&gt; &lt;gid&gt;"
    exit 1
fi

# Check if user already exists
USER_EXISTS=$(ldapsearch -x \
-b "ou=People,${BASE_DN}" "(uid=${USERNAME})" dn \
| grep "^dn:")

if [ ! -z "$USER_EXISTS" ]; then
    echo "ERROR: User ${USERNAME} already exists!"
    exit 1
fi

# Check if group already exists
GROUP_EXISTS=$(ldapsearch -x \
-b "ou=Groups,${BASE_DN}" "(cn=${USERNAME})" dn \
| grep "^dn:")

if [ ! -z "$GROUP_EXISTS" ]; then
    echo "ERROR: Group ${USERNAME} already exists!"
    exit 1
fi

PASSWORD="${USERNAME}@@123"

PASSWORD_HASH=$(slappasswd -s "$PASSWORD")

echo
echo "=================================="
echo "Creating LDAP User"
echo "=================================="
echo "Username : ${USERNAME}"
echo "UID      : ${UIDNUM}"
echo "GID      : ${GIDNUM}"
echo "=================================="

# Create private group LDIF
cat &gt; /tmp/${USERNAME}_group.ldif &lt;&lt;EOF
dn: cn=${USERNAME},ou=Groups,${BASE_DN}
objectClass: posixGroup
cn: ${USERNAME}
gidNumber: ${GIDNUM}
EOF

# Create user LDIF
cat &gt; /tmp/${USERNAME}.ldif &lt;&lt;EOF
dn: uid=${USERNAME},ou=People,${BASE_DN}
objectClass: inetOrgPerson
objectClass: posixAccount
objectClass: shadowAccount
cn: ${USERNAME}
sn: ${USERNAME}
uid: ${USERNAME}
uidNumber: ${UIDNUM}
gidNumber: ${GIDNUM}
homeDirectory: /home/${USERNAME}
loginShell: /bin/bash
userPassword: ${PASSWORD_HASH}
EOF

echo
echo "Adding LDAP group..."

ldapadd -x \
-D "${LDAP_ADMIN}" \
-W \
-f /tmp/${USERNAME}_group.ldif

if [ $? -ne 0 ]; then
    echo "ERROR: Failed to create LDAP group!"
    exit 1
fi

echo
echo "Adding LDAP user..."

ldapadd -x \
-D "${LDAP_ADMIN}" \
-W \
-f /tmp/${USERNAME}.ldif

if [ $? -ne 0 ]; then
    echo "ERROR: Failed to create LDAP user!"
    exit 1
fi

echo
echo "=================================="
echo "LDAP User Created Successfully"
echo "=================================="
echo "Username : ${USERNAME}"
echo "Password : ${PASSWORD}"
echo "UID      : ${UIDNUM}"
echo "GID      : ${GIDNUM}"
echo "=================================="
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgab45c2c" class="outline-3">
<h3 id="orgab45c2c"><span class="section-number-3">15.3.</span> Make Script Executable</h3>
<div class="outline-text-3" id="text-15-3">
<p>
Before using the script:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>chmod +x createUser.sh
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org0a89f4e" class="outline-3">
<h3 id="org0a89f4e"><span class="section-number-3">15.4.</span> Understanding Script Arguments</h3>
<div class="outline-text-3" id="text-15-4">
<p>
The script requires THREE arguments:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Argument</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">username</td>
<td class="org-left">LDAP username</td>
</tr>

<tr>
<td class="org-left">uid</td>
<td class="org-left">UNIX UID</td>
</tr>

<tr>
<td class="org-left">gid</td>
<td class="org-left">UNIX GID</td>
</tr>
</tbody>
</table>

<p>
Syntax:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>./createUser.sh &lt;username&gt; &lt;uid&gt; &lt;gid&gt;
</code></pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>./createUser.sh student01 11001 11001
</code></pre>
</div>

<p>
Explanation:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Value</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">student01</td>
<td class="org-left">username</td>
</tr>

<tr>
<td class="org-right">11001</td>
<td class="org-left">UID</td>
</tr>

<tr>
<td class="org-right">11001</td>
<td class="org-left">GID</td>
</tr>
</tbody>
</table>

<p>
IMPORTANT:
</p>

<pre class="example" id="org00fd4b4">
The script creates a private group automatically.

Therefore username and group name become identical.
</pre>

<p>
Example:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Entity</th>
<th scope="col" class="org-left">Created Automatically</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">User</td>
<td class="org-left">student01</td>
</tr>

<tr>
<td class="org-left">Group</td>
<td class="org-left">student01</td>
</tr>

<tr>
<td class="org-left">Home Directory</td>
<td class="org-left">/home/student01</td>
</tr>
</tbody>
</table>
</div>
</div>
