README.org
** Default Password Format

The script automatically creates password using:

#+begin_example
username@@123
#+end_example

Example:

| Username | Password |
|-----------+-----------|
| student01 | student01@@123 |
| student02 | student02@@123 |

IMPORTANT:

#+begin_example
Users should change password after first login.
#+end_example

** What the Script Automatically Does

The script performs following operations automatically:

| Operation | Description |
|------------+--------------|
| Check existing user | avoids duplicate users |
| Check existing group | avoids duplicate groups |
| Generate password hash | secure LDAP password |
| Create LDAP group LDIF | automatic |
| Create LDAP user LDIF | automatic |
| Add LDAP group | automatic |
| Add LDAP user | automatic |

** Example User Creation

Example:

#+begin_src bash
./createUser.sh student02 11002 11002
#+end_src

Expected output:

#+begin_example
==================================
Creating LDAP User
==================================
Username : student02
UID      : 11002
GID      : 11002
==================================
#+end_example

LDAP admin password will be requested.

After successful creation:

#+begin_example
==================================
LDAP User Created Successfully
==================================
Username : student02
Password : student02@@123
UID      : 11002
GID      : 11002
==================================
#+end_example

** Verify User Creation

Verify user using:

#+begin_src bash
getent passwd student02
#+end_src

or:

#+begin_src bash
id student02
#+end_src

Expected:

#+begin_example
uid=11002(student02)
#+end_example

Verify LDAP entry:

#+begin_src bash
ldapsearch -x \
-b "dc=hpc,dc=local" uid=student02
#+end_src

** Verify Login

Test login:

#+begin_src bash
su - student02
#+end_src

or:

#+begin_src bash
ssh student02@login
#+end_src

Expected:

#+begin_example
successful login
#+end_example

** Important UID/GID Notes

IMPORTANT:

#+begin_example
UID and GID values must remain unique cluster-wide.
#+end_example

Avoid:
- duplicate UID
- duplicate GID

because duplicate IDs can create:

- ownership conflicts
- wrong usernames
- incorrect file ownership
- Slurm identity problems

Example of BAD configuration:

| User | UID |
|-------+-----|
| student01 | 11001 |
| student02 | 11001 |

This can cause:

#+begin_example
whoami returning wrong username
#+end_example

Always use unique UID/GID values.

** Important HPC Identity Concept

In HPC clusters:

- NFS
- Slurm
- MPI
- LDAP
- SSH

all depend on:

#+begin_example
consistent unique UID/GID mappings
#+end_example

across the entire cluster.

This is one of the MOST important concepts in centralized HPC authentication.

* Automated LDAP User Deletion Script

Managing users manually using:

- ldapdelete
- group deletion
- home directory cleanup

can become repetitive and error-prone.

To simplify cleanup operations, an automated LDAP deletion script can be used.

This script automates:

- LDAP user deletion
- optional LDAP group deletion
- optional home directory deletion

IMPORTANT:

#+begin_example
The script provides interactive cleanup options
for safer user management.
#+end_example

** Script Location

Example:

#+begin_src bash
cd ~/ldap-scripts
ls
#+end_src

Expected:

#+begin_example
deleteUser.sh
#+end_example

** User Deletion Script

Create file:

#+begin_src bash
vim deleteUser.sh
#+end_src

Paste the complete script exactly as shown below:

#+begin_src bash :tangle deleteUser.sh
#!/bin/bash 

LDAP_ADMIN="cn=Manager,dc=hpc,dc=local"
BASE_DN="dc=hpc,dc=local"

USERNAME=$1

if [ $# -ne 1 ]; then
    echo "Usage: $0 <username>"
    exit 1
fi

echo
echo "=================================="
echo "Deleting LDAP User"
echo "=================================="
echo "Username : ${USERNAME}"
echo "=================================="

echo
echo "Deleting LDAP user entry..."

ldapdelete -x \
-D "${LDAP_ADMIN}" \
-W \
"uid=${USERNAME},ou=People,${BASE_DN}"

if [ $? -ne 0 ]; then
    echo "ERROR: Failed to delete LDAP user!"
    exit 1
fi

echo
echo "LDAP user deleted successfully."

# Ask about deleting group
echo
read -p "Delete LDAP group '${USERNAME}'? (y/n): " DELETE_GROUP

case $DELETE_GROUP in
    y|Y)

        ldapdelete -x \
        -D "${LDAP_ADMIN}" \
        -W \
        "cn=${USERNAME},ou=Groups,${BASE_DN}"

        if [ $? -eq 0 ]; then
            echo "LDAP group deleted successfully."
        else
            echo "WARNING: Failed to delete LDAP group."
        fi
        ;;

    n|N)
        echo "Skipping LDAP group deletion."
        ;;

    *)
        echo "Invalid option. Skipping group deletion."
        ;;
esac

# Ask about deleting home directory
echo
read -p "Delete home directory '/home/${USERNAME}'? (y/n): " DELETE_HOME

case $DELETE_HOME in
    y|Y)

        if [ -d "/home/${USERNAME}" ]; then
            sudo rm -rf "/home/${USERNAME}"

            if [ $? -eq 0 ]; then
                echo "Home directory deleted successfully."
            else
                echo "WARNING: Failed to delete home directory."
            fi
        else
            echo "Home directory does not exist."
        fi
        ;;

    n|N)
        echo "Skipping home directory deletion."
        ;;

    *)
        echo "Invalid option. Skipping home deletion."
        ;;
esac

echo
echo "=================================="
echo "User cleanup completed"
echo "=================================="
#+end_src

** Make Script Executable

Before using the script:

#+begin_src bash
chmod +x deleteUser.sh
#+end_src

