README.html
<div id="outline-container-org7701444" class="outline-3">
<h3 id="org7701444"><span class="section-number-3">15.5.</span> Default Password Format</h3>
<div class="outline-text-3" id="text-15-5">
<p>
The script automatically creates password using:
</p>

<pre class="example" id="orgc455f3a">
username@@123
</pre>

<p>
Example:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Username</th>
<th scope="col" class="org-left">Password</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">student01</td>
<td class="org-left">student01@@123</td>
</tr>

<tr>
<td class="org-left">student02</td>
<td class="org-left">student02@@123</td>
</tr>
</tbody>
</table>

<p>
IMPORTANT:
</p>

<pre class="example" id="orgf591850">
Users should change password after first login.
</pre>
</div>
</div>
<div id="outline-container-org7c95d58" class="outline-3">
<h3 id="org7c95d58"><span class="section-number-3">15.6.</span> What the Script Automatically Does</h3>
<div class="outline-text-3" id="text-15-6">
<p>
The script performs following operations automatically:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operation</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Check existing user</td>
<td class="org-left">avoids duplicate users</td>
</tr>

<tr>
<td class="org-left">Check existing group</td>
<td class="org-left">avoids duplicate groups</td>
</tr>

<tr>
<td class="org-left">Generate password hash</td>
<td class="org-left">secure LDAP password</td>
</tr>

<tr>
<td class="org-left">Create LDAP group LDIF</td>
<td class="org-left">automatic</td>
</tr>

<tr>
<td class="org-left">Create LDAP user LDIF</td>
<td class="org-left">automatic</td>
</tr>

<tr>
<td class="org-left">Add LDAP group</td>
<td class="org-left">automatic</td>
</tr>

<tr>
<td class="org-left">Add LDAP user</td>
<td class="org-left">automatic</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org0175d6f" class="outline-3">
<h3 id="org0175d6f"><span class="section-number-3">15.7.</span> Example User Creation</h3>
<div class="outline-text-3" id="text-15-7">
<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>./createUser.sh student02 11002 11002
</code></pre>
</div>

<p>
Expected output:
</p>

<pre class="example" id="org356b87e">
==================================
Creating LDAP User
==================================
Username : student02
UID      : 11002
GID      : 11002
==================================
</pre>

<p>
LDAP admin password will be requested.
</p>

<p>
After successful creation:
</p>

<pre class="example" id="org2c3b37f">
==================================
LDAP User Created Successfully
==================================
Username : student02
Password : student02@@123
UID      : 11002
GID      : 11002
==================================
</pre>
</div>
</div>
<div id="outline-container-org4c50915" class="outline-3">
<h3 id="org4c50915"><span class="section-number-3">15.8.</span> Verify User Creation</h3>
<div class="outline-text-3" id="text-15-8">
<p>
Verify user using:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>getent passwd student02
</code></pre>
</div>

<p>
or:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>id student02
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org08adc00">
uid=11002(student02)
</pre>

<p>
Verify LDAP entry:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ldapsearch -x \
-b "dc=hpc,dc=local" uid=student02
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org3e1b4be" class="outline-3">
<h3 id="org3e1b4be"><span class="section-number-3">15.9.</span> Verify Login</h3>
<div class="outline-text-3" id="text-15-9">
<p>
Test login:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>su - student02
</code></pre>
</div>

<p>
or:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ssh student02@login
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org8cfec7f">
successful login
</pre>
</div>
</div>
<div id="outline-container-orgd2b701e" class="outline-3">
<h3 id="orgd2b701e"><span class="section-number-3">15.10.</span> Important UID/GID Notes</h3>
<div class="outline-text-3" id="text-15-10">
<p>
IMPORTANT:
</p>

<pre class="example" id="org29c727e">
UID and GID values must remain unique cluster-wide.
</pre>

<p>
Avoid:
</p>
<ul class="org-ul">
<li>duplicate UID</li>
<li>duplicate GID</li>
</ul>

<p>
because duplicate IDs can create:
</p>

<ul class="org-ul">
<li>ownership conflicts</li>
<li>wrong usernames</li>
<li>incorrect file ownership</li>
<li>Slurm identity problems</li>
</ul>

<p>
Example of BAD configuration:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">User</th>
<th scope="col" class="org-right">UID</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">student01</td>
<td class="org-right">11001</td>
</tr>

<tr>
<td class="org-left">student02</td>
<td class="org-right">11001</td>
</tr>
</tbody>
</table>

<p>
This can cause:
</p>

<pre class="example" id="org9082219">
whoami returning wrong username
</pre>

<p>
Always use unique UID/GID values.
</p>
</div>
</div>
<div id="outline-container-org3a2c568" class="outline-3">
<h3 id="org3a2c568"><span class="section-number-3">15.11.</span> Important HPC Identity Concept</h3>
<div class="outline-text-3" id="text-15-11">
<p>
In HPC clusters:
</p>

<ul class="org-ul">
<li>NFS</li>
<li>Slurm</li>
<li>MPI</li>
<li>LDAP</li>
<li>SSH</li>
</ul>

<p>
all depend on:
</p>

<pre class="example" id="orgda799b3">
consistent unique UID/GID mappings
</pre>

<p>
across the entire cluster.
</p>

<p>
This is one of the MOST important concepts in centralized HPC authentication.
</p>
</div>
</div>
</div>
<div id="outline-container-orgbc0a4b4" class="outline-2">
<h2 id="orgbc0a4b4"><span class="section-number-2">16.</span> Automated LDAP User Deletion Script</h2>
<div class="outline-text-2" id="text-16">
<p>
Managing users manually using:
</p>

<ul class="org-ul">
<li>ldapdelete</li>
<li>group deletion</li>
<li>home directory cleanup</li>
</ul>

<p>
can become repetitive and error-prone.
</p>

<p>
To simplify cleanup operations, an automated LDAP deletion script can be used.
</p>

<p>
This script automates:
</p>

<ul class="org-ul">
<li>LDAP user deletion</li>
<li>optional LDAP group deletion</li>
<li>optional home directory deletion</li>
</ul>

<p>
IMPORTANT:
</p>

<pre class="example" id="orgb46431a">
The script provides interactive cleanup options
for safer user management.
</pre>
</div>
<div id="outline-container-orgcd82b2f" class="outline-3">
<h3 id="orgcd82b2f"><span class="section-number-3">16.1.</span> Script Location</h3>
<div class="outline-text-3" id="text-16-1">
<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>cd ~/ldap-scripts
ls
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgf5308b4">
deleteUser.sh
</pre>
</div>
</div>
<div id="outline-container-org8fda461" class="outline-3">
<h3 id="org8fda461"><span class="section-number-3">16.2.</span> User Deletion Script</h3>
<div class="outline-text-3" id="text-16-2">
<p>
Create file:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>vim deleteUser.sh
</code></pre>
</div>

<p>
Paste the complete script exactly as shown below:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>#!/bin/bash 

LDAP_ADMIN="cn=Manager,dc=hpc,dc=local"
BASE_DN="dc=hpc,dc=local"

USERNAME=$1

if [ $# -ne 1 ]; then
    echo "Usage: $0 &lt;username&gt;"
    exit 1
fi

echo
echo "=================================="
echo "Deleting LDAP User"
echo "=================================="
echo "Username : ${USERNAME}"
echo "=================================="

echo
echo "Deleting LDAP user entry..."

ldapdelete -x \
-D "${LDAP_ADMIN}" \
-W \
"uid=${USERNAME},ou=People,${BASE_DN}"

if [ $? -ne 0 ]; then
    echo "ERROR: Failed to delete LDAP user!"
    exit 1
fi

echo
echo "LDAP user deleted successfully."

# Ask about deleting group
echo
read -p "Delete LDAP group '${USERNAME}'? (y/n): " DELETE_GROUP

case $DELETE_GROUP in
    y|Y)

        ldapdelete -x \
        -D "${LDAP_ADMIN}" \
        -W \
        "cn=${USERNAME},ou=Groups,${BASE_DN}"

        if [ $? -eq 0 ]; then
            echo "LDAP group deleted successfully."
        else
            echo "WARNING: Failed to delete LDAP group."
        fi
        ;;

    n|N)
        echo "Skipping LDAP group deletion."
        ;;

    *)
        echo "Invalid option. Skipping group deletion."
        ;;
esac

# Ask about deleting home directory
echo
read -p "Delete home directory '/home/${USERNAME}'? (y/n): " DELETE_HOME

case $DELETE_HOME in
    y|Y)

        if [ -d "/home/${USERNAME}" ]; then
            sudo rm -rf "/home/${USERNAME}"

            if [ $? -eq 0 ]; then
                echo "Home directory deleted successfully."
            else
                echo "WARNING: Failed to delete home directory."
            fi
        else
            echo "Home directory does not exist."
        fi
        ;;

    n|N)
        echo "Skipping home directory deletion."
        ;;

    *)
        echo "Invalid option. Skipping home deletion."
        ;;
esac

echo
echo "=================================="
echo "User cleanup completed"
echo "=================================="
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org15e57fb" class="outline-3">
<h3 id="org15e57fb"><span class="section-number-3">16.3.</span> Make Script Executable</h3>
<div class="outline-text-3" id="text-16-3">
<p>
Before using the script:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>chmod +x deleteUser.sh
</code></pre>
</div>
</div>
</div>
