README.org
** Understanding Script Arguments

The script requires ONE argument:

| Argument | Meaning |
|-----------+----------|
| username | LDAP username |

Syntax:

#+begin_src bash
./deleteUser.sh <username>
#+end_src

Example:

#+begin_src bash
./deleteUser.sh student02
#+end_src

** What the Script Automatically Does

The script performs following operations automatically:

| Operation | Description |
|------------+--------------|
| Delete LDAP user | removes LDAP account |
| Optional group deletion | removes LDAP group if requested |
| Optional home deletion | removes user home if requested |
| Interactive confirmation | prevents accidental cleanup |

** Example User Deletion

Example:

#+begin_src bash
./deleteUser.sh student02
#+end_src

Expected output:

#+begin_example
==================================
Deleting LDAP User
==================================
Username : student02
==================================
#+end_example

LDAP admin password will be requested.

After successful deletion:

#+begin_example
LDAP user deleted successfully.
#+end_example

The script then asks:

#+begin_example
Delete LDAP group 'student02'? (y/n):
#+end_example

If:

#+begin_example
y
#+end_example

is selected, corresponding LDAP group will also be removed.

Next prompt:

#+begin_example
Delete home directory '/home/student02'? (y/n):
#+end_example

If:

#+begin_example
y
#+end_example

is selected, user home directory will also be deleted.

** Important Group Deletion Notes

IMPORTANT:

#+begin_example
Do NOT delete shared groups accidentally.
#+end_example

Example:

#+begin_example
hpcusers
#+end_example

may contain multiple users.

Deleting shared groups can create:

- broken group mappings
- permission problems
- Slurm identity issues

The script therefore asks confirmation before deleting groups.

** Important Home Directory Notes

Deleting home directories permanently removes:

- source codes
- job scripts
- outputs
- datasets
- SSH keys
- configuration files

IMPORTANT:

#+begin_example
Home directory deletion is irreversible.
#+end_example

Always verify before deleting.

** Verify User Removal

Verify deletion:

#+begin_src bash
getent passwd student02
#+end_src

Expected:

#+begin_example
no output
#+end_example

Verify LDAP entry removal:

#+begin_src bash
ldapsearch -x \
-b "dc=hpc,dc=local" uid=student02
#+end_src

Expected:

#+begin_example
no entries returned
#+end_example

Verify login failure:

#+begin_src bash
su - student02
#+end_src

Expected:

#+begin_example
user does not exist
#+end_example

** Important HPC User Management Concept

In centralized HPC environments:

- user lifecycle management
- account cleanup
- UID/GID consistency
- group management

are critical administrative tasks.

Improper deletion can create:

- orphaned files
- broken permissions
- Slurm scheduling issues
- incorrect ownership mappings

Therefore automated and controlled cleanup procedures are highly important in production HPC systems.

* Automated LDAP Password Change Script

Managing passwords manually using LDIF files becomes inconvenient
in centralized LDAP environments.

To simplify password management, an automated password change script
can be used.

This script automates:

- LDAP password update
- password hash generation
- secure password input
- LDAP password modification

IMPORTANT:

#+begin_example
Because authentication is centralized through LDAP,
password changes automatically work cluster-wide.
#+end_example

After changing password:

- login node recognizes new password
- compute nodes recognize new password
- master recognizes new password

without changing anything individually on nodes.

** Script Location

Example:

#+begin_src bash
cd ~/ldap-scripts
ls
#+end_src

Expected:

#+begin_example
changePassword.sh
#+end_example

** Password Change Script

Create file:

#+begin_src bash
vim changePassword.sh
#+end_src

Paste the complete script exactly as shown below:

#+begin_src bash :tangle changePassword.sh
#!/bin/bash

LDAP_ADMIN="cn=Manager,dc=hpc,dc=local"
BASE_DN="dc=hpc,dc=local"

USERNAME=$1

if [ $# -ne 1 ]; then
    echo "Usage: $0 <username>"
    exit 1
fi

# Check if user exists
USER_EXISTS=$(ldapsearch -x \
-b "ou=People,${BASE_DN}" "(uid=${USERNAME})" dn \
| grep "^dn:")

if [ -z "$USER_EXISTS" ]; then
    echo "ERROR: User ${USERNAME} does not exist!"
    exit 1
fi

echo
echo "=================================="
echo "LDAP Password Change"
echo "=================================="
echo "Username : ${USERNAME}"
echo "=================================="

# Take password securely
echo
read -s -p "Enter new password: " PASSWORD1
echo

read -s -p "Confirm new password: " PASSWORD2
echo

# Check password match
if [ "$PASSWORD1" != "$PASSWORD2" ]; then
    echo
    echo "ERROR: Passwords do not match!"
    exit 1
fi

# Generate LDAP password hash
PASSWORD_HASH=$(slappasswd -s "$PASSWORD1")

# Create LDIF file
cat > /tmp/${USERNAME}_password.ldif <<EOF
dn: uid=${USERNAME},ou=People,${BASE_DN}
changetype: modify
replace: userPassword
userPassword: ${PASSWORD_HASH}
EOF

echo
echo "Updating LDAP password..."

ldapmodify -x \
-D "${LDAP_ADMIN}" \
-W \
-f /tmp/${USERNAME}_password.ldif

if [ $? -ne 0 ]; then
    echo
    echo "ERROR: Failed to change password!"
    exit 1
fi

echo
echo "=================================="
echo "Password updated successfully"
echo "=================================="
echo "Username : ${USERNAME}"
echo "=================================="
#+end_src

** Make Script Executable

Before using the script:

#+begin_src bash
chmod +x changePassword.sh
#+end_src

