README.html
<div id="outline-container-orgc03d786" class="outline-3">
<h3 id="orgc03d786"><span class="section-number-3">16.4.</span> Understanding Script Arguments</h3>
<div class="outline-text-3" id="text-16-4">
<p>
The script requires ONE argument:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Argument</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">username</td>
<td class="org-left">LDAP username</td>
</tr>
</tbody>
</table>

<p>
Syntax:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>./deleteUser.sh &lt;username&gt;
</code></pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>./deleteUser.sh student02
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orge85f01e" class="outline-3">
<h3 id="orge85f01e"><span class="section-number-3">16.5.</span> What the Script Automatically Does</h3>
<div class="outline-text-3" id="text-16-5">
<p>
The script performs following operations automatically:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operation</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Delete LDAP user</td>
<td class="org-left">removes LDAP account</td>
</tr>

<tr>
<td class="org-left">Optional group deletion</td>
<td class="org-left">removes LDAP group if requested</td>
</tr>

<tr>
<td class="org-left">Optional home deletion</td>
<td class="org-left">removes user home if requested</td>
</tr>

<tr>
<td class="org-left">Interactive confirmation</td>
<td class="org-left">prevents accidental cleanup</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org6399b43" class="outline-3">
<h3 id="org6399b43"><span class="section-number-3">16.6.</span> Example User Deletion</h3>
<div class="outline-text-3" id="text-16-6">
<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>./deleteUser.sh student02
</code></pre>
</div>

<p>
Expected output:
</p>

<pre class="example" id="orgaecfb7c">
==================================
Deleting LDAP User
==================================
Username : student02
==================================
</pre>

<p>
LDAP admin password will be requested.
</p>

<p>
After successful deletion:
</p>

<pre class="example" id="orgb6cf347">
LDAP user deleted successfully.
</pre>

<p>
The script then asks:
</p>

<pre class="example" id="org757ea83">
Delete LDAP group 'student02'? (y/n):
</pre>

<p>
If:
</p>

<pre class="example" id="orgc3e19a8">
y
</pre>

<p>
is selected, corresponding LDAP group will also be removed.
</p>

<p>
Next prompt:
</p>

<pre class="example" id="orgc111588">
Delete home directory '/home/student02'? (y/n):
</pre>

<p>
If:
</p>

<pre class="example" id="org567af00">
y
</pre>

<p>
is selected, user home directory will also be deleted.
</p>
</div>
</div>
<div id="outline-container-org4f486d5" class="outline-3">
<h3 id="org4f486d5"><span class="section-number-3">16.7.</span> Important Group Deletion Notes</h3>
<div class="outline-text-3" id="text-16-7">
<p>
IMPORTANT:
</p>

<pre class="example" id="orgfa7a9ea">
Do NOT delete shared groups accidentally.
</pre>

<p>
Example:
</p>

<pre class="example" id="orgead1980">
hpcusers
</pre>

<p>
may contain multiple users.
</p>

<p>
Deleting shared groups can create:
</p>

<ul class="org-ul">
<li>broken group mappings</li>
<li>permission problems</li>
<li>Slurm identity issues</li>
</ul>

<p>
The script therefore asks confirmation before deleting groups.
</p>
</div>
</div>
<div id="outline-container-org09c97e8" class="outline-3">
<h3 id="org09c97e8"><span class="section-number-3">16.8.</span> Important Home Directory Notes</h3>
<div class="outline-text-3" id="text-16-8">
<p>
Deleting home directories permanently removes:
</p>

<ul class="org-ul">
<li>source codes</li>
<li>job scripts</li>
<li>outputs</li>
<li>datasets</li>
<li>SSH keys</li>
<li>configuration files</li>
</ul>

<p>
IMPORTANT:
</p>

<pre class="example" id="orge3b2c3d">
Home directory deletion is irreversible.
</pre>

<p>
Always verify before deleting.
</p>
</div>
</div>
<div id="outline-container-org92c99da" class="outline-3">
<h3 id="org92c99da"><span class="section-number-3">16.9.</span> Verify User Removal</h3>
<div class="outline-text-3" id="text-16-9">
<p>
Verify deletion:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>getent passwd student02
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgfac03c9">
no output
</pre>

<p>
Verify LDAP entry removal:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ldapsearch -x \
-b "dc=hpc,dc=local" uid=student02
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org4dfa793">
no entries returned
</pre>

<p>
Verify login failure:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>su - student02
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org16ae68a">
user does not exist
</pre>
</div>
</div>
<div id="outline-container-org06363a9" class="outline-3">
<h3 id="org06363a9"><span class="section-number-3">16.10.</span> Important HPC User Management Concept</h3>
<div class="outline-text-3" id="text-16-10">
<p>
In centralized HPC environments:
</p>

<ul class="org-ul">
<li>user lifecycle management</li>
<li>account cleanup</li>
<li>UID/GID consistency</li>
<li>group management</li>
</ul>

<p>
are critical administrative tasks.
</p>

<p>
Improper deletion can create:
</p>

<ul class="org-ul">
<li>orphaned files</li>
<li>broken permissions</li>
<li>Slurm scheduling issues</li>
<li>incorrect ownership mappings</li>
</ul>

<p>
Therefore automated and controlled cleanup procedures are highly important in production HPC systems.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf889003" class="outline-2">
<h2 id="orgf889003"><span class="section-number-2">17.</span> Automated LDAP Password Change Script</h2>
<div class="outline-text-2" id="text-17">
<p>
Managing passwords manually using LDIF files becomes inconvenient
in centralized LDAP environments.
</p>

<p>
To simplify password management, an automated password change script
can be used.
</p>

<p>
This script automates:
</p>

<ul class="org-ul">
<li>LDAP password update</li>
<li>password hash generation</li>
<li>secure password input</li>
<li>LDAP password modification</li>
</ul>

<p>
IMPORTANT:
</p>

<pre class="example" id="org0da252a">
Because authentication is centralized through LDAP,
password changes automatically work cluster-wide.
</pre>

<p>
After changing password:
</p>

<ul class="org-ul">
<li>login node recognizes new password</li>
<li>compute nodes recognize new password</li>
<li>master recognizes new password</li>
</ul>

<p>
without changing anything individually on nodes.
</p>
</div>
<div id="outline-container-org896cbf9" class="outline-3">
<h3 id="org896cbf9"><span class="section-number-3">17.1.</span> Script Location</h3>
<div class="outline-text-3" id="text-17-1">
<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>cd ~/ldap-scripts
ls
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org7cbf88b">
changePassword.sh
</pre>
</div>
</div>
<div id="outline-container-org5593364" class="outline-3">
<h3 id="org5593364"><span class="section-number-3">17.2.</span> Password Change Script</h3>
<div class="outline-text-3" id="text-17-2">
<p>
Create file:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>vim changePassword.sh
</code></pre>
</div>

<p>
Paste the complete script exactly as shown below:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>#!/bin/bash

LDAP_ADMIN="cn=Manager,dc=hpc,dc=local"
BASE_DN="dc=hpc,dc=local"

USERNAME=$1

if [ $# -ne 1 ]; then
    echo "Usage: $0 &lt;username&gt;"
    exit 1
fi

# Check if user exists
USER_EXISTS=$(ldapsearch -x \
-b "ou=People,${BASE_DN}" "(uid=${USERNAME})" dn \
| grep "^dn:")

if [ -z "$USER_EXISTS" ]; then
    echo "ERROR: User ${USERNAME} does not exist!"
    exit 1
fi

echo
echo "=================================="
echo "LDAP Password Change"
echo "=================================="
echo "Username : ${USERNAME}"
echo "=================================="

# Take password securely
echo
read -s -p "Enter new password: " PASSWORD1
echo

read -s -p "Confirm new password: " PASSWORD2
echo

# Check password match
if [ "$PASSWORD1" != "$PASSWORD2" ]; then
    echo
    echo "ERROR: Passwords do not match!"
    exit 1
fi

# Generate LDAP password hash
PASSWORD_HASH=$(slappasswd -s "$PASSWORD1")

# Create LDIF file
cat &gt; /tmp/${USERNAME}_password.ldif &lt;&lt;EOF
dn: uid=${USERNAME},ou=People,${BASE_DN}
changetype: modify
replace: userPassword
userPassword: ${PASSWORD_HASH}
EOF

echo
echo "Updating LDAP password..."

ldapmodify -x \
-D "${LDAP_ADMIN}" \
-W \
-f /tmp/${USERNAME}_password.ldif

if [ $? -ne 0 ]; then
    echo
    echo "ERROR: Failed to change password!"
    exit 1
fi

echo
echo "=================================="
echo "Password updated successfully"
echo "=================================="
echo "Username : ${USERNAME}"
echo "=================================="
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org8f7d525" class="outline-3">
<h3 id="org8f7d525"><span class="section-number-3">17.3.</span> Make Script Executable</h3>
<div class="outline-text-3" id="text-17-3">
<p>
Before using the script:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>chmod +x changePassword.sh
</code></pre>
</div>
</div>
</div>
