README.org
** Understanding Script Arguments

The script requires ONE argument:

| Argument | Meaning |
|-----------+----------|
| username | LDAP username |

Syntax:

#+begin_src bash
./changePassword.sh <username>
#+end_src

Example:

#+begin_src bash
./changePassword.sh student01
#+end_src

** What the Script Automatically Does

The script performs following operations automatically:

| Operation | Description |
|------------+--------------|
| Verify LDAP user exists | prevents invalid modifications |
| Secure password input | password hidden during typing |
| Password confirmation | avoids typing mistakes |
| Generate password hash | secure LDAP password storage |
| Modify LDAP password | centralized password update |

** Example Password Change

Example:

#+begin_src bash
./changePassword.sh student01
#+end_src

Expected output:

#+begin_example
==================================
LDAP Password Change
==================================
Username : student01
==================================
#+end_example

The script asks:

#+begin_example
Enter new password:
#+end_example

Then:

#+begin_example
Confirm new password:
#+end_example

LDAP admin password will also be requested.

After successful update:

#+begin_example
==================================
Password updated successfully
==================================
Username : student01
==================================
#+end_example

** Verify Password Change

Test login using updated password:

#+begin_src bash
su - student01
#+end_src

or:

#+begin_src bash
ssh student01@login
#+end_src

Expected:

#+begin_example
successful login using new password
#+end_example

Because LDAP authentication is centralized, the updated password works automatically on:

- login node
- compute nodes
- master node

** Important Password Management Notes

IMPORTANT:

#+begin_example
LDAP stores password hashes, not plain-text passwords.
#+end_example

The script automatically generates secure LDAP-compatible password hashes using:

#+begin_src bash
slappasswd
#+end_src

This improves security by avoiding direct plain-text password storage.
* Advanced Slurm Configuration Preparation

This phase marks the transition from a:

#+begin_example
basic educational Slurm setup
#+end_example

to a more:

#+begin_example
resource-aware and production-like HPC scheduler environment
#+end_example

At this stage, the cluster was already fully functional and stable.

Existing working components:

- Slurm scheduler
- sbatch job submission
- MPI execution
- multinode MPI jobs
- LDAP centralized authentication
- shared filesystem
- shared Spack software stack

The goal of this phase was to carefully introduce advanced scheduler
features WITHOUT destabilizing runtime execution.

** IMPORTANT APPROACH

Advanced Slurm administration should always be performed incrementally.

Instead of enabling many advanced features simultaneously, only ONE
feature was introduced and validated at a time.

This approach helps:

- isolate issues properly
- simplify debugging
- understand scheduler behavior
- maintain cluster stability

This is how production HPC administrators commonly manage scheduler
configuration changes.

** Advanced Slurm Roadmap

The cluster was upgraded gradually in the following order:

| Phase | Feature | Risk Level |
|-------+----------+-------------|
| 1 | Resource Accounting | Safe |
| 2 | Memory-Aware Scheduling | Safe |
| 3 | CPU Binding / Affinity | Safe |
| 4 | Job Limits | Safe |
| 5 | QoS | Medium |
| 6 | Accounts & Fairshare | Medium |
| 7 | Reservations | Medium |
| 8 | Advanced Scheduling Policies | Medium |
| 9 | cgroups/task/cgroup | Advanced |
| 10 | Monitoring & Metrics | Advanced |

*** IMPORTANT NOTE

At this stage:

#+begin_example
TaskPlugin=task/cgroup
#+end_example

was intentionally NOT enabled.

Reason:

Strict cgroup enforcement can introduce runtime instability,
especially on:

- Rocky Linux 9
- cgroup v2 systems
- educational clusters

Instead, the cluster first focused on:

- stable scheduling
- resource accounting
- affinity scheduling
- scheduler-aware resource tracking

before moving toward strict kernel-level enforcement.

** Resource-Aware Scheduling

Goal:

Teach Slurm to understand:

- CPU resources
- memory resources
- consumable resources
- schedulable resources

without enabling strict runtime enforcement.

This creates a much safer and more stable intermediate scheduler state.

** Understanding Current Cluster Resource State

Initial scheduler behavior:

- node-aware scheduling
- CPU-aware scheduling

BUT:

Slurm did NOT properly understand actual node memory capacity.

This can be verified using:

#+begin_src bash
scontrol show node compute01
#+end_src

Without:

#+begin_example
RealMemory
#+end_example

configured, Slurm cannot properly perform memory-aware scheduling.

