README.html
<div id="outline-container-orgef8ce20" class="outline-3">
<h3 id="orgef8ce20"><span class="section-number-3">17.4.</span> Understanding Script Arguments</h3>
<div class="outline-text-3" id="text-17-4">
<p>
The script requires ONE argument:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Argument</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">username</td>
<td class="org-left">LDAP username</td>
</tr>
</tbody>
</table>

<p>
Syntax:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>./changePassword.sh &lt;username&gt;
</code></pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>./changePassword.sh student01
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgaba22e6" class="outline-3">
<h3 id="orgaba22e6"><span class="section-number-3">17.5.</span> What the Script Automatically Does</h3>
<div class="outline-text-3" id="text-17-5">
<p>
The script performs following operations automatically:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operation</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Verify LDAP user exists</td>
<td class="org-left">prevents invalid modifications</td>
</tr>

<tr>
<td class="org-left">Secure password input</td>
<td class="org-left">password hidden during typing</td>
</tr>

<tr>
<td class="org-left">Password confirmation</td>
<td class="org-left">avoids typing mistakes</td>
</tr>

<tr>
<td class="org-left">Generate password hash</td>
<td class="org-left">secure LDAP password storage</td>
</tr>

<tr>
<td class="org-left">Modify LDAP password</td>
<td class="org-left">centralized password update</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgea30425" class="outline-3">
<h3 id="orgea30425"><span class="section-number-3">17.6.</span> Example Password Change</h3>
<div class="outline-text-3" id="text-17-6">
<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>./changePassword.sh student01
</code></pre>
</div>

<p>
Expected output:
</p>

<pre class="example" id="orga90a5b0">
==================================
LDAP Password Change
==================================
Username : student01
==================================
</pre>

<p>
The script asks:
</p>

<pre class="example" id="org5ead430">
Enter new password:
</pre>

<p>
Then:
</p>

<pre class="example" id="org4c3aa14">
Confirm new password:
</pre>

<p>
LDAP admin password will also be requested.
</p>

<p>
After successful update:
</p>

<pre class="example" id="orgaee7278">
==================================
Password updated successfully
==================================
Username : student01
==================================
</pre>
</div>
</div>
<div id="outline-container-org4096e10" class="outline-3">
<h3 id="org4096e10"><span class="section-number-3">17.7.</span> Verify Password Change</h3>
<div class="outline-text-3" id="text-17-7">
<p>
Test login using updated password:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>su - student01
</code></pre>
</div>

<p>
or:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ssh student01@login
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgc9ceb62">
successful login using new password
</pre>

<p>
Because LDAP authentication is centralized, the updated password works automatically on:
</p>

<ul class="org-ul">
<li>login node</li>
<li>compute nodes</li>
<li>master node</li>
</ul>
</div>
</div>
<div id="outline-container-orga805e97" class="outline-3">
<h3 id="orga805e97"><span class="section-number-3">17.8.</span> Important Password Management Notes</h3>
<div class="outline-text-3" id="text-17-8">
<p>
IMPORTANT:
</p>

<pre class="example" id="orgb5ca29b">
LDAP stores password hashes, not plain-text passwords.
</pre>

<p>
The script automatically generates secure LDAP-compatible password hashes using:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>slappasswd
</code></pre>
</div>

<p>
This improves security by avoiding direct plain-text password storage.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb519e02" class="outline-2">
<h2 id="orgb519e02"><span class="section-number-2">18.</span> Advanced Slurm Configuration Preparation</h2>
<div class="outline-text-2" id="text-18">
<p>
This phase marks the transition from a:
</p>

<pre class="example" id="org6731162">
basic educational Slurm setup
</pre>

<p>
to a more:
</p>

<pre class="example" id="org070a3f9">
resource-aware and production-like HPC scheduler environment
</pre>

<p>
At this stage, the cluster was already fully functional and stable.
</p>

<p>
Existing working components:
</p>

<ul class="org-ul">
<li>Slurm scheduler</li>
<li>sbatch job submission</li>
<li>MPI execution</li>
<li>multinode MPI jobs</li>
<li>LDAP centralized authentication</li>
<li>shared filesystem</li>
<li>shared Spack software stack</li>
</ul>

<p>
The goal of this phase was to carefully introduce advanced scheduler
features WITHOUT destabilizing runtime execution.
</p>
</div>
<div id="outline-container-org77badf2" class="outline-3">
<h3 id="org77badf2"><span class="section-number-3">18.1.</span> IMPORTANT APPROACH</h3>
<div class="outline-text-3" id="text-18-1">
<p>
Advanced Slurm administration should always be performed incrementally.
</p>

<p>
Instead of enabling many advanced features simultaneously, only ONE
feature was introduced and validated at a time.
</p>

<p>
This approach helps:
</p>

<ul class="org-ul">
<li>isolate issues properly</li>
<li>simplify debugging</li>
<li>understand scheduler behavior</li>
<li>maintain cluster stability</li>
</ul>

<p>
This is how production HPC administrators commonly manage scheduler
configuration changes.
</p>
</div>
</div>
<div id="outline-container-orge7ea2c1" class="outline-3">
<h3 id="orge7ea2c1"><span class="section-number-3">18.2.</span> Advanced Slurm Roadmap</h3>
<div class="outline-text-3" id="text-18-2">
<p>
The cluster was upgraded gradually in the following order:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Phase</th>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">Risk Level</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Resource Accounting</td>
<td class="org-left">Safe</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Memory-Aware Scheduling</td>
<td class="org-left">Safe</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">CPU Binding / Affinity</td>
<td class="org-left">Safe</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Job Limits</td>
<td class="org-left">Safe</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">QoS</td>
<td class="org-left">Medium</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">Accounts &amp; Fairshare</td>
<td class="org-left">Medium</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">Reservations</td>
<td class="org-left">Medium</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">Advanced Scheduling Policies</td>
<td class="org-left">Medium</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">cgroups/task/cgroup</td>
<td class="org-left">Advanced</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">Monitoring &amp; Metrics</td>
<td class="org-left">Advanced</td>
</tr>
</tbody>
</table>
</div>
<ol class="org-ol">
<li><a id="org751c35f"></a>IMPORTANT NOTE<br />
<div class="outline-text-4" id="text-18-2-1">
<p>
At this stage:
</p>

<pre class="example" id="org9640f07">
TaskPlugin=task/cgroup
</pre>

<p>
was intentionally NOT enabled.
</p>

<p>
Reason:
</p>

<p>
Strict cgroup enforcement can introduce runtime instability,
especially on:
</p>

<ul class="org-ul">
<li>Rocky Linux 9</li>
<li>cgroup v2 systems</li>
<li>educational clusters</li>
</ul>

<p>
Instead, the cluster first focused on:
</p>

<ul class="org-ul">
<li>stable scheduling</li>
<li>resource accounting</li>
<li>affinity scheduling</li>
<li>scheduler-aware resource tracking</li>
</ul>

<p>
before moving toward strict kernel-level enforcement.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org89f3477" class="outline-3">
<h3 id="org89f3477"><span class="section-number-3">18.3.</span> Resource-Aware Scheduling</h3>
<div class="outline-text-3" id="text-18-3">
<p>
Goal:
</p>

<p>
Teach Slurm to understand:
</p>

<ul class="org-ul">
<li>CPU resources</li>
<li>memory resources</li>
<li>consumable resources</li>
<li>schedulable resources</li>
</ul>

<p>
without enabling strict runtime enforcement.
</p>

<p>
This creates a much safer and more stable intermediate scheduler state.
</p>
</div>
</div>
<div id="outline-container-org3f30968" class="outline-3">
<h3 id="org3f30968"><span class="section-number-3">18.4.</span> Understanding Current Cluster Resource State</h3>
<div class="outline-text-3" id="text-18-4">
<p>
Initial scheduler behavior:
</p>

<ul class="org-ul">
<li>node-aware scheduling</li>
<li>CPU-aware scheduling</li>
</ul>

<p>
BUT:
</p>

<p>
Slurm did NOT properly understand actual node memory capacity.
</p>

<p>
This can be verified using:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>scontrol show node compute01
</code></pre>
</div>

<p>
Without:
</p>

<pre class="example" id="org5ebf43d">
RealMemory
</pre>

<p>
configured, Slurm cannot properly perform memory-aware scheduling.
</p>
</div>
</div>
