README.org
** Understanding Actual Node Memory

Actual node memory was checked using:

#+begin_src bash
ssh compute01 free -m
ssh compute02 free -m
ssh compute03 free -m
#+end_src

Observed memory:

#+begin_example
~1700 MB
#+end_example

IMPORTANT:

Production HPC clusters NEVER allocate 100% physical memory to jobs.

Reason:

The operating system itself requires memory for:

- kernel
- SSH sessions
- Slurm daemons
- filesystem cache
- system services
- background tasks

A portion of memory must always remain reserved for stable node
operation.

** Configuring RealMemory

Node configuration was updated inside:

#+begin_src bash
sudo vim /etc/slurm/slurm.conf
#+end_src

Original configuration:

#+begin_src ini
NodeName=compute01 CPUs=2 State=UNKNOWN
NodeName=compute02 CPUs=2 State=UNKNOWN
NodeName=compute03 CPUs=2 State=UNKNOWN
#+end_src

Updated configuration:

#+begin_src ini
NodeName=compute01 CPUs=2 RealMemory=1200 State=UNKNOWN
NodeName=compute02 CPUs=2 RealMemory=1200 State=UNKNOWN
NodeName=compute03 CPUs=2 RealMemory=1200 State=UNKNOWN
#+end_src

** RealMemory Concept

#+begin_src ini
RealMemory=1200
#+end_src

does NOT represent total physical memory.

Instead, it defines:

#+begin_example
schedulable memory available to jobs
#+end_example

Example:

| Actual Physical Memory | Configured Schedulable Memory |
|------------------------+-------------------------------|
| ~1700 MB | 1200 MB |

This reserved memory helps maintain:

- system stability
- scheduler reliability
- daemon responsiveness
- SSH availability

during heavy workloads.

** Resource-Aware Scheduling Concept

After configuring:

#+begin_example
RealMemory
#+end_example

Slurm now understands:

- CPU resources
- schedulable memory
- consumable resources

instead of only allocating entire nodes.

This is a major scheduler upgrade.

The scheduler transitioned from:

#+begin_example
simple node allocation
#+end_example

to:

#+begin_example
resource-aware scheduling
#+end_example

** Scheduler Configuration Enhancements

The following important scheduler options were enabled:

#+begin_src ini
SchedulerType=sched/backfill

SelectType=select/cons_tres
SelectTypeParameters=CR_Core

TaskPlugin=task/affinity
#+end_src

** Configuration Explanation

*** SchedulerType=sched/backfill

Enables Slurm backfill scheduler.

Purpose:

Allows smaller jobs to execute while larger jobs wait for resources.

Benefits:

- improves cluster utilization
- reduces idle resources
- increases scheduling efficiency

This is commonly used in production HPC systems.

*** SelectType=select/cons_tres

Enables:

#+begin_example
consumable resource scheduling
#+end_example

This allows Slurm to track:

- CPUs
- memory
- schedulable resources

instead of only allocating complete nodes.

*** SelectTypeParameters=CR_Core

Enables:

#+begin_example
core-aware scheduling
#+end_example

Resources are now allocated at CPU-core granularity.

This is extremely important for:

- MPI workloads
- OpenMP workloads
- hybrid parallel applications

*** TaskPlugin=task/affinity

Enables CPU affinity support.

Purpose:

Allows Slurm to:

- pin tasks to CPUs
- improve cache locality
- optimize task placement
- stabilize parallel performance

This is one of the most important performance-related scheduler
features in HPC environments.

** Distributing Updated Slurm Configuration

Updated configuration was distributed cluster-wide.

Copy configuration:

#+begin_src bash
scp /etc/slurm/slurm.conf login:/tmp/
scp /etc/slurm/slurm.conf compute01:/tmp/
scp /etc/slurm/slurm.conf compute02:/tmp/
scp /etc/slurm/slurm.conf compute03:/tmp/
#+end_src

Move configuration into place:

#+begin_src bash
sudo mv /tmp/slurm.conf /etc/slurm/
#+end_src

Compute nodes:

#+begin_src bash
ssh compute01 sudo -S mv /tmp/slurm.conf /etc/slurm/
ssh compute02 sudo -S mv /tmp/slurm.conf /etc/slurm/
ssh compute03 sudo -S mv /tmp/slurm.conf /etc/slurm/
#+end_src

** Restarting Slurm Services

Restart controller on master node:

#+begin_src bash
sudo systemctl restart slurmctld
#+end_src

Restart compute daemons:

#+begin_src bash
ssh compute01 sudo -S systemctl restart slurmd
ssh compute02 sudo -S systemctl restart slurmd
ssh compute03 sudo -S systemctl restart slurmd
#+end_src

Purpose:

Reload updated scheduler configuration across all nodes.

** Verifying Cluster Health

Verify node state:

#+begin_src bash
sinfo
#+end_src

Expected:

#+begin_example
compute[01-03] idle
#+end_example

Verify scheduler memory recognition:

#+begin_src bash
scontrol show node compute01
#+end_src

Expected:

#+begin_example
RealMemory=1200
#+end_example

This validates:

- scheduler configuration loaded correctly
- memory-aware scheduling active
- stable cluster operation

** Difference Between Scheduling and Enforcement

At this stage:

#+begin_example
memory-aware scheduling
#+end_example

was enabled.

BUT:

#+begin_example
strict kernel-level memory enforcement
#+end_example

was NOT enabled.

This distinction is extremely important.

Current behavior:

#+begin_src bash
#SBATCH --mem=500M
#+end_src

does:

- reserve memory in scheduler accounting
- affect scheduling decisions
- prevent scheduler over-allocation

BUT does NOT:

- hard-limit memory usage
- kill memory-overusing jobs
- enforce kernel-level restrictions

because:

#+begin_example
TaskPlugin=task/cgroup
#+end_example

was intentionally NOT enabled.

