README.html
<div id="outline-container-org919f701" class="outline-3">
<h3 id="org919f701"><span class="section-number-3">18.5.</span> Understanding Actual Node Memory</h3>
<div class="outline-text-3" id="text-18-5">
<p>
Actual node memory was checked using:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ssh compute01 free -m
ssh compute02 free -m
ssh compute03 free -m
</code></pre>
</div>

<p>
Observed memory:
</p>

<pre class="example" id="org777c292">
~1700 MB
</pre>

<p>
IMPORTANT:
</p>

<p>
Production HPC clusters NEVER allocate 100% physical memory to jobs.
</p>

<p>
Reason:
</p>

<p>
The operating system itself requires memory for:
</p>

<ul class="org-ul">
<li>kernel</li>
<li>SSH sessions</li>
<li>Slurm daemons</li>
<li>filesystem cache</li>
<li>system services</li>
<li>background tasks</li>
</ul>

<p>
A portion of memory must always remain reserved for stable node
operation.
</p>
</div>
</div>
<div id="outline-container-org28cebf9" class="outline-3">
<h3 id="org28cebf9"><span class="section-number-3">18.6.</span> Configuring RealMemory</h3>
<div class="outline-text-3" id="text-18-6">
<p>
Node configuration was updated inside:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/slurm/slurm.conf
</code></pre>
</div>

<p>
Original configuration:
</p>

<div class="org-src-container">
<pre class="src src-ini"><code>NodeName=compute01 CPUs=2 State=UNKNOWN
NodeName=compute02 CPUs=2 State=UNKNOWN
NodeName=compute03 CPUs=2 State=UNKNOWN
</code></pre>
</div>

<p>
Updated configuration:
</p>

<div class="org-src-container">
<pre class="src src-ini"><code>NodeName=compute01 CPUs=2 RealMemory=1200 State=UNKNOWN
NodeName=compute02 CPUs=2 RealMemory=1200 State=UNKNOWN
NodeName=compute03 CPUs=2 RealMemory=1200 State=UNKNOWN
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org7ed8d4c" class="outline-3">
<h3 id="org7ed8d4c"><span class="section-number-3">18.7.</span> RealMemory Concept</h3>
<div class="outline-text-3" id="text-18-7">
<div class="org-src-container">
<pre class="src src-ini"><code>RealMemory=1200
</code></pre>
</div>

<p>
does NOT represent total physical memory.
</p>

<p>
Instead, it defines:
</p>

<pre class="example" id="orga557747">
schedulable memory available to jobs
</pre>

<p>
Example:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Actual Physical Memory</th>
<th scope="col" class="org-left">Configured Schedulable Memory</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">~1700 MB</td>
<td class="org-left">1200 MB</td>
</tr>
</tbody>
</table>

<p>
This reserved memory helps maintain:
</p>

<ul class="org-ul">
<li>system stability</li>
<li>scheduler reliability</li>
<li>daemon responsiveness</li>
<li>SSH availability</li>
</ul>

<p>
during heavy workloads.
</p>
</div>
</div>
<div id="outline-container-org4694a3c" class="outline-3">
<h3 id="org4694a3c"><span class="section-number-3">18.8.</span> Resource-Aware Scheduling Concept</h3>
<div class="outline-text-3" id="text-18-8">
<p>
After configuring:
</p>

<pre class="example" id="org4f60bf2">
RealMemory
</pre>

<p>
Slurm now understands:
</p>

<ul class="org-ul">
<li>CPU resources</li>
<li>schedulable memory</li>
<li>consumable resources</li>
</ul>

<p>
instead of only allocating entire nodes.
</p>

<p>
This is a major scheduler upgrade.
</p>

<p>
The scheduler transitioned from:
</p>

<pre class="example" id="org775b2e4">
simple node allocation
</pre>

<p>
to:
</p>

<pre class="example" id="orgdd313f3">
resource-aware scheduling
</pre>
</div>
</div>
<div id="outline-container-org4621fb2" class="outline-3">
<h3 id="org4621fb2"><span class="section-number-3">18.9.</span> Scheduler Configuration Enhancements</h3>
<div class="outline-text-3" id="text-18-9">
<p>
The following important scheduler options were enabled:
</p>

<div class="org-src-container">
<pre class="src src-ini"><code>SchedulerType=sched/backfill

SelectType=select/cons_tres
SelectTypeParameters=CR_Core

TaskPlugin=task/affinity
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org255669c" class="outline-3">
<h3 id="org255669c"><span class="section-number-3">18.10.</span> Configuration Explanation</h3>
<div class="outline-text-3" id="text-18-10">
</div>
<ol class="org-ol">
<li><a id="org3e4e132"></a>SchedulerType=sched/backfill<br />
<div class="outline-text-4" id="text-18-10-1">
<p>
Enables Slurm backfill scheduler.
</p>

<p>
Purpose:
</p>

<p>
Allows smaller jobs to execute while larger jobs wait for resources.
</p>

<p>
Benefits:
</p>

<ul class="org-ul">
<li>improves cluster utilization</li>
<li>reduces idle resources</li>
<li>increases scheduling efficiency</li>
</ul>

<p>
This is commonly used in production HPC systems.
</p>
</div>
</li>
<li><a id="org8516b88"></a>SelectType=select/cons_tres<br />
<div class="outline-text-4" id="text-18-10-2">
<p>
Enables:
</p>

<pre class="example" id="org416f6e9">
consumable resource scheduling
</pre>

<p>
This allows Slurm to track:
</p>

<ul class="org-ul">
<li>CPUs</li>
<li>memory</li>
<li>schedulable resources</li>
</ul>

<p>
instead of only allocating complete nodes.
</p>
</div>
</li>
<li><a id="orge5befcf"></a>SelectTypeParameters=CR_Core<br />
<div class="outline-text-4" id="text-18-10-3">
<p>
Enables:
</p>

<pre class="example" id="org2fe3040">
core-aware scheduling
</pre>

<p>
Resources are now allocated at CPU-core granularity.
</p>

<p>
This is extremely important for:
</p>

<ul class="org-ul">
<li>MPI workloads</li>
<li>OpenMP workloads</li>
<li>hybrid parallel applications</li>
</ul>
</div>
</li>
<li><a id="org96ad4b6"></a>TaskPlugin=task/affinity<br />
<div class="outline-text-4" id="text-18-10-4">
<p>
Enables CPU affinity support.
</p>

<p>
Purpose:
</p>

<p>
Allows Slurm to:
</p>

<ul class="org-ul">
<li>pin tasks to CPUs</li>
<li>improve cache locality</li>
<li>optimize task placement</li>
<li>stabilize parallel performance</li>
</ul>

<p>
This is one of the most important performance-related scheduler
features in HPC environments.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgdca0185" class="outline-3">
<h3 id="orgdca0185"><span class="section-number-3">18.11.</span> Distributing Updated Slurm Configuration</h3>
<div class="outline-text-3" id="text-18-11">
<p>
Updated configuration was distributed cluster-wide.
</p>

<p>
Copy configuration:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>scp /etc/slurm/slurm.conf login:/tmp/
scp /etc/slurm/slurm.conf compute01:/tmp/
scp /etc/slurm/slurm.conf compute02:/tmp/
scp /etc/slurm/slurm.conf compute03:/tmp/
</code></pre>
</div>

<p>
Move configuration into place:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo mv /tmp/slurm.conf /etc/slurm/
</code></pre>
</div>

<p>
Compute nodes:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ssh compute01 sudo -S mv /tmp/slurm.conf /etc/slurm/
ssh compute02 sudo -S mv /tmp/slurm.conf /etc/slurm/
ssh compute03 sudo -S mv /tmp/slurm.conf /etc/slurm/
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgb1001ff" class="outline-3">
<h3 id="orgb1001ff"><span class="section-number-3">18.12.</span> Restarting Slurm Services</h3>
<div class="outline-text-3" id="text-18-12">
<p>
Restart controller on master node:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl restart slurmctld
</code></pre>
</div>

<p>
Restart compute daemons:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ssh compute01 sudo -S systemctl restart slurmd
ssh compute02 sudo -S systemctl restart slurmd
ssh compute03 sudo -S systemctl restart slurmd
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Reload updated scheduler configuration across all nodes.
</p>
</div>
</div>
<div id="outline-container-org8756a05" class="outline-3">
<h3 id="org8756a05"><span class="section-number-3">18.13.</span> Verifying Cluster Health</h3>
<div class="outline-text-3" id="text-18-13">
<p>
Verify node state:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sinfo
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org28e543f">
compute[01-03] idle
</pre>

<p>
Verify scheduler memory recognition:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>scontrol show node compute01
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org0dfe592">
RealMemory=1200
</pre>

<p>
This validates:
</p>

<ul class="org-ul">
<li>scheduler configuration loaded correctly</li>
<li>memory-aware scheduling active</li>
<li>stable cluster operation</li>
</ul>
</div>
</div>
<div id="outline-container-org25a4b73" class="outline-3">
<h3 id="org25a4b73"><span class="section-number-3">18.14.</span> Difference Between Scheduling and Enforcement</h3>
<div class="outline-text-3" id="text-18-14">
<p>
At this stage:
</p>

<pre class="example" id="org4854859">
memory-aware scheduling
</pre>

<p>
was enabled.
</p>

<p>
BUT:
</p>

<pre class="example" id="org99aa41f">
strict kernel-level memory enforcement
</pre>

<p>
was NOT enabled.
</p>

<p>
This distinction is extremely important.
</p>

<p>
Current behavior:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>#SBATCH --mem=500M
</code></pre>
</div>

<p>
does:
</p>

<ul class="org-ul">
<li>reserve memory in scheduler accounting</li>
<li>affect scheduling decisions</li>
<li>prevent scheduler over-allocation</li>
</ul>

<p>
BUT does NOT:
</p>

<ul class="org-ul">
<li>hard-limit memory usage</li>
<li>kill memory-overusing jobs</li>
<li>enforce kernel-level restrictions</li>
</ul>

<p>
because:
</p>

<pre class="example" id="org1ade013">
TaskPlugin=task/cgroup
</pre>

<p>
was intentionally NOT enabled.
</p>
</div>
</div>
