README.org
** Why task/cgroup Was Postponed

Earlier experiments with:

#+begin_src ini
TaskPlugin=task/cgroup
#+end_src

introduced runtime instability.

Observed issues included:

- batch runtime failures
- node drain states
- unstable job execution
- scheduler inconsistencies

Reason:

Modern Rocky Linux 9 systems use:

#+begin_example
cgroup v2
#+end_example

which often requires significantly more careful Slurm configuration and
kernel-level tuning.

Instead of introducing unstable runtime enforcement early, the cluster
was intentionally kept in a stable intermediate state using:

#+begin_src ini
TaskPlugin=task/affinity
#+end_src

This approach provides:

- stable runtime execution
- CPU affinity support
- resource-aware scheduling
- simplified administration

without destabilizing scheduler behavior.

** Process Tracking Note

The cluster still uses:

#+begin_src ini
ProctrackType=proctrack/cgroup
#+end_src

This is generally safe because:

- lightweight process tracking only
- no strict runtime enforcement
- no aggressive kernel-level isolation

This differs significantly from:

#+begin_src ini
TaskPlugin=task/cgroup
#+end_src

which performs actual resource enforcement and isolation.

Keeping:

#+begin_example
proctrack/cgroup
#+end_example

while avoiding:

#+begin_example
task/cgroup
#+end_example

provides a much safer and more stable educational HPC environment.

** Verifying Stable Job Execution

After enabling resource-aware scheduling:

- sbatch jobs remained stable
- MPI jobs executed correctly
- multinode execution continued working
- no node drain issues occurred
- no runtime instability observed

This confirmed that the scheduler upgrade was successful.

** Milestone Achieved

The cluster successfully evolved from:

#+begin_example
basic educational scheduler
#+end_example

into:

#+begin_example
resource-aware production-like scheduler
#+end_example

while maintaining:

- stable runtime execution
- multinode MPI support
- scheduler reliability
- simplified administration

This forms the foundation required for future advanced features such as:

- CPU affinity and task binding
- QoS
- fairshare
- accounting
- scheduling policies
- advanced resource management
  
* Advanced Slurm Configuration

This section extends the Slurm setup from a basic scheduler into a more
resource-aware and production-like HPC workload manager.

At this stage, the cluster already had:

- working Slurm scheduler
- multinode job execution
- MPI runtime support
- centralized LDAP authentication
- shared filesystem
- shared Spack software stack

The goal of this phase was to gradually introduce advanced scheduler
features without destabilizing the cluster runtime environment.

The approach followed:

- incremental configuration
- verification after every change
- understanding scheduler behavior
- avoiding unsafe configurations initially

** IMPORTANT APPROACH

Advanced Slurm administration should always be performed incrementally.

Instead of enabling multiple advanced features simultaneously, only one
feature was introduced and tested at a time.

This helps isolate issues and understand scheduler behavior properly.

** Current Cluster State Before Advanced Configuration

Cluster components already working:

| Component            | Status  |
|----------------------+---------|
| Slurm scheduler      | Working |
| sbatch               | Working |
| MPI jobs             | Working |
| Multinode jobs       | Working |
| LDAP users           | Working |
| Shared filesystem    | Working |
| Spack software stack | Working |

This provided a stable foundation before introducing advanced scheduler
features.

** Resource-Aware Scheduling

Goal:

Enable Slurm to understand and schedule cluster resources more accurately.

This phase introduced:

- memory-aware scheduling
- consumable resource scheduling
- core-aware scheduling
- scheduler backfill support

without enabling strict kernel-level resource enforcement.

*** IMPORTANT CONCEPT

At this stage:

#+begin_example
memory-aware scheduling
#+end_example

was enabled.

NOT:

#+begin_example
strict memory enforcement
#+end_example

This distinction is extremely important.

The scheduler now understands memory resources and schedules jobs
accordingly, but Linux is still responsible for actual memory allocation.

No cgroup-based hard memory limits were enabled yet.

*** Existing Stable Slurm Configuration

Current working configuration:

#+begin_src ini
ClusterName=hpccluster
SlurmctldHost=master

MpiDefault=none
ProctrackType=proctrack/cgroup
ReturnToService=2

SlurmctldPidFile=/run/slurmctld.pid
SlurmdPidFile=/run/slurmd.pid

SlurmdSpoolDir=/var/spool/slurmd
StateSaveLocation=/var/spool/slurmctld

SlurmUser=slurm

SwitchType=switch/none
TaskPlugin=task/affinity

SchedulerType=sched/backfill

SelectType=select/cons_tres
SelectTypeParameters=CR_Core

AuthType=auth/munge

NodeName=compute01 CPUs=2 RealMemory=1200 State=UNKNOWN
NodeName=compute02 CPUs=2 RealMemory=1200 State=UNKNOWN
NodeName=compute03 CPUs=2 RealMemory=1200 State=UNKNOWN

PartitionName=debug Nodes=ALL Default=YES MaxTime=INFINITE State=UP
#+end_src

*** Explanation of Important Parameters

**** SchedulerType=sched/backfill

Enables Slurm backfill scheduler.

Purpose:

Allows smaller jobs to run while larger jobs wait for resources.

Benefits:

- improves cluster utilization
- reduces idle time
- increases scheduling efficiency

Production HPC systems commonly use backfill scheduling.

**** SelectType=select/cons_tres

Enables:

#+begin_example
consumable resource scheduling
#+end_example

This changes Slurm from:

#+begin_example
simple node allocation
#+end_example

to:

#+begin_example
resource-aware allocation
#+end_example

Slurm now tracks:

- CPUs
- memory
- consumable resources

instead of only allocating entire nodes.

