README.html
<div id="outline-container-orgcfe8fd3" class="outline-3">
<h3 id="orgcfe8fd3"><span class="section-number-3">18.15.</span> Why task/cgroup Was Postponed</h3>
<div class="outline-text-3" id="text-18-15">
<p>
Earlier experiments with:
</p>

<div class="org-src-container">
<pre class="src src-ini"><code>TaskPlugin=task/cgroup
</code></pre>
</div>

<p>
introduced runtime instability.
</p>

<p>
Observed issues included:
</p>

<ul class="org-ul">
<li>batch runtime failures</li>
<li>node drain states</li>
<li>unstable job execution</li>
<li>scheduler inconsistencies</li>
</ul>

<p>
Reason:
</p>

<p>
Modern Rocky Linux 9 systems use:
</p>

<pre class="example" id="org4d9eea5">
cgroup v2
</pre>

<p>
which often requires significantly more careful Slurm configuration and
kernel-level tuning.
</p>

<p>
Instead of introducing unstable runtime enforcement early, the cluster
was intentionally kept in a stable intermediate state using:
</p>

<div class="org-src-container">
<pre class="src src-ini"><code>TaskPlugin=task/affinity
</code></pre>
</div>

<p>
This approach provides:
</p>

<ul class="org-ul">
<li>stable runtime execution</li>
<li>CPU affinity support</li>
<li>resource-aware scheduling</li>
<li>simplified administration</li>
</ul>

<p>
without destabilizing scheduler behavior.
</p>
</div>
</div>
<div id="outline-container-org0e5e4bd" class="outline-3">
<h3 id="org0e5e4bd"><span class="section-number-3">18.16.</span> Process Tracking Note</h3>
<div class="outline-text-3" id="text-18-16">
<p>
The cluster still uses:
</p>

<div class="org-src-container">
<pre class="src src-ini"><code>ProctrackType=proctrack/cgroup
</code></pre>
</div>

<p>
This is generally safe because:
</p>

<ul class="org-ul">
<li>lightweight process tracking only</li>
<li>no strict runtime enforcement</li>
<li>no aggressive kernel-level isolation</li>
</ul>

<p>
This differs significantly from:
</p>

<div class="org-src-container">
<pre class="src src-ini"><code>TaskPlugin=task/cgroup
</code></pre>
</div>

<p>
which performs actual resource enforcement and isolation.
</p>

<p>
Keeping:
</p>

<pre class="example" id="orgf4a58d1">
proctrack/cgroup
</pre>

<p>
while avoiding:
</p>

<pre class="example" id="org96221c5">
task/cgroup
</pre>

<p>
provides a much safer and more stable educational HPC environment.
</p>
</div>
</div>
<div id="outline-container-org761c04f" class="outline-3">
<h3 id="org761c04f"><span class="section-number-3">18.17.</span> Verifying Stable Job Execution</h3>
<div class="outline-text-3" id="text-18-17">
<p>
After enabling resource-aware scheduling:
</p>

<ul class="org-ul">
<li>sbatch jobs remained stable</li>
<li>MPI jobs executed correctly</li>
<li>multinode execution continued working</li>
<li>no node drain issues occurred</li>
<li>no runtime instability observed</li>
</ul>

<p>
This confirmed that the scheduler upgrade was successful.
</p>
</div>
</div>
<div id="outline-container-org1211002" class="outline-3">
<h3 id="org1211002"><span class="section-number-3">18.18.</span> Milestone Achieved</h3>
<div class="outline-text-3" id="text-18-18">
<p>
The cluster successfully evolved from:
</p>

<pre class="example" id="org02b64a9">
basic educational scheduler
</pre>

<p>
into:
</p>

<pre class="example" id="org6dd91fc">
resource-aware production-like scheduler
</pre>

<p>
while maintaining:
</p>

<ul class="org-ul">
<li>stable runtime execution</li>
<li>multinode MPI support</li>
<li>scheduler reliability</li>
<li>simplified administration</li>
</ul>

<p>
This forms the foundation required for future advanced features such as:
</p>

<ul class="org-ul">
<li>CPU affinity and task binding</li>
<li>QoS</li>
<li>fairshare</li>
<li>accounting</li>
<li>scheduling policies</li>
<li>advanced resource management</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0944a73" class="outline-2">
<h2 id="org0944a73"><span class="section-number-2">19.</span> Advanced Slurm Configuration</h2>
<div class="outline-text-2" id="text-19">
<p>
This section extends the Slurm setup from a basic scheduler into a more
resource-aware and production-like HPC workload manager.
</p>

<p>
At this stage, the cluster already had:
</p>

<ul class="org-ul">
<li>working Slurm scheduler</li>
<li>multinode job execution</li>
<li>MPI runtime support</li>
<li>centralized LDAP authentication</li>
<li>shared filesystem</li>
<li>shared Spack software stack</li>
</ul>

<p>
The goal of this phase was to gradually introduce advanced scheduler
features without destabilizing the cluster runtime environment.
</p>

<p>
The approach followed:
</p>

<ul class="org-ul">
<li>incremental configuration</li>
<li>verification after every change</li>
<li>understanding scheduler behavior</li>
<li>avoiding unsafe configurations initially</li>
</ul>
</div>
<div id="outline-container-orgab73574" class="outline-3">
<h3 id="orgab73574"><span class="section-number-3">19.1.</span> IMPORTANT APPROACH</h3>
<div class="outline-text-3" id="text-19-1">
<p>
Advanced Slurm administration should always be performed incrementally.
</p>

<p>
Instead of enabling multiple advanced features simultaneously, only one
feature was introduced and tested at a time.
</p>

<p>
This helps isolate issues and understand scheduler behavior properly.
</p>
</div>
</div>
<div id="outline-container-orgf6b6985" class="outline-3">
<h3 id="orgf6b6985"><span class="section-number-3">19.2.</span> Current Cluster State Before Advanced Configuration</h3>
<div class="outline-text-3" id="text-19-2">
<p>
Cluster components already working:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Component</th>
<th scope="col" class="org-left">Status</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Slurm scheduler</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">sbatch</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">MPI jobs</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Multinode jobs</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">LDAP users</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Shared filesystem</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Spack software stack</td>
<td class="org-left">Working</td>
</tr>
</tbody>
</table>

<p>
This provided a stable foundation before introducing advanced scheduler
features.
</p>
</div>
</div>
<div id="outline-container-org43b158e" class="outline-3">
<h3 id="org43b158e"><span class="section-number-3">19.3.</span> Resource-Aware Scheduling</h3>
<div class="outline-text-3" id="text-19-3">
<p>
Goal:
</p>

<p>
Enable Slurm to understand and schedule cluster resources more accurately.
</p>

<p>
This phase introduced:
</p>

<ul class="org-ul">
<li>memory-aware scheduling</li>
<li>consumable resource scheduling</li>
<li>core-aware scheduling</li>
<li>scheduler backfill support</li>
</ul>

<p>
without enabling strict kernel-level resource enforcement.
</p>
</div>
<ol class="org-ol">
<li><a id="org63c7a58"></a>IMPORTANT CONCEPT<br />
<div class="outline-text-4" id="text-19-3-1">
<p>
At this stage:
</p>

<pre class="example" id="org14ab593">
memory-aware scheduling
</pre>

<p>
was enabled.
</p>

<p>
NOT:
</p>

<pre class="example" id="org4ff8f15">
strict memory enforcement
</pre>

<p>
This distinction is extremely important.
</p>

<p>
The scheduler now understands memory resources and schedules jobs
accordingly, but Linux is still responsible for actual memory allocation.
</p>

<p>
No cgroup-based hard memory limits were enabled yet.
</p>
</div>
</li>
<li><a id="orgec0548a"></a>Existing Stable Slurm Configuration<br />
<div class="outline-text-4" id="text-19-3-2">
<p>
Current working configuration:
</p>

<div class="org-src-container">
<pre class="src src-ini"><code>ClusterName=hpccluster
SlurmctldHost=master

MpiDefault=none
ProctrackType=proctrack/cgroup
ReturnToService=2

SlurmctldPidFile=/run/slurmctld.pid
SlurmdPidFile=/run/slurmd.pid

SlurmdSpoolDir=/var/spool/slurmd
StateSaveLocation=/var/spool/slurmctld

SlurmUser=slurm

SwitchType=switch/none
TaskPlugin=task/affinity

SchedulerType=sched/backfill

SelectType=select/cons_tres
SelectTypeParameters=CR_Core

AuthType=auth/munge

NodeName=compute01 CPUs=2 RealMemory=1200 State=UNKNOWN
NodeName=compute02 CPUs=2 RealMemory=1200 State=UNKNOWN
NodeName=compute03 CPUs=2 RealMemory=1200 State=UNKNOWN

PartitionName=debug Nodes=ALL Default=YES MaxTime=INFINITE State=UP
</code></pre>
</div>
</div>
</li>
<li><a id="orga9e4cb1"></a>Explanation of Important Parameters<br />
<ol class="org-ol">
<li><a id="org79e82be"></a>SchedulerType=sched/backfill<br />
<div class="outline-text-5" id="text-19-3-3-1">
<p>
Enables Slurm backfill scheduler.
</p>

<p>
Purpose:
</p>

<p>
Allows smaller jobs to run while larger jobs wait for resources.
</p>

<p>
Benefits:
</p>

<ul class="org-ul">
<li>improves cluster utilization</li>
<li>reduces idle time</li>
<li>increases scheduling efficiency</li>
</ul>

<p>
Production HPC systems commonly use backfill scheduling.
</p>
</div>
</li>
<li><a id="orgb80a1ad"></a>SelectType=select/cons_tres<br />
<div class="outline-text-5" id="text-19-3-3-2">
<p>
Enables:
</p>

<pre class="example" id="org11bf0ad">
consumable resource scheduling
</pre>

<p>
This changes Slurm from:
</p>

<pre class="example" id="orgf3ef75c">
simple node allocation
</pre>

<p>
to:
</p>

<pre class="example" id="org4179373">
resource-aware allocation
</pre>

<p>
Slurm now tracks:
</p>

<ul class="org-ul">
<li>CPUs</li>
<li>memory</li>
<li>consumable resources</li>
</ul>

<p>
instead of only allocating entire nodes.
</p>
</div>
</li>
