README.org
**** SelectTypeParameters=CR_Core

Enables:

#+begin_example
core-aware scheduling
#+end_example

Resources are now scheduled at CPU core granularity.

This is extremely important for:

- MPI workloads
- OpenMP workloads
- hybrid parallel jobs

**** TaskPlugin=task/affinity

Enables CPU affinity support.

Purpose:

Allows Slurm to:

- pin tasks to CPUs
- control process placement
- improve cache locality
- optimize parallel performance

This is one of the most important performance-related scheduler features.

**** RealMemory=1200

Defines schedulable memory for each node.

Important:

This value should NOT equal total physical memory.

Example:

Node actual memory:

#+begin_example
1700 MB
#+end_example

Configured schedulable memory:

#+begin_example
1200 MB
#+end_example

Reason:

The operating system itself requires memory for:

- kernel
- filesystem cache
- SSH sessions
- Slurm daemons
- background services

Production clusters always reserve memory for system operation.

*** IMPORTANT MEMORY SCHEDULING CONCEPT

At this stage:

#+begin_src bash
#SBATCH --mem=500M
#+end_src

does:

- reserve memory in scheduler accounting
- affect scheduling decisions
- prevent scheduler over-allocation

BUT does NOT:

- hard-limit memory usage
- kill memory-overusing jobs
- enforce kernel-level restrictions

because:

#+begin_example
TaskPlugin=task/cgroup
#+end_example

was intentionally NOT enabled yet.

This avoids runtime instability while still enabling resource-aware
scheduling.

** CPU Affinity and Task Binding

Goal:

Understand and validate:

- CPU affinity
- process placement
- task binding
- scheduler-controlled CPU allocation

This phase connects directly with:

- parallel performance
- cache locality
- MPI optimization
- OpenMP optimization

*** IMPORTANT CONCEPT

Without CPU affinity:

- processes may migrate between CPUs
- cache locality decreases
- performance becomes inconsistent

With affinity:

- processes stay pinned to CPUs
- cache locality improves
- scheduler behavior becomes deterministic

This is extremely important in production HPC systems.

** Understanding CPU Topology

CPU topology information was inspected using:

#+begin_src bash
ssh compute01 lscpu
#+end_src

Important fields:

| Field | Meaning |
|--------+---------|
| CPU(s) | total logical CPUs |
| Core(s) per socket | physical cores |
| Socket(s) | CPU packages |
| Thread(s) per core | SMT/Hyperthreading |
| NUMA node(s) | memory locality domains |

This information becomes important for:

- task placement
- thread pinning
- NUMA optimization
- cache locality

** CPU Affinity Validation Program

Program used to validate CPU placement:

#+begin_src C :tangle affinity.c
#define _GNU_SOURCE

#include <stdio.h>
#include <sched.h>
#include <unistd.h>

int main() {

    int cpu = sched_getcpu();

    printf("Process running on CPU: %d\n", cpu);

    sleep(20);

    return 0;
}
#+end_src

Compile:

#+begin_src bash
gcc affinity.c -o affinity
#+end_src

Purpose:

The program asks Linux:

#+begin_example
Which CPU core am I running on?
#+end_example

This helps visualize scheduler-controlled CPU placement.

** Distributed CPU Placement Test

Slurm batch script:

#+begin_src bash
#!/bin/bash
#SBATCH -N 2
#SBATCH --ntasks-per-node=1
#SBATCH --job-name=affinity
#SBATCH --output=%j.out
#SBATCH --error=%j.err
#SBATCH --time=00:01:00

srun ./affinity
#+end_src

Submit:

#+begin_src bash
sbatch affinity.sh
#+end_src

Observed behavior:

#+begin_example
Process running on CPU: 0
Process running on CPU: 0
#+end_example

IMPORTANT:

CPU numbering is local to each node.

Meaning:

- compute01 has CPU0
- compute02 also has CPU0

Each node maintains independent CPU numbering.

This is an important distributed-system concept.

** Multiple Task Placement Test

Modified batch script:

#+begin_src bash
#!/bin/bash
#SBATCH -N 2
#SBATCH --ntasks-per-node=2
#SBATCH --job-name=affinity
#SBATCH --output=%j.out
#SBATCH --error=%j.err
#SBATCH --time=00:01:00

srun ./affinity
#+end_src

Observed behavior:

#+begin_example
Process running on CPU: 0
Process running on CPU: 1
Process running on CPU: 1
Process running on CPU: 0
#+end_example

This validates:

- task distribution across cores
- scheduler-controlled placement
- multi-core resource allocation

Each node distributed tasks across available CPUs.

** Explicit CPU Binding

Explicit CPU binding script:

#+begin_src bash
#!/bin/bash
#SBATCH -N 1
#SBATCH --ntasks=2
#SBATCH --cpus-per-task=1
#SBATCH --job-name=bindtest
#SBATCH --output=%j.out
#SBATCH --error=%j.err
#SBATCH --time=00:01:00

srun --cpu-bind=cores ./affinity
#+end_src

Submit:

#+begin_src bash
sbatch bind.sh
#+end_src

Observed behavior:

#+begin_example
Process running on CPU: 0
Process running on CPU: 1
#+end_example

This validates:

- explicit CPU pinning
- deterministic CPU placement
- Slurm affinity control
- Linux scheduler cooperation

*** IMPORTANT CONCEPT

Without:

#+begin_src bash
--cpu-bind=cores
#+end_src

Linux may migrate processes between CPUs.

With explicit binding:

- processes stay pinned
- cache locality improves
- performance stabilizes

This becomes extremely important for:

- MPI scaling
- OpenMP scaling
- hybrid MPI/OpenMP execution
- NUMA systems

** Slurm Accounting Database Setup

Goal:

Transform Slurm from:

#+begin_example
basic scheduler
#+end_example

into:

#+begin_example
persistent accounting-aware scheduler
#+end_example

This phase introduced:

- MariaDB backend
- Slurm accounting daemon
- persistent job history
- resource usage tracking
- scheduler accounting infrastructure

