README.html
<li><a id="org91e3010"></a>SelectTypeParameters=CR_Core<br />
<div class="outline-text-5" id="text-19-3-3-3">
<p>
Enables:
</p>

<pre class="example" id="orgc1e4072">
core-aware scheduling
</pre>

<p>
Resources are now scheduled at CPU core granularity.
</p>

<p>
This is extremely important for:
</p>

<ul class="org-ul">
<li>MPI workloads</li>
<li>OpenMP workloads</li>
<li>hybrid parallel jobs</li>
</ul>
</div>
</li>
<li><a id="org5eefdac"></a>TaskPlugin=task/affinity<br />
<div class="outline-text-5" id="text-19-3-3-4">
<p>
Enables CPU affinity support.
</p>

<p>
Purpose:
</p>

<p>
Allows Slurm to:
</p>

<ul class="org-ul">
<li>pin tasks to CPUs</li>
<li>control process placement</li>
<li>improve cache locality</li>
<li>optimize parallel performance</li>
</ul>

<p>
This is one of the most important performance-related scheduler features.
</p>
</div>
</li>
<li><a id="org2df2bac"></a>RealMemory=1200<br />
<div class="outline-text-5" id="text-19-3-3-5">
<p>
Defines schedulable memory for each node.
</p>

<p>
Important:
</p>

<p>
This value should NOT equal total physical memory.
</p>

<p>
Example:
</p>

<p>
Node actual memory:
</p>

<pre class="example" id="orgf6b6e32">
1700 MB
</pre>

<p>
Configured schedulable memory:
</p>

<pre class="example" id="org7ab149e">
1200 MB
</pre>

<p>
Reason:
</p>

<p>
The operating system itself requires memory for:
</p>

<ul class="org-ul">
<li>kernel</li>
<li>filesystem cache</li>
<li>SSH sessions</li>
<li>Slurm daemons</li>
<li>background services</li>
</ul>

<p>
Production clusters always reserve memory for system operation.
</p>
</div>
</li>
</ol>
</li>
<li><a id="org17ba067"></a>IMPORTANT MEMORY SCHEDULING CONCEPT<br />
<div class="outline-text-4" id="text-19-3-4">
<p>
At this stage:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>#SBATCH --mem=500M
</code></pre>
</div>

<p>
does:
</p>

<ul class="org-ul">
<li>reserve memory in scheduler accounting</li>
<li>affect scheduling decisions</li>
<li>prevent scheduler over-allocation</li>
</ul>

<p>
BUT does NOT:
</p>

<ul class="org-ul">
<li>hard-limit memory usage</li>
<li>kill memory-overusing jobs</li>
<li>enforce kernel-level restrictions</li>
</ul>

<p>
because:
</p>

<pre class="example" id="orgcde78a0">
TaskPlugin=task/cgroup
</pre>

<p>
was intentionally NOT enabled yet.
</p>

<p>
This avoids runtime instability while still enabling resource-aware
scheduling.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org3f9bc7d" class="outline-3">
<h3 id="org3f9bc7d"><span class="section-number-3">19.4.</span> CPU Affinity and Task Binding</h3>
<div class="outline-text-3" id="text-19-4">
<p>
Goal:
</p>

<p>
Understand and validate:
</p>

<ul class="org-ul">
<li>CPU affinity</li>
<li>process placement</li>
<li>task binding</li>
<li>scheduler-controlled CPU allocation</li>
</ul>

<p>
This phase connects directly with:
</p>

<ul class="org-ul">
<li>parallel performance</li>
<li>cache locality</li>
<li>MPI optimization</li>
<li>OpenMP optimization</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgd3b92b4"></a>IMPORTANT CONCEPT<br />
<div class="outline-text-4" id="text-19-4-1">
<p>
Without CPU affinity:
</p>

<ul class="org-ul">
<li>processes may migrate between CPUs</li>
<li>cache locality decreases</li>
<li>performance becomes inconsistent</li>
</ul>

<p>
With affinity:
</p>

<ul class="org-ul">
<li>processes stay pinned to CPUs</li>
<li>cache locality improves</li>
<li>scheduler behavior becomes deterministic</li>
</ul>

<p>
This is extremely important in production HPC systems.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org03aebe1" class="outline-3">
<h3 id="org03aebe1"><span class="section-number-3">19.5.</span> Understanding CPU Topology</h3>
<div class="outline-text-3" id="text-19-5">
<p>
CPU topology information was inspected using:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ssh compute01 lscpu
</code></pre>
</div>

<p>
Important fields:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Field</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">CPU(s)</td>
<td class="org-left">total logical CPUs</td>
</tr>

<tr>
<td class="org-left">Core(s) per socket</td>
<td class="org-left">physical cores</td>
</tr>

<tr>
<td class="org-left">Socket(s)</td>
<td class="org-left">CPU packages</td>
</tr>

<tr>
<td class="org-left">Thread(s) per core</td>
<td class="org-left">SMT/Hyperthreading</td>
</tr>

<tr>
<td class="org-left">NUMA node(s)</td>
<td class="org-left">memory locality domains</td>
</tr>
</tbody>
</table>

<p>
This information becomes important for:
</p>

<ul class="org-ul">
<li>task placement</li>
<li>thread pinning</li>
<li>NUMA optimization</li>
<li>cache locality</li>
</ul>
</div>
</div>
<div id="outline-container-org57a45f2" class="outline-3">
<h3 id="org57a45f2"><span class="section-number-3">19.6.</span> CPU Affinity Validation Program</h3>
<div class="outline-text-3" id="text-19-6">
<p>
Program used to validate CPU placement:
</p>

<div class="org-src-container">
<pre class="src src-C"><code>#define _GNU_SOURCE

#include &lt;stdio.h&gt;
#include &lt;sched.h&gt;
#include &lt;unistd.h&gt;

int main() {

    int cpu = sched_getcpu();

    printf("Process running on CPU: %d\n", cpu);

    sleep(20);

    return 0;
}
</code></pre>
</div>

<p>
Compile:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>gcc affinity.c -o affinity
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
The program asks Linux:
</p>

<pre class="example" id="orgc64918b">
Which CPU core am I running on?
</pre>

<p>
This helps visualize scheduler-controlled CPU placement.
</p>
</div>
</div>
<div id="outline-container-orgd8d92dd" class="outline-3">
<h3 id="orgd8d92dd"><span class="section-number-3">19.7.</span> Distributed CPU Placement Test</h3>
<div class="outline-text-3" id="text-19-7">
<p>
Slurm batch script:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>#!/bin/bash
#SBATCH -N 2
#SBATCH --ntasks-per-node=1
#SBATCH --job-name=affinity
#SBATCH --output=%j.out
#SBATCH --error=%j.err
#SBATCH --time=00:01:00

srun ./affinity
</code></pre>
</div>

<p>
Submit:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sbatch affinity.sh
</code></pre>
</div>

<p>
Observed behavior:
</p>

<pre class="example" id="org5011b04">
Process running on CPU: 0
Process running on CPU: 0
</pre>

<p>
IMPORTANT:
</p>

<p>
CPU numbering is local to each node.
</p>

<p>
Meaning:
</p>

<ul class="org-ul">
<li>compute01 has CPU0</li>
<li>compute02 also has CPU0</li>
</ul>

<p>
Each node maintains independent CPU numbering.
</p>

<p>
This is an important distributed-system concept.
</p>
</div>
</div>
<div id="outline-container-org0f6c9e6" class="outline-3">
<h3 id="org0f6c9e6"><span class="section-number-3">19.8.</span> Multiple Task Placement Test</h3>
<div class="outline-text-3" id="text-19-8">
<p>
Modified batch script:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>#!/bin/bash
#SBATCH -N 2
#SBATCH --ntasks-per-node=2
#SBATCH --job-name=affinity
#SBATCH --output=%j.out
#SBATCH --error=%j.err
#SBATCH --time=00:01:00

srun ./affinity
</code></pre>
</div>

<p>
Observed behavior:
</p>

<pre class="example" id="org19bf6c8">
Process running on CPU: 0
Process running on CPU: 1
Process running on CPU: 1
Process running on CPU: 0
</pre>

<p>
This validates:
</p>

<ul class="org-ul">
<li>task distribution across cores</li>
<li>scheduler-controlled placement</li>
<li>multi-core resource allocation</li>
</ul>

<p>
Each node distributed tasks across available CPUs.
</p>
</div>
</div>
<div id="outline-container-org442ba7b" class="outline-3">
<h3 id="org442ba7b"><span class="section-number-3">19.9.</span> Explicit CPU Binding</h3>
<div class="outline-text-3" id="text-19-9">
<p>
Explicit CPU binding script:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>#!/bin/bash
#SBATCH -N 1
#SBATCH --ntasks=2
#SBATCH --cpus-per-task=1
#SBATCH --job-name=bindtest
#SBATCH --output=%j.out
#SBATCH --error=%j.err
#SBATCH --time=00:01:00

srun --cpu-bind=cores ./affinity
</code></pre>
</div>

<p>
Submit:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sbatch bind.sh
</code></pre>
</div>

<p>
Observed behavior:
</p>

<pre class="example" id="org8b9fa7d">
Process running on CPU: 0
Process running on CPU: 1
</pre>

<p>
This validates:
</p>

<ul class="org-ul">
<li>explicit CPU pinning</li>
<li>deterministic CPU placement</li>
<li>Slurm affinity control</li>
<li>Linux scheduler cooperation</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org1f3b503"></a>IMPORTANT CONCEPT<br />
<div class="outline-text-4" id="text-19-9-1">
<p>
Without:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>--cpu-bind=cores
</code></pre>
</div>

<p>
Linux may migrate processes between CPUs.
</p>

<p>
With explicit binding:
</p>

<ul class="org-ul">
<li>processes stay pinned</li>
<li>cache locality improves</li>
<li>performance stabilizes</li>
</ul>

<p>
This becomes extremely important for:
</p>

<ul class="org-ul">
<li>MPI scaling</li>
<li>OpenMP scaling</li>
<li>hybrid MPI/OpenMP execution</li>
<li>NUMA systems</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgbc23133" class="outline-3">
<h3 id="orgbc23133"><span class="section-number-3">19.10.</span> Slurm Accounting Database Setup</h3>
<div class="outline-text-3" id="text-19-10">
<p>
Goal:
</p>

<p>
Transform Slurm from:
</p>

<pre class="example" id="org98eddba">
basic scheduler
</pre>

<p>
into:
</p>

<pre class="example" id="orge3aa378">
persistent accounting-aware scheduler
</pre>

<p>
This phase introduced:
</p>

<ul class="org-ul">
<li>MariaDB backend</li>
<li>Slurm accounting daemon</li>
<li>persistent job history</li>
<li>resource usage tracking</li>
<li>scheduler accounting infrastructure</li>
</ul>
</div>
</div>
