README.org
** Install MariaDB

Performed ONLY on master node.

Install packages:

#+begin_src bash
sudo dnf install -y mariadb-server mariadb
#+end_src

Enable and start service:

#+begin_src bash
sudo systemctl enable --now mariadb
#+end_src

Verify:

#+begin_src bash
sudo systemctl status mariadb
#+end_src

Expected:

#+begin_example
active (running)
#+end_example

** Secure MariaDB

Run:

#+begin_src bash
sudo mysql_secure_installation
#+end_src

Recommended configuration:

| Question                             | Recommended Answer |
|--------------------------------------+--------------------|
| Switch to unix_socket authentication | no                 |
| Change root password                 | optional           |
| Remove anonymous users               | yes                |
| Disallow remote root login           | yes                |
| Remove test database                 | yes                |
| Reload privileges                    | yes                |

** Create Slurm Accounting Database

Enter MariaDB:

#+begin_src bash
sudo mysql -u root -p
#+end_src

Create database:

#+begin_src sql
CREATE DATABASE slurm_acct_db;
#+end_src

Create Slurm database user:

#+begin_src sql
CREATE USER 'slurm'@'localhost' IDENTIFIED BY 'slurmdbpass';
#+end_src

Grant permissions:

#+begin_src sql
GRANT ALL PRIVILEGES ON slurm_acct_db.* TO 'slurm'@'localhost';
#+end_src

Apply changes:

#+begin_src sql
FLUSH PRIVILEGES;
#+end_src

Exit:

#+begin_src sql
EXIT;
#+end_src

** Install Slurm Accounting Daemon

Install:

#+begin_src bash
sudo dnf install -y slurm-slurmdbd
#+end_src

Purpose:

Installs:

#+begin_example
slurmdbd
#+end_example

which connects:

- Slurm scheduler
- accounting database
- resource tracking infrastructure

** Configure slurmdbd

Create configuration:

#+begin_src bash
sudo vim /etc/slurm/slurmdbd.conf
#+end_src

Configuration:

#+begin_src ini
AuthType=auth/munge

DbdHost=master
DbdPort=6819

SlurmUser=slurm

DebugLevel=info
LogFile=/var/log/slurmdbd.log
PidFile=/run/slurmdbd.pid

StorageType=accounting_storage/mysql
StorageHost=localhost
StoragePort=3306
StorageUser=slurm
StoragePass=slurmdbpass
StorageLoc=slurm_acct_db
#+end_src

*** IMPORTANT SECURITY STEP

Protect configuration file:

#+begin_src bash
sudo chown slurm:slurm /etc/slurm/slurmdbd.conf
sudo chmod 600 /etc/slurm/slurmdbd.conf
#+end_src

Reason:

Database credentials are stored inside the file.

Production systems always restrict access to this configuration.

** Connect Slurm With Accounting System

Modify:

#+begin_src bash
sudo vim /etc/slurm/slurm.conf
#+end_src

Add:

#+begin_src ini
AccountingStorageType=accounting_storage/slurmdbd
AccountingStorageHost=master
AccountingStoragePort=6819
JobAcctGatherType=jobacct_gather/linux
#+end_src

Purpose:

Enable:

- persistent job accounting
- resource tracking
- historical scheduler data

** Restart Slurm Services

Restart accounting daemon on master:

#+begin_src bash
sudo systemctl enable --now slurmdbd
#+end_src

Verify:

#+begin_src bash
sudo systemctl status slurmdbd
#+end_src

Expected:

#+begin_example
active (running)
#+end_example

Restart Slurm controller:

#+begin_src bash
sudo systemctl restart slurmctld
#+end_src

Restart compute daemons:

#+begin_src bash
ssh compute01 sudo -S systemctl restart slurmd
ssh compute02 sudo -S systemctl restart slurmd
ssh compute03 sudo -S systemctl restart slurmd
#+end_src

** Verify Accounting Infrastructure

Check cluster:

#+begin_src bash
sinfo
#+end_src

Expected:

#+begin_example
compute[01-03] idle
#+end_example

Check accounting cluster registration:

#+begin_src bash
sacctmgr list cluster
#+end_src

Expected:

#+begin_example
hpccluster
#+end_example

** Verify Persistent Job Accounting

Submit MPI job:

#+begin_src bash
sbatch submit.sh a.out
#+end_src

Check scheduler queue:

#+begin_src bash
squeue --me
#+end_src

Check accounting history:

#+begin_src bash
sacct
#+end_src

Observed output:

#+begin_example
JobID           JobName  Partition    AllocCPUS      State
22                 test      debug             4  COMPLETED
22.batch          batch                       2  COMPLETED
22.0              prted                       2  COMPLETED
#+end_example

This validates:

- persistent accounting
- resource tracking
- MPI runtime tracking
- scheduler database integration

** IMPORTANT MPI Accounting Observation

Accounting now tracks internal execution hierarchy:

|    Entry | Meaning              |
|----------+----------------------|
|       22 | main job             |
| 22.batch | batch execution step |
|     22.0 | MPI runtime launcher |

This provides deeper visibility into scheduler behavior and runtime
execution structure.

