README.html
<div id="outline-container-org3a1cda0" class="outline-3">
<h3 id="org3a1cda0"><span class="section-number-3">19.11.</span> Install MariaDB</h3>
<div class="outline-text-3" id="text-19-11">
<p>
Performed ONLY on master node.
</p>

<p>
Install packages:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo dnf install -y mariadb-server mariadb
</code></pre>
</div>

<p>
Enable and start service:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl enable --now mariadb
</code></pre>
</div>

<p>
Verify:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl status mariadb
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgdd7f7f3">
active (running)
</pre>
</div>
</div>
<div id="outline-container-org51fec97" class="outline-3">
<h3 id="org51fec97"><span class="section-number-3">19.12.</span> Secure MariaDB</h3>
<div class="outline-text-3" id="text-19-12">
<p>
Run:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo mysql_secure_installation
</code></pre>
</div>

<p>
Recommended configuration:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Question</th>
<th scope="col" class="org-left">Recommended Answer</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Switch to unix_socket authentication</td>
<td class="org-left">no</td>
</tr>

<tr>
<td class="org-left">Change root password</td>
<td class="org-left">optional</td>
</tr>

<tr>
<td class="org-left">Remove anonymous users</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">Disallow remote root login</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">Remove test database</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">Reload privileges</td>
<td class="org-left">yes</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org59a7317" class="outline-3">
<h3 id="org59a7317"><span class="section-number-3">19.13.</span> Create Slurm Accounting Database</h3>
<div class="outline-text-3" id="text-19-13">
<p>
Enter MariaDB:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo mysql -u root -p
</code></pre>
</div>

<p>
Create database:
</p>

<div class="org-src-container">
<pre class="src src-sql"><code>CREATE DATABASE slurm_acct_db;
</code></pre>
</div>

<p>
Create Slurm database user:
</p>

<div class="org-src-container">
<pre class="src src-sql"><code>CREATE USER 'slurm'@'localhost' IDENTIFIED BY 'slurmdbpass';
</code></pre>
</div>

<p>
Grant permissions:
</p>

<div class="org-src-container">
<pre class="src src-sql"><code>GRANT ALL PRIVILEGES ON slurm_acct_db.* TO 'slurm'@'localhost';
</code></pre>
</div>

<p>
Apply changes:
</p>

<div class="org-src-container">
<pre class="src src-sql"><code>FLUSH PRIVILEGES;
</code></pre>
</div>

<p>
Exit:
</p>

<div class="org-src-container">
<pre class="src src-sql"><code>EXIT;
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org251e479" class="outline-3">
<h3 id="org251e479"><span class="section-number-3">19.14.</span> Install Slurm Accounting Daemon</h3>
<div class="outline-text-3" id="text-19-14">
<p>
Install:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo dnf install -y slurm-slurmdbd
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Installs:
</p>

<pre class="example" id="orga806417">
slurmdbd
</pre>

<p>
which connects:
</p>

<ul class="org-ul">
<li>Slurm scheduler</li>
<li>accounting database</li>
<li>resource tracking infrastructure</li>
</ul>
</div>
</div>
<div id="outline-container-orga98ca3f" class="outline-3">
<h3 id="orga98ca3f"><span class="section-number-3">19.15.</span> Configure slurmdbd</h3>
<div class="outline-text-3" id="text-19-15">
<p>
Create configuration:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/slurm/slurmdbd.conf
</code></pre>
</div>

<p>
Configuration:
</p>

<div class="org-src-container">
<pre class="src src-ini"><code>AuthType=auth/munge

DbdHost=master
DbdPort=6819

SlurmUser=slurm

DebugLevel=info
LogFile=/var/log/slurmdbd.log
PidFile=/run/slurmdbd.pid

StorageType=accounting_storage/mysql
StorageHost=localhost
StoragePort=3306
StorageUser=slurm
StoragePass=slurmdbpass
StorageLoc=slurm_acct_db
</code></pre>
</div>
</div>
<ol class="org-ol">
<li><a id="org3c5f721"></a>IMPORTANT SECURITY STEP<br />
<div class="outline-text-4" id="text-19-15-1">
<p>
Protect configuration file:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo chown slurm:slurm /etc/slurm/slurmdbd.conf
sudo chmod 600 /etc/slurm/slurmdbd.conf
</code></pre>
</div>

<p>
Reason:
</p>

<p>
Database credentials are stored inside the file.
</p>

<p>
Production systems always restrict access to this configuration.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org4c1ac6a" class="outline-3">
<h3 id="org4c1ac6a"><span class="section-number-3">19.16.</span> Connect Slurm With Accounting System</h3>
<div class="outline-text-3" id="text-19-16">
<p>
Modify:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/slurm/slurm.conf
</code></pre>
</div>

<p>
Add:
</p>

<div class="org-src-container">
<pre class="src src-ini"><code>AccountingStorageType=accounting_storage/slurmdbd
AccountingStorageHost=master
AccountingStoragePort=6819
JobAcctGatherType=jobacct_gather/linux
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Enable:
</p>

<ul class="org-ul">
<li>persistent job accounting</li>
<li>resource tracking</li>
<li>historical scheduler data</li>
</ul>
</div>
</div>
<div id="outline-container-org781dd63" class="outline-3">
<h3 id="org781dd63"><span class="section-number-3">19.17.</span> Restart Slurm Services</h3>
<div class="outline-text-3" id="text-19-17">
<p>
Restart accounting daemon on master:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl enable --now slurmdbd
</code></pre>
</div>

<p>
Verify:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl status slurmdbd
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org4f064e7">
active (running)
</pre>

<p>
Restart Slurm controller:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl restart slurmctld
</code></pre>
</div>

<p>
Restart compute daemons:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ssh compute01 sudo -S systemctl restart slurmd
ssh compute02 sudo -S systemctl restart slurmd
ssh compute03 sudo -S systemctl restart slurmd
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org8d6d02d" class="outline-3">
<h3 id="org8d6d02d"><span class="section-number-3">19.18.</span> Verify Accounting Infrastructure</h3>
<div class="outline-text-3" id="text-19-18">
<p>
Check cluster:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sinfo
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgf6c60c0">
compute[01-03] idle
</pre>

<p>
Check accounting cluster registration:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sacctmgr list cluster
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org7d8b738">
hpccluster
</pre>
</div>
</div>
<div id="outline-container-orgd403ad2" class="outline-3">
<h3 id="orgd403ad2"><span class="section-number-3">19.19.</span> Verify Persistent Job Accounting</h3>
<div class="outline-text-3" id="text-19-19">
<p>
Submit MPI job:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sbatch submit.sh a.out
</code></pre>
</div>

<p>
Check scheduler queue:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>squeue --me
</code></pre>
</div>

<p>
Check accounting history:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sacct
</code></pre>
</div>

<p>
Observed output:
</p>

<pre class="example" id="org0ea4dc8">
JobID           JobName  Partition    AllocCPUS      State
22                 test      debug             4  COMPLETED
22.batch          batch                       2  COMPLETED
22.0              prted                       2  COMPLETED
</pre>

<p>
This validates:
</p>

<ul class="org-ul">
<li>persistent accounting</li>
<li>resource tracking</li>
<li>MPI runtime tracking</li>
<li>scheduler database integration</li>
</ul>
</div>
</div>
<div id="outline-container-org266057e" class="outline-3">
<h3 id="org266057e"><span class="section-number-3">19.20.</span> IMPORTANT MPI Accounting Observation</h3>
<div class="outline-text-3" id="text-19-20">
<p>
Accounting now tracks internal execution hierarchy:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Entry</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">22</td>
<td class="org-left">main job</td>
</tr>

<tr>
<td class="org-right">22.batch</td>
<td class="org-left">batch execution step</td>
</tr>

<tr>
<td class="org-right">22.0</td>
<td class="org-left">MPI runtime launcher</td>
</tr>
</tbody>
</table>

<p>
This provides deeper visibility into scheduler behavior and runtime
execution structure.
</p>
</div>
</div>
