README.org
** Current Cluster Capability

The cluster now supports:

| Feature                   | Status  |
|---------------------------+---------|
| Multinode scheduling      | Working |
| MPI execution             | Working |
| LDAP authentication       | Working |
| Shared filesystem         | Working |
| Spack software stack      | Working |
| Resource-aware scheduling | Working |
| Memory-aware scheduling   | Working |
| CPU affinity              | Working |
| Explicit CPU binding      | Working |
| Slurm accounting database | Working |
| Persistent job history    | Working |
| Resource tracking         | Working |

The cluster has now evolved from a basic educational setup into a much
more realistic HPC infrastructure environment.
* QoS + User Limits + Scheduling Policies

This phase extends the Slurm scheduler from:

#+begin_example
resource-aware scheduling
#+end_example

into:

#+begin_example
policy-aware scheduling
#+end_example

At this stage, the cluster already supported:

- multinode scheduling
- MPI execution
- LDAP authentication
- shared filesystem
- shared Spack software stack
- resource-aware scheduling
- CPU affinity
- persistent Slurm accounting

The goal of this phase was to introduce:

- user policies
- scheduler limits
- QoS enforcement
- runtime restrictions
- fair resource sharing

without introducing kernel-level runtime instability.

** IMPORTANT CONCEPT

Before this phase:

Slurm could:

- schedule resources
- track jobs
- track users
- record accounting information

BUT it could NOT yet:

- enforce user policies
- restrict CPU usage
- limit runtime
- prevent resource abuse

This phase enables:

#+begin_example
policy-aware scheduling
#+end_example

similar to real production HPC systems.

** IMPORTANT Slurm Scheduling Hierarchy

Slurm scheduling hierarchy:

#+begin_example
Cluster
 └── Account
      └── User
           └── QoS
#+end_example

Production HPC systems commonly organize users using:

- projects
- research groups
- departments
- labs

called:

#+begin_example
Accounts
#+end_example

Users are then associated with:

- accounts
- QoS policies
- scheduler limits

** Existing Stable Accounting Infrastructure

Before enabling QoS enforcement, the following components were already
working:

| Component            | Status  |
|----------------------+---------|
| MariaDB              | Working |
| slurmdbd             | Working |
| sacct                | Working |
| Persistent accounting| Working |
| Job history tracking | Working |
| Resource tracking    | Working |

This provided the required foundation for policy enforcement.

** Understanding QoS

QoS stands for:

#+begin_example
Quality of Service
#+end_example

QoS controls:

- maximum CPUs
- maximum jobs
- walltime limits
- scheduler priorities
- resource restrictions
- policy enforcement

Production HPC clusters heavily rely on QoS to maintain fairness and
prevent abuse.

** IMPORTANT QoS Concept

QoS does NOT directly enforce kernel-level runtime isolation.

Instead, it performs:

#+begin_example
scheduler-side policy enforcement
#+end_example

Meaning:

Slurm scheduler decides:

- whether jobs may start
- whether jobs remain pending
- whether limits are exceeded

WITHOUT requiring:

#+begin_example
task/cgroup
#+end_example

or strict kernel enforcement.

This keeps the cluster significantly more stable while still enabling
realistic scheduler policies.

** Verify Cluster Registration

Before creating accounts and policies, verify cluster registration.

Run on:

- login node
- or master node

#+begin_src bash
sacctmgr list cluster
#+end_src

Expected:

#+begin_example
hpccluster
#+end_example

Purpose:

Verifies:

- accounting database connectivity
- slurmdbd functionality
- cluster accounting registration

** Create Slurm Account

Accounts represent:

- research groups
- projects
- departments
- user groups

Create a general account.

Run on master node:

#+begin_src bash
sudo sacctmgr add account general
#+end_src

Verify:

#+begin_src bash
sacctmgr list account
#+end_src

Expected:

#+begin_example
general
#+end_example

** IMPORTANT Account Concept

Linux users and Slurm accounts are NOT the same thing.

Linux users provide:

#+begin_example
authentication identity
#+end_example

Slurm accounts provide:

#+begin_example
scheduler policy grouping
#+end_example

This distinction is extremely important in production HPC systems.

** Add Users to Slurm Accounting

LDAP users already existed in Linux.

However, Slurm accounting ALSO requires user associations.

Example user:

#+begin_example
rishi
#+end_example

Run on master node:

#+begin_src bash
sudo sacctmgr add user rishi account=general
#+end_src

Add additional users if needed:

#+begin_src bash
sudo sacctmgr add user hpcadmin account=general
#+end_src

Verify associations:

#+begin_src bash
sacctmgr list user
#+end_src

Expected:

Users associated with:

#+begin_example
general
#+end_example

** Create QoS Policy

Create QoS policy named:

#+begin_example
normal
#+end_example

Run on master node:

#+begin_src bash
sudo sacctmgr add qos normal
#+end_src

Verify:

#+begin_src bash
sacctmgr list qos
#+end_src

Expected:

#+begin_example
normal
#+end_example

