README.html
<div id="outline-container-org8b9221b" class="outline-3">
<h3 id="org8b9221b"><span class="section-number-3">19.21.</span> Current Cluster Capability</h3>
<div class="outline-text-3" id="text-19-21">
<p>
The cluster now supports:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">Status</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Multinode scheduling</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">MPI execution</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">LDAP authentication</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Shared filesystem</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Spack software stack</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Resource-aware scheduling</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Memory-aware scheduling</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">CPU affinity</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Explicit CPU binding</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Slurm accounting database</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Persistent job history</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Resource tracking</td>
<td class="org-left">Working</td>
</tr>
</tbody>
</table>

<p>
The cluster has now evolved from a basic educational setup into a much
more realistic HPC infrastructure environment.
</p>
</div>
</div>
</div>
<div id="outline-container-org975fbc8" class="outline-2">
<h2 id="org975fbc8"><span class="section-number-2">20.</span> QoS + User Limits + Scheduling Policies</h2>
<div class="outline-text-2" id="text-20">
<p>
This phase extends the Slurm scheduler from:
</p>

<pre class="example" id="org5693e7c">
resource-aware scheduling
</pre>

<p>
into:
</p>

<pre class="example" id="org27ec346">
policy-aware scheduling
</pre>

<p>
At this stage, the cluster already supported:
</p>

<ul class="org-ul">
<li>multinode scheduling</li>
<li>MPI execution</li>
<li>LDAP authentication</li>
<li>shared filesystem</li>
<li>shared Spack software stack</li>
<li>resource-aware scheduling</li>
<li>CPU affinity</li>
<li>persistent Slurm accounting</li>
</ul>

<p>
The goal of this phase was to introduce:
</p>

<ul class="org-ul">
<li>user policies</li>
<li>scheduler limits</li>
<li>QoS enforcement</li>
<li>runtime restrictions</li>
<li>fair resource sharing</li>
</ul>

<p>
without introducing kernel-level runtime instability.
</p>
</div>
<div id="outline-container-org180f062" class="outline-3">
<h3 id="org180f062"><span class="section-number-3">20.1.</span> IMPORTANT CONCEPT</h3>
<div class="outline-text-3" id="text-20-1">
<p>
Before this phase:
</p>

<p>
Slurm could:
</p>

<ul class="org-ul">
<li>schedule resources</li>
<li>track jobs</li>
<li>track users</li>
<li>record accounting information</li>
</ul>

<p>
BUT it could NOT yet:
</p>

<ul class="org-ul">
<li>enforce user policies</li>
<li>restrict CPU usage</li>
<li>limit runtime</li>
<li>prevent resource abuse</li>
</ul>

<p>
This phase enables:
</p>

<pre class="example" id="orge963d01">
policy-aware scheduling
</pre>

<p>
similar to real production HPC systems.
</p>
</div>
</div>
<div id="outline-container-org0890e0f" class="outline-3">
<h3 id="org0890e0f"><span class="section-number-3">20.2.</span> IMPORTANT Slurm Scheduling Hierarchy</h3>
<div class="outline-text-3" id="text-20-2">
<p>
Slurm scheduling hierarchy:
</p>

<pre class="example" id="org3ef41c6">
Cluster
 └── Account
      └── User
           └── QoS
</pre>

<p>
Production HPC systems commonly organize users using:
</p>

<ul class="org-ul">
<li>projects</li>
<li>research groups</li>
<li>departments</li>
<li>labs</li>
</ul>

<p>
called:
</p>

<pre class="example" id="orgf543042">
Accounts
</pre>

<p>
Users are then associated with:
</p>

<ul class="org-ul">
<li>accounts</li>
<li>QoS policies</li>
<li>scheduler limits</li>
</ul>
</div>
</div>
<div id="outline-container-orgf95e884" class="outline-3">
<h3 id="orgf95e884"><span class="section-number-3">20.3.</span> Existing Stable Accounting Infrastructure</h3>
<div class="outline-text-3" id="text-20-3">
<p>
Before enabling QoS enforcement, the following components were already
working:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Component</th>
<th scope="col" class="org-left">Status</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">MariaDB</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">slurmdbd</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">sacct</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Persistent accounting</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Job history tracking</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Resource tracking</td>
<td class="org-left">Working</td>
</tr>
</tbody>
</table>

<p>
This provided the required foundation for policy enforcement.
</p>
</div>
</div>
<div id="outline-container-org4c709e0" class="outline-3">
<h3 id="org4c709e0"><span class="section-number-3">20.4.</span> Understanding QoS</h3>
<div class="outline-text-3" id="text-20-4">
<p>
QoS stands for:
</p>

<pre class="example" id="orga080cda">
Quality of Service
</pre>

<p>
QoS controls:
</p>

<ul class="org-ul">
<li>maximum CPUs</li>
<li>maximum jobs</li>
<li>walltime limits</li>
<li>scheduler priorities</li>
<li>resource restrictions</li>
<li>policy enforcement</li>
</ul>

<p>
Production HPC clusters heavily rely on QoS to maintain fairness and
prevent abuse.
</p>
</div>
</div>
<div id="outline-container-org8c79203" class="outline-3">
<h3 id="org8c79203"><span class="section-number-3">20.5.</span> IMPORTANT QoS Concept</h3>
<div class="outline-text-3" id="text-20-5">
<p>
QoS does NOT directly enforce kernel-level runtime isolation.
</p>

<p>
Instead, it performs:
</p>

<pre class="example" id="orge75a594">
scheduler-side policy enforcement
</pre>

<p>
Meaning:
</p>

<p>
Slurm scheduler decides:
</p>

<ul class="org-ul">
<li>whether jobs may start</li>
<li>whether jobs remain pending</li>
<li>whether limits are exceeded</li>
</ul>

<p>
WITHOUT requiring:
</p>

<pre class="example" id="org7f3b34a">
task/cgroup
</pre>

<p>
or strict kernel enforcement.
</p>

<p>
This keeps the cluster significantly more stable while still enabling
realistic scheduler policies.
</p>
</div>
</div>
<div id="outline-container-orgd27d8f0" class="outline-3">
<h3 id="orgd27d8f0"><span class="section-number-3">20.6.</span> Verify Cluster Registration</h3>
<div class="outline-text-3" id="text-20-6">
<p>
Before creating accounts and policies, verify cluster registration.
</p>

<p>
Run on:
</p>

<ul class="org-ul">
<li>login node</li>
<li>or master node</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><code>sacctmgr list cluster
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org156cd90">
hpccluster
</pre>

<p>
Purpose:
</p>

<p>
Verifies:
</p>

<ul class="org-ul">
<li>accounting database connectivity</li>
<li>slurmdbd functionality</li>
<li>cluster accounting registration</li>
</ul>
</div>
</div>
<div id="outline-container-orgaff746d" class="outline-3">
<h3 id="orgaff746d"><span class="section-number-3">20.7.</span> Create Slurm Account</h3>
<div class="outline-text-3" id="text-20-7">
<p>
Accounts represent:
</p>

<ul class="org-ul">
<li>research groups</li>
<li>projects</li>
<li>departments</li>
<li>user groups</li>
</ul>

<p>
Create a general account.
</p>

<p>
Run on master node:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo sacctmgr add account general
</code></pre>
</div>

<p>
Verify:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sacctmgr list account
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orga20831a">
general
</pre>
</div>
</div>
<div id="outline-container-orgd0df1c7" class="outline-3">
<h3 id="orgd0df1c7"><span class="section-number-3">20.8.</span> IMPORTANT Account Concept</h3>
<div class="outline-text-3" id="text-20-8">
<p>
Linux users and Slurm accounts are NOT the same thing.
</p>

<p>
Linux users provide:
</p>

<pre class="example" id="org5e73161">
authentication identity
</pre>

<p>
Slurm accounts provide:
</p>

<pre class="example" id="orgd06adb1">
scheduler policy grouping
</pre>

<p>
This distinction is extremely important in production HPC systems.
</p>
</div>
</div>
<div id="outline-container-org4267767" class="outline-3">
<h3 id="org4267767"><span class="section-number-3">20.9.</span> Add Users to Slurm Accounting</h3>
<div class="outline-text-3" id="text-20-9">
<p>
LDAP users already existed in Linux.
</p>

<p>
However, Slurm accounting ALSO requires user associations.
</p>

<p>
Example user:
</p>

<pre class="example" id="orga211dcd">
rishi
</pre>

<p>
Run on master node:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo sacctmgr add user rishi account=general
</code></pre>
</div>

<p>
Add additional users if needed:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo sacctmgr add user hpcadmin account=general
</code></pre>
</div>

<p>
Verify associations:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sacctmgr list user
</code></pre>
</div>

<p>
Expected:
</p>

<p>
Users associated with:
</p>

<pre class="example" id="org278047f">
general
</pre>
</div>
</div>
<div id="outline-container-org02bfc89" class="outline-3">
<h3 id="org02bfc89"><span class="section-number-3">20.10.</span> Create QoS Policy</h3>
<div class="outline-text-3" id="text-20-10">
<p>
Create QoS policy named:
</p>

<pre class="example" id="org6b50822">
normal
</pre>

<p>
Run on master node:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo sacctmgr add qos normal
</code></pre>
</div>

<p>
Verify:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sacctmgr list qos
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org4790e7f">
normal
</pre>
</div>
</div>
