README.org
** Configure QoS Limits

The following limits were configured.

*** Maximum Concurrent CPUs

Run:

#+begin_src bash
sudo sacctmgr modify qos normal set MaxTRESPerUser=cpu=4
#+end_src

Purpose:

Limit each user to:

#+begin_example
maximum 4 CPUs simultaneously
#+end_example

IMPORTANT:

This controls:

#+begin_example
active running resource usage
#+end_example

NOT:

- total submissions
- queued jobs
- single-job submission ability

*** Maximum Concurrent Running Jobs

Run:

#+begin_src bash
sudo sacctmgr modify qos normal set MaxJobsPerUser=2
#+end_src

Purpose:

Limit users to:

#+begin_example
maximum 2 running jobs
#+end_example

Additional jobs remain pending.

*** Maximum Walltime

Run:

#+begin_src bash
sudo sacctmgr modify qos normal set MaxWall=01:00:00
#+end_src

Purpose:

Restrict maximum job runtime to:

#+begin_example
1 hour
#+end_example

Jobs requesting larger runtime remain pending.

** Attach QoS to Account

Connect QoS policy to account.

Run:

#+begin_src bash
sudo sacctmgr modify account general set qos=normal
#+end_src

Purpose:

Users associated with:

#+begin_example
general
#+end_example

now inherit:

#+begin_example
normal
#+end_example

QoS policies.

** Verify Associations

Verify:

- user associations
- account associations
- QoS assignments

Run:

#+begin_src bash
sacctmgr show assoc
#+end_src

Purpose:

Displays:

- users
- accounts
- partitions
- qos assignments

** IMPORTANT ISSUE FACED

Initially, QoS appeared to exist correctly:

- QoS visible
- associations visible
- accounting working
- job tracking working

BUT:

#+begin_example
policy enforcement was NOT working
#+end_example

Jobs exceeding configured CPU limits still executed successfully.

Example:

#+begin_example
MaxTRESPerUser=cpu=4
#+end_example

BUT:

#+begin_example
6 CPU jobs still executed
#+end_example

This revealed an extremely important missing scheduler configuration.

** Root Cause of QoS Enforcement Failure

The following line was missing from:

#+begin_example
/etc/slurm/slurm.conf
#+end_example

Missing configuration:

#+begin_src ini
AccountingStorageEnforce=limits,qos
#+end_src

Without this line:

- accounting works
- sacct works
- qos appears correctly
- associations appear correctly

BUT:

#+begin_example
scheduler policies are NOT enforced
#+end_example

This is one of the most common beginner Slurm configuration mistakes.

** Enable QoS Enforcement

Edit configuration on master node:

#+begin_src bash
sudo vim /etc/slurm/slurm.conf
#+end_src

Add:

#+begin_src ini
AccountingStorageEnforce=limits,qos
#+end_src

Recommended placement:

Near existing accounting configuration:

#+begin_src ini
AccountingStorageType=accounting_storage/slurmdbd
AccountingStorageHost=master
AccountingStoragePort=6819
JobAcctGatherType=jobacct_gather/linux
#+end_src

** IMPORTANT Enforcement Concept

This line enables actual scheduler-side enforcement for:

- qos limits
- account limits
- user policies
- scheduler restrictions

Without:

#+begin_example
AccountingStorageEnforce
#+end_example

QoS becomes informational only.

** Distribute Updated Configuration

Copy updated configuration from master node:

#+begin_src bash
scp /etc/slurm/slurm.conf login:/tmp/
scp /etc/slurm/slurm.conf compute01:/tmp/
scp /etc/slurm/slurm.conf compute02:/tmp/
scp /etc/slurm/slurm.conf compute03:/tmp/
#+end_src

Move configuration into place on login node:

#+begin_src bash
sudo mv /tmp/slurm.conf /etc/slurm/
#+end_src

Move configuration into place on compute nodes:

#+begin_src bash
ssh compute01 sudo -S mv /tmp/slurm.conf /etc/slurm/
ssh compute02 sudo -S mv /tmp/slurm.conf /etc/slurm/
ssh compute03 sudo -S mv /tmp/slurm.conf /etc/slurm/
#+end_src

** Restart Slurm Services

Restart controller on master node:

#+begin_src bash
sudo systemctl restart slurmctld
#+end_src

Restart compute daemons:

#+begin_src bash
ssh compute01 sudo -S systemctl restart slurmd
ssh compute02 sudo -S systemctl restart slurmd
ssh compute03 sudo -S systemctl restart slurmd
#+end_src

Purpose:

Reload updated scheduler policy configuration.

** Verify Cluster Health

Run:

#+begin_src bash
sinfo
#+end_src

Expected:

#+begin_example
compute[01-03] idle
#+end_example

This validates:

- scheduler stability
- successful configuration reload
- healthy compute nodes

** Verify QoS Enforcement

*** CPU Limit Validation

Job requesting:

#+begin_example
6 CPUs
#+end_example

using:

#+begin_src bash
#SBATCH -N 3
#SBATCH --ntasks-per-node=2
#SBATCH --ntasks=6
#+end_src

was submitted.

Observed scheduler behavior:

#+begin_example
PENDING
Reason=QOSMaxCpuPerUserLimit
#+end_example

This validates:

- active QoS enforcement
- CPU limit enforcement
- scheduler-side policy restriction

*** IMPORTANT CPU QoS Concept

#+begin_src ini
MaxTRESPerUser=cpu=4
#+end_src

means:

#+begin_example
maximum ACTIVE running CPUs simultaneously
#+end_example

NOT:

- maximum job submissions
- maximum queued jobs
- maximum CPUs requested in scripts

This distinction is extremely important.

** Verify Valid CPU Allocation

Job requesting:

#+begin_example
4 CPUs
#+end_example

using:

#+begin_src bash
#SBATCH -N 2
#SBATCH --ntasks-per-node=2
#+end_src

executed successfully.

Observed output:

#+begin_example
SLURM_NTASKS=4
SLURM_JOB_NUM_NODES=2
SLURM_CPUS_ON_NODE=2
#+end_example

This validates:

- multinode allocation
- scheduler variable propagation
- QoS-aware MPI execution
- proper CPU accounting

