README.html
<div id="outline-container-orgef4cf62" class="outline-3">
<h3 id="orgef4cf62"><span class="section-number-3">20.11.</span> Configure QoS Limits</h3>
<div class="outline-text-3" id="text-20-11">
<p>
The following limits were configured.
</p>
</div>
<ol class="org-ol">
<li><a id="org7a592e5"></a>Maximum Concurrent CPUs<br />
<div class="outline-text-4" id="text-20-11-1">
<p>
Run:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo sacctmgr modify qos normal set MaxTRESPerUser=cpu=4
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Limit each user to:
</p>

<pre class="example" id="org84930ea">
maximum 4 CPUs simultaneously
</pre>

<p>
IMPORTANT:
</p>

<p>
This controls:
</p>

<pre class="example" id="orgcb03519">
active running resource usage
</pre>

<p>
NOT:
</p>

<ul class="org-ul">
<li>total submissions</li>
<li>queued jobs</li>
<li>single-job submission ability</li>
</ul>
</div>
</li>
<li><a id="org5881c7a"></a>Maximum Concurrent Running Jobs<br />
<div class="outline-text-4" id="text-20-11-2">
<p>
Run:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo sacctmgr modify qos normal set MaxJobsPerUser=2
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Limit users to:
</p>

<pre class="example" id="org279977d">
maximum 2 running jobs
</pre>

<p>
Additional jobs remain pending.
</p>
</div>
</li>
<li><a id="org5c33597"></a>Maximum Walltime<br />
<div class="outline-text-4" id="text-20-11-3">
<p>
Run:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo sacctmgr modify qos normal set MaxWall=01:00:00
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Restrict maximum job runtime to:
</p>

<pre class="example" id="org7382a6a">
1 hour
</pre>

<p>
Jobs requesting larger runtime remain pending.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org77b2abd" class="outline-3">
<h3 id="org77b2abd"><span class="section-number-3">20.12.</span> Attach QoS to Account</h3>
<div class="outline-text-3" id="text-20-12">
<p>
Connect QoS policy to account.
</p>

<p>
Run:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo sacctmgr modify account general set qos=normal
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Users associated with:
</p>

<pre class="example" id="org6d73943">
general
</pre>

<p>
now inherit:
</p>

<pre class="example" id="org8fccf38">
normal
</pre>

<p>
QoS policies.
</p>
</div>
</div>
<div id="outline-container-org234266f" class="outline-3">
<h3 id="org234266f"><span class="section-number-3">20.13.</span> Verify Associations</h3>
<div class="outline-text-3" id="text-20-13">
<p>
Verify:
</p>

<ul class="org-ul">
<li>user associations</li>
<li>account associations</li>
<li>QoS assignments</li>
</ul>

<p>
Run:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sacctmgr show assoc
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Displays:
</p>

<ul class="org-ul">
<li>users</li>
<li>accounts</li>
<li>partitions</li>
<li>qos assignments</li>
</ul>
</div>
</div>
<div id="outline-container-org5a303f3" class="outline-3">
<h3 id="org5a303f3"><span class="section-number-3">20.14.</span> IMPORTANT ISSUE FACED</h3>
<div class="outline-text-3" id="text-20-14">
<p>
Initially, QoS appeared to exist correctly:
</p>

<ul class="org-ul">
<li>QoS visible</li>
<li>associations visible</li>
<li>accounting working</li>
<li>job tracking working</li>
</ul>

<p>
BUT:
</p>

<pre class="example" id="orge09fedf">
policy enforcement was NOT working
</pre>

<p>
Jobs exceeding configured CPU limits still executed successfully.
</p>

<p>
Example:
</p>

<pre class="example" id="org30174d0">
MaxTRESPerUser=cpu=4
</pre>

<p>
BUT:
</p>

<pre class="example" id="org6012b09">
6 CPU jobs still executed
</pre>

<p>
This revealed an extremely important missing scheduler configuration.
</p>
</div>
</div>
<div id="outline-container-org5537c34" class="outline-3">
<h3 id="org5537c34"><span class="section-number-3">20.15.</span> Root Cause of QoS Enforcement Failure</h3>
<div class="outline-text-3" id="text-20-15">
<p>
The following line was missing from:
</p>

<pre class="example" id="org8000019">
/etc/slurm/slurm.conf
</pre>

<p>
Missing configuration:
</p>

<div class="org-src-container">
<pre class="src src-ini"><code>AccountingStorageEnforce=limits,qos
</code></pre>
</div>

<p>
Without this line:
</p>

<ul class="org-ul">
<li>accounting works</li>
<li>sacct works</li>
<li>qos appears correctly</li>
<li>associations appear correctly</li>
</ul>

<p>
BUT:
</p>

<pre class="example" id="org3d65878">
scheduler policies are NOT enforced
</pre>

<p>
This is one of the most common beginner Slurm configuration mistakes.
</p>
</div>
</div>
<div id="outline-container-orge6f8644" class="outline-3">
<h3 id="orge6f8644"><span class="section-number-3">20.16.</span> Enable QoS Enforcement</h3>
<div class="outline-text-3" id="text-20-16">
<p>
Edit configuration on master node:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo vim /etc/slurm/slurm.conf
</code></pre>
</div>

<p>
Add:
</p>

<div class="org-src-container">
<pre class="src src-ini"><code>AccountingStorageEnforce=limits,qos
</code></pre>
</div>

<p>
Recommended placement:
</p>

<p>
Near existing accounting configuration:
</p>

<div class="org-src-container">
<pre class="src src-ini"><code>AccountingStorageType=accounting_storage/slurmdbd
AccountingStorageHost=master
AccountingStoragePort=6819
JobAcctGatherType=jobacct_gather/linux
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org739c0ac" class="outline-3">
<h3 id="org739c0ac"><span class="section-number-3">20.17.</span> IMPORTANT Enforcement Concept</h3>
<div class="outline-text-3" id="text-20-17">
<p>
This line enables actual scheduler-side enforcement for:
</p>

<ul class="org-ul">
<li>qos limits</li>
<li>account limits</li>
<li>user policies</li>
<li>scheduler restrictions</li>
</ul>

<p>
Without:
</p>

<pre class="example" id="orgc3dc9c4">
AccountingStorageEnforce
</pre>

<p>
QoS becomes informational only.
</p>
</div>
</div>
<div id="outline-container-org8f7e3e8" class="outline-3">
<h3 id="org8f7e3e8"><span class="section-number-3">20.18.</span> Distribute Updated Configuration</h3>
<div class="outline-text-3" id="text-20-18">
<p>
Copy updated configuration from master node:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>scp /etc/slurm/slurm.conf login:/tmp/
scp /etc/slurm/slurm.conf compute01:/tmp/
scp /etc/slurm/slurm.conf compute02:/tmp/
scp /etc/slurm/slurm.conf compute03:/tmp/
</code></pre>
</div>

<p>
Move configuration into place on login node:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo mv /tmp/slurm.conf /etc/slurm/
</code></pre>
</div>

<p>
Move configuration into place on compute nodes:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ssh compute01 sudo -S mv /tmp/slurm.conf /etc/slurm/
ssh compute02 sudo -S mv /tmp/slurm.conf /etc/slurm/
ssh compute03 sudo -S mv /tmp/slurm.conf /etc/slurm/
</code></pre>
</div>
</div>
</div>
<div id="outline-container-orgae20f4e" class="outline-3">
<h3 id="orgae20f4e"><span class="section-number-3">20.19.</span> Restart Slurm Services</h3>
<div class="outline-text-3" id="text-20-19">
<p>
Restart controller on master node:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl restart slurmctld
</code></pre>
</div>

<p>
Restart compute daemons:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>ssh compute01 sudo -S systemctl restart slurmd
ssh compute02 sudo -S systemctl restart slurmd
ssh compute03 sudo -S systemctl restart slurmd
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Reload updated scheduler policy configuration.
</p>
</div>
</div>
<div id="outline-container-org57c6b22" class="outline-3">
<h3 id="org57c6b22"><span class="section-number-3">20.20.</span> Verify Cluster Health</h3>
<div class="outline-text-3" id="text-20-20">
<p>
Run:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sinfo
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org869e3ac">
compute[01-03] idle
</pre>

<p>
This validates:
</p>

<ul class="org-ul">
<li>scheduler stability</li>
<li>successful configuration reload</li>
<li>healthy compute nodes</li>
</ul>
</div>
</div>
<div id="outline-container-org604ac90" class="outline-3">
<h3 id="org604ac90"><span class="section-number-3">20.21.</span> Verify QoS Enforcement</h3>
<div class="outline-text-3" id="text-20-21">
</div>
<ol class="org-ol">
<li><a id="org64ae10f"></a>CPU Limit Validation<br />
<div class="outline-text-4" id="text-20-21-1">
<p>
Job requesting:
</p>

<pre class="example" id="org885a861">
6 CPUs
</pre>

<p>
using:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>#SBATCH -N 3
#SBATCH --ntasks-per-node=2
#SBATCH --ntasks=6
</code></pre>
</div>

<p>
was submitted.
</p>

<p>
Observed scheduler behavior:
</p>

<pre class="example" id="org7a6c0c1">
PENDING
Reason=QOSMaxCpuPerUserLimit
</pre>

<p>
This validates:
</p>

<ul class="org-ul">
<li>active QoS enforcement</li>
<li>CPU limit enforcement</li>
<li>scheduler-side policy restriction</li>
</ul>
</div>
</li>
<li><a id="orgcd7cc68"></a>IMPORTANT CPU QoS Concept<br />
<div class="outline-text-4" id="text-20-21-2">
<div class="org-src-container">
<pre class="src src-ini"><code>MaxTRESPerUser=cpu=4
</code></pre>
</div>

<p>
means:
</p>

<pre class="example" id="org3d7f2c4">
maximum ACTIVE running CPUs simultaneously
</pre>

<p>
NOT:
</p>

<ul class="org-ul">
<li>maximum job submissions</li>
<li>maximum queued jobs</li>
<li>maximum CPUs requested in scripts</li>
</ul>

<p>
This distinction is extremely important.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org0bbc5ef" class="outline-3">
<h3 id="org0bbc5ef"><span class="section-number-3">20.22.</span> Verify Valid CPU Allocation</h3>
<div class="outline-text-3" id="text-20-22">
<p>
Job requesting:
</p>

<pre class="example" id="orgea1bf76">
4 CPUs
</pre>

<p>
using:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>#SBATCH -N 2
#SBATCH --ntasks-per-node=2
</code></pre>
</div>

<p>
executed successfully.
</p>

<p>
Observed output:
</p>

<pre class="example" id="org033e329">
SLURM_NTASKS=4
SLURM_JOB_NUM_NODES=2
SLURM_CPUS_ON_NODE=2
</pre>

<p>
This validates:
</p>

<ul class="org-ul">
<li>multinode allocation</li>
<li>scheduler variable propagation</li>
<li>QoS-aware MPI execution</li>
<li>proper CPU accounting</li>
</ul>
</div>
</div>
