README.org
** IMPORTANT MPI + QoS Integration

MPI jobs remained fully functional while QoS policies were enforced.

This validates successful integration between:

- Slurm scheduler
- QoS policies
- multinode scheduling
- MPI runtime
- resource accounting

** Verify Walltime Enforcement

Job script modified:

#+begin_src bash
#SBATCH --time=02:00:00
#+end_src

Observed scheduler behavior:

#+begin_example
PENDING
Reason=QOSMaxWallDurationPerJobLimit
#+end_example

This validates:

- runtime limit enforcement
- scheduler-side walltime policy control

** IMPORTANT Pending Queue Concept

QoS-restricted jobs are usually:

#+begin_example
queued and pending
#+end_example

NOT:

#+begin_example
immediately rejected
#+end_example

This is standard production HPC scheduler behavior.

Scheduler explains pending reason using:

#+begin_src bash
squeue --me
#+end_src

or:

#+begin_src bash
scontrol show job <jobid>
#+end_src

This greatly improves scheduler transparency.

** Inspect QoS Configuration

View configured QoS settings:

#+begin_src bash
sacctmgr show qos normal
#+end_src

Observed configuration:

#+begin_example
MaxWall=01:00:00
MaxTRESPU=cpu=4
MaxJobsPU=2
#+end_example

This validates:

- correct QoS policy configuration
- scheduler policy persistence
- accounting database integration

** IMPORTANT Scheduler Layers

The cluster now supports multiple scheduler layers simultaneously.

| Layer               | Purpose                          |
|---------------------+----------------------------------|
| Resource scheduling | CPU and memory allocation        |
| Affinity scheduling | CPU placement and pinning        |
| Accounting          | Persistent job/resource tracking |
| Policy enforcement  | User and QoS restrictions        |

This architecture is significantly closer to real production HPC
clusters.

** Current Cluster Capability

The cluster now supports:

| Feature                        | Status  |
|--------------------------------+---------|
| Multinode scheduling           | Working |
| MPI execution                  | Working |
| LDAP authentication            | Working |
| Shared filesystem              | Working |
| Spack software stack           | Working |
| Resource-aware scheduling      | Working |
| CPU affinity                   | Working |
| Persistent accounting          | Working |
| QoS enforcement                | Working |
| User limits                    | Working |
| CPU policy enforcement         | Working |
| Walltime policy enforcement    | Working |
| Multi-user scheduling policies | Working |

The cluster has now evolved into a significantly more realistic
multi-user HPC scheduling environment.
* Validation and Verification of Advanced Slurm Configuration and QoS

This section validates all advanced Slurm scheduler features configured
during the setup process.

The purpose of validation is to ensure:

- scheduler stability
- correct resource tracking
- proper QoS enforcement
- multinode execution
- MPI integration
- accounting consistency
- policy-aware scheduling behavior

All validation steps were tested practically on the configured cluster.

** Cluster Validation State

At the time of validation, the cluster already supported:

| Feature | Status |
|----------+--------|
| Slurm scheduler | Working |
| Multinode scheduling | Working |
| MPI execution | Working |
| LDAP authentication | Working |
| Shared filesystem | Working |
| Spack software stack | Working |
| Resource-aware scheduling | Working |
| CPU affinity | Working |
| Accounting database | Working |
| QoS enforcement | Working |

This validation phase ensures all components function together correctly.

** Verify Cluster Health

Run on login node:

#+begin_src bash
sinfo
#+end_src

Expected:

#+begin_example
PARTITION AVAIL  TIMELIMIT  NODES  STATE NODELIST
debug*       up   infinite      3   idle compute[01-03]
#+end_example

Purpose:

Verifies:

- scheduler communication
- node availability
- slurmd daemon health
- cluster operational state

IMPORTANT:

Nodes should NOT show:

- drain
- down
- fail
- unknown

during normal operation.

** Verify Node Resource Recognition

Run:

#+begin_src bash
scontrol show node compute01
#+end_src

Important fields:

#+begin_example
CPUTot=2
RealMemory=1200
CfgTRES=cpu=2,mem=1200M
#+end_example

Purpose:

Validates:

- CPU detection
- memory-aware scheduling
- TRES resource tracking
- scheduler resource recognition

This confirms Slurm now understands:

- schedulable CPUs
- schedulable memory
- consumable resources

instead of only node allocation.

** Verify Accounting Infrastructure

Run:

#+begin_src bash
sudo systemctl status mariadb
#+end_src

Expected:

#+begin_example
active (running)
#+end_example

Purpose:

Validates accounting database backend.

Verify accounting daemon:

#+begin_src bash
sudo systemctl status slurmdbd
#+end_src

Expected:

#+begin_example
active (running)
#+end_example

Purpose:

Validates:

- Slurm database daemon
- scheduler/accounting communication
- persistent accounting infrastructure

