README.html
<div id="outline-container-orgf8d9570" class="outline-3">
<h3 id="orgf8d9570"><span class="section-number-3">20.23.</span> IMPORTANT MPI + QoS Integration</h3>
<div class="outline-text-3" id="text-20-23">
<p>
MPI jobs remained fully functional while QoS policies were enforced.
</p>

<p>
This validates successful integration between:
</p>

<ul class="org-ul">
<li>Slurm scheduler</li>
<li>QoS policies</li>
<li>multinode scheduling</li>
<li>MPI runtime</li>
<li>resource accounting</li>
</ul>
</div>
</div>
<div id="outline-container-orgc70a43d" class="outline-3">
<h3 id="orgc70a43d"><span class="section-number-3">20.24.</span> Verify Walltime Enforcement</h3>
<div class="outline-text-3" id="text-20-24">
<p>
Job script modified:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>#SBATCH --time=02:00:00
</code></pre>
</div>

<p>
Observed scheduler behavior:
</p>

<pre class="example" id="orgbc02c79">
PENDING
Reason=QOSMaxWallDurationPerJobLimit
</pre>

<p>
This validates:
</p>

<ul class="org-ul">
<li>runtime limit enforcement</li>
<li>scheduler-side walltime policy control</li>
</ul>
</div>
</div>
<div id="outline-container-org06b019b" class="outline-3">
<h3 id="org06b019b"><span class="section-number-3">20.25.</span> IMPORTANT Pending Queue Concept</h3>
<div class="outline-text-3" id="text-20-25">
<p>
QoS-restricted jobs are usually:
</p>

<pre class="example" id="org2a2b74f">
queued and pending
</pre>

<p>
NOT:
</p>

<pre class="example" id="org6ccd0f9">
immediately rejected
</pre>

<p>
This is standard production HPC scheduler behavior.
</p>

<p>
Scheduler explains pending reason using:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>squeue --me
</code></pre>
</div>

<p>
or:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>scontrol show job &lt;jobid&gt;
</code></pre>
</div>

<p>
This greatly improves scheduler transparency.
</p>
</div>
</div>
<div id="outline-container-org0e1c5d3" class="outline-3">
<h3 id="org0e1c5d3"><span class="section-number-3">20.26.</span> Inspect QoS Configuration</h3>
<div class="outline-text-3" id="text-20-26">
<p>
View configured QoS settings:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sacctmgr show qos normal
</code></pre>
</div>

<p>
Observed configuration:
</p>

<pre class="example" id="org00bcc04">
MaxWall=01:00:00
MaxTRESPU=cpu=4
MaxJobsPU=2
</pre>

<p>
This validates:
</p>

<ul class="org-ul">
<li>correct QoS policy configuration</li>
<li>scheduler policy persistence</li>
<li>accounting database integration</li>
</ul>
</div>
</div>
<div id="outline-container-org7a84ff2" class="outline-3">
<h3 id="org7a84ff2"><span class="section-number-3">20.27.</span> IMPORTANT Scheduler Layers</h3>
<div class="outline-text-3" id="text-20-27">
<p>
The cluster now supports multiple scheduler layers simultaneously.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Layer</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Resource scheduling</td>
<td class="org-left">CPU and memory allocation</td>
</tr>

<tr>
<td class="org-left">Affinity scheduling</td>
<td class="org-left">CPU placement and pinning</td>
</tr>

<tr>
<td class="org-left">Accounting</td>
<td class="org-left">Persistent job/resource tracking</td>
</tr>

<tr>
<td class="org-left">Policy enforcement</td>
<td class="org-left">User and QoS restrictions</td>
</tr>
</tbody>
</table>

<p>
This architecture is significantly closer to real production HPC
clusters.
</p>
</div>
</div>
<div id="outline-container-org0f72752" class="outline-3">
<h3 id="org0f72752"><span class="section-number-3">20.28.</span> Current Cluster Capability</h3>
<div class="outline-text-3" id="text-20-28">
<p>
The cluster now supports:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">Status</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Multinode scheduling</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">MPI execution</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">LDAP authentication</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Shared filesystem</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Spack software stack</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Resource-aware scheduling</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">CPU affinity</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Persistent accounting</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">QoS enforcement</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">User limits</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">CPU policy enforcement</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Walltime policy enforcement</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Multi-user scheduling policies</td>
<td class="org-left">Working</td>
</tr>
</tbody>
</table>

<p>
The cluster has now evolved into a significantly more realistic
multi-user HPC scheduling environment.
</p>
</div>
</div>
</div>
<div id="outline-container-orgfb5def5" class="outline-2">
<h2 id="orgfb5def5"><span class="section-number-2">21.</span> Validation and Verification of Advanced Slurm Configuration and QoS</h2>
<div class="outline-text-2" id="text-21">
<p>
This section validates all advanced Slurm scheduler features configured
during the setup process.
</p>

<p>
The purpose of validation is to ensure:
</p>

<ul class="org-ul">
<li>scheduler stability</li>
<li>correct resource tracking</li>
<li>proper QoS enforcement</li>
<li>multinode execution</li>
<li>MPI integration</li>
<li>accounting consistency</li>
<li>policy-aware scheduling behavior</li>
</ul>

<p>
All validation steps were tested practically on the configured cluster.
</p>
</div>
<div id="outline-container-org5a29988" class="outline-3">
<h3 id="org5a29988"><span class="section-number-3">21.1.</span> Cluster Validation State</h3>
<div class="outline-text-3" id="text-21-1">
<p>
At the time of validation, the cluster already supported:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">Status</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Slurm scheduler</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Multinode scheduling</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">MPI execution</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">LDAP authentication</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Shared filesystem</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Spack software stack</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Resource-aware scheduling</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">CPU affinity</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Accounting database</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">QoS enforcement</td>
<td class="org-left">Working</td>
</tr>
</tbody>
</table>

<p>
This validation phase ensures all components function together correctly.
</p>
</div>
</div>
<div id="outline-container-org59b89a7" class="outline-3">
<h3 id="org59b89a7"><span class="section-number-3">21.2.</span> Verify Cluster Health</h3>
<div class="outline-text-3" id="text-21-2">
<p>
Run on login node:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sinfo
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org7f3cb88">
PARTITION AVAIL  TIMELIMIT  NODES  STATE NODELIST
debug*       up   infinite      3   idle compute[01-03]
</pre>

<p>
Purpose:
</p>

<p>
Verifies:
</p>

<ul class="org-ul">
<li>scheduler communication</li>
<li>node availability</li>
<li>slurmd daemon health</li>
<li>cluster operational state</li>
</ul>

<p>
IMPORTANT:
</p>

<p>
Nodes should NOT show:
</p>

<ul class="org-ul">
<li>drain</li>
<li>down</li>
<li>fail</li>
<li>unknown</li>
</ul>

<p>
during normal operation.
</p>
</div>
</div>
<div id="outline-container-orgd931f3b" class="outline-3">
<h3 id="orgd931f3b"><span class="section-number-3">21.3.</span> Verify Node Resource Recognition</h3>
<div class="outline-text-3" id="text-21-3">
<p>
Run:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>scontrol show node compute01
</code></pre>
</div>

<p>
Important fields:
</p>

<pre class="example" id="org73ba700">
CPUTot=2
RealMemory=1200
CfgTRES=cpu=2,mem=1200M
</pre>

<p>
Purpose:
</p>

<p>
Validates:
</p>

<ul class="org-ul">
<li>CPU detection</li>
<li>memory-aware scheduling</li>
<li>TRES resource tracking</li>
<li>scheduler resource recognition</li>
</ul>

<p>
This confirms Slurm now understands:
</p>

<ul class="org-ul">
<li>schedulable CPUs</li>
<li>schedulable memory</li>
<li>consumable resources</li>
</ul>

<p>
instead of only node allocation.
</p>
</div>
</div>
<div id="outline-container-orgc886217" class="outline-3">
<h3 id="orgc886217"><span class="section-number-3">21.4.</span> Verify Accounting Infrastructure</h3>
<div class="outline-text-3" id="text-21-4">
<p>
Run:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl status mariadb
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orge145f3d">
active (running)
</pre>

<p>
Purpose:
</p>

<p>
Validates accounting database backend.
</p>

<p>
Verify accounting daemon:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sudo systemctl status slurmdbd
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgf1c4215">
active (running)
</pre>

<p>
Purpose:
</p>

<p>
Validates:
</p>

<ul class="org-ul">
<li>Slurm database daemon</li>
<li>scheduler/accounting communication</li>
<li>persistent accounting infrastructure</li>
</ul>
</div>
</div>
