README.org
** Verify Cluster Accounting Registration

Run:

#+begin_src bash
sacctmgr list cluster
#+end_src

Expected:

#+begin_example
hpccluster
#+end_example

Purpose:

Verifies:

- cluster registration
- accounting database connectivity
- slurmdbd integration

** Verify Accounts and User Associations

Run:

#+begin_src bash
sacctmgr show assoc
#+end_src

Expected:

#+begin_example
Cluster    Account    User    Partition    QOS
hpccluster general    rishi               normal
#+end_example

Purpose:

Validates:

- Slurm account creation
- user associations
- QoS assignments
- scheduler policy hierarchy

** Verify QoS Configuration

Run:

#+begin_src bash
sacctmgr show qos normal
#+end_src

Expected:

#+begin_example
MaxWall=01:00:00
MaxTRESPU=cpu=4
MaxJobsPU=2
#+end_example

Purpose:

Validates:

- QoS creation
- CPU limits
- runtime limits
- job count limits

** IMPORTANT Validation Issue Faced

Initially:

- QoS existed
- associations existed
- accounting worked
- jobs tracked correctly

BUT:

#+begin_example
scheduler policies were NOT enforced
#+end_example

Jobs exceeding configured CPU limits still executed successfully.

Example:

#+begin_example
MaxTRESPU=cpu=4
#+end_example

BUT:

#+begin_example
6 CPU jobs still executed
#+end_example

This revealed a missing scheduler enforcement configuration.

** Root Cause Analysis

The following configuration was missing:

#+begin_src ini
AccountingStorageEnforce=limits,qos
#+end_src

inside:

#+begin_example
/etc/slurm/slurm.conf
#+end_example

Without this line:

- accounting works
- sacct works
- qos visible
- associations visible

BUT:

#+begin_example
scheduler-side policy enforcement remains disabled
#+end_example

This is one of the most common Slurm QoS configuration mistakes.

** Fix Applied

Added to:

#+begin_example
/etc/slurm/slurm.conf
#+end_example

#+begin_src ini
AccountingStorageEnforce=limits,qos
#+end_src

Then:

- distributed configuration to all nodes
- restarted slurmctld
- restarted slurmd daemons

This enabled actual policy enforcement.

** MPI Validation Program

The following MPI-based parallel array summation program was used for
validation.

Program characteristics:

- MPI parallel execution
- multinode communication
- distributed workload
- scheduler-aware execution
- CPU resource consumption

Compilation:

#+begin_src bash
mpicc arrSum.c -o a.out
#+end_src

Purpose:

Generate realistic MPI workloads for scheduler validation.

** Validation Job Script

Validation batch script:

#+begin_src bash
#!/bin/bash
#SBATCH -N 2
#SBATCH --ntasks-per-node=2
#SBATCH --job-name=test
#SBATCH --output=%J.out
#SBATCH --error=%J.err
#SBATCH --time=00:10:00

source /apps/spack/share/spack/setup-env.sh
spack load openmpi

echo "SLURM_NTASKS=$SLURM_NTASKS"
echo "SLURM_JOB_NUM_NODES=$SLURM_JOB_NUM_NODES"
echo "SLURM_CPUS_ON_NODE=$SLURM_CPUS_ON_NODE"

mpirun -np $SLURM_NTASKS ./a.out
#+end_src

Purpose:

Validates:

- multinode scheduling
- MPI integration
- scheduler environment variables
- CPU allocation
- QoS-aware execution

** Verify Successful MPI Execution

Submit job:

#+begin_src bash
sbatch submit.sh
#+end_src

Monitor queue:

#+begin_src bash
squeue --me
#+end_src

Expected:

#+begin_example
RUNNING
#+end_example

Purpose:

Verifies:

- scheduler functionality
- multinode allocation
- successful MPI execution

** Verify Scheduler Environment Variables

Observed output:

#+begin_example
SLURM_NTASKS=4
SLURM_JOB_NUM_NODES=2
SLURM_CPUS_ON_NODE=2
#+end_example

This validates:

- correct CPU allocation
- correct task allocation
- proper multinode scheduling
- scheduler environment propagation

** Verify CPU QoS Enforcement

Modified job script:

#+begin_src bash
#SBATCH -N 3
#SBATCH --ntasks-per-node=2
#SBATCH --ntasks=6
#+end_src

Requested resources:

#+begin_example
6 CPUs
#+end_example

Configured QoS limit:

#+begin_example
MaxTRESPU=cpu=4
#+end_example

Observed scheduler behavior:

#+begin_example
PENDING
Reason=QOSMaxCpuPerUserLimit
#+end_example

Purpose:

Validates:

- CPU policy enforcement
- active QoS restriction
- scheduler-side resource control

** IMPORTANT CPU QoS Concept

#+begin_src ini
MaxTRESPU=cpu=4
#+end_src

means:

#+begin_example
maximum ACTIVE running CPUs simultaneously
#+end_example

NOT:

- maximum submitted jobs
- maximum queued jobs
- maximum CPUs requested in scripts

This distinction is extremely important.

** Verify Walltime Enforcement

Modified batch script:

#+begin_src bash
#SBATCH --time=02:00:00
#+end_src

Configured QoS limit:

#+begin_example
MaxWall=01:00:00
#+end_example

Observed scheduler behavior:

#+begin_example
PENDING
Reason=QOSMaxWallDurationPerJobLimit
#+end_example

Purpose:

Validates:

- runtime limit enforcement
- walltime policy enforcement
- scheduler-side runtime restriction

** Verify Job Count Enforcement

Configured:

#+begin_example
MaxJobsPU=2
#+end_example

Submitted multiple jobs:

#+begin_src bash
sbatch submit.sh
sbatch submit.sh
sbatch submit.sh
#+end_src

Observed behavior:

- first jobs execute
- additional jobs remain pending

Purpose:

Validates:

- concurrent job restriction
- scheduler fairness policy
- user job limit enforcement

