README.html
<div id="outline-container-orgc360d3d" class="outline-3">
<h3 id="orgc360d3d"><span class="section-number-3">21.5.</span> Verify Cluster Accounting Registration</h3>
<div class="outline-text-3" id="text-21-5">
<p>
Run:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sacctmgr list cluster
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="orgc11e40d">
hpccluster
</pre>

<p>
Purpose:
</p>

<p>
Verifies:
</p>

<ul class="org-ul">
<li>cluster registration</li>
<li>accounting database connectivity</li>
<li>slurmdbd integration</li>
</ul>
</div>
</div>
<div id="outline-container-orgcdc4b08" class="outline-3">
<h3 id="orgcdc4b08"><span class="section-number-3">21.6.</span> Verify Accounts and User Associations</h3>
<div class="outline-text-3" id="text-21-6">
<p>
Run:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sacctmgr show assoc
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org4cfe586">
Cluster    Account    User    Partition    QOS
hpccluster general    rishi               normal
</pre>

<p>
Purpose:
</p>

<p>
Validates:
</p>

<ul class="org-ul">
<li>Slurm account creation</li>
<li>user associations</li>
<li>QoS assignments</li>
<li>scheduler policy hierarchy</li>
</ul>
</div>
</div>
<div id="outline-container-orgd440f7c" class="outline-3">
<h3 id="orgd440f7c"><span class="section-number-3">21.7.</span> Verify QoS Configuration</h3>
<div class="outline-text-3" id="text-21-7">
<p>
Run:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sacctmgr show qos normal
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org6a6d44b">
MaxWall=01:00:00
MaxTRESPU=cpu=4
MaxJobsPU=2
</pre>

<p>
Purpose:
</p>

<p>
Validates:
</p>

<ul class="org-ul">
<li>QoS creation</li>
<li>CPU limits</li>
<li>runtime limits</li>
<li>job count limits</li>
</ul>
</div>
</div>
<div id="outline-container-org8849a89" class="outline-3">
<h3 id="org8849a89"><span class="section-number-3">21.8.</span> IMPORTANT Validation Issue Faced</h3>
<div class="outline-text-3" id="text-21-8">
<p>
Initially:
</p>

<ul class="org-ul">
<li>QoS existed</li>
<li>associations existed</li>
<li>accounting worked</li>
<li>jobs tracked correctly</li>
</ul>

<p>
BUT:
</p>

<pre class="example" id="org2602feb">
scheduler policies were NOT enforced
</pre>

<p>
Jobs exceeding configured CPU limits still executed successfully.
</p>

<p>
Example:
</p>

<pre class="example" id="org1bd425d">
MaxTRESPU=cpu=4
</pre>

<p>
BUT:
</p>

<pre class="example" id="org5a8912f">
6 CPU jobs still executed
</pre>

<p>
This revealed a missing scheduler enforcement configuration.
</p>
</div>
</div>
<div id="outline-container-orgb1b4049" class="outline-3">
<h3 id="orgb1b4049"><span class="section-number-3">21.9.</span> Root Cause Analysis</h3>
<div class="outline-text-3" id="text-21-9">
<p>
The following configuration was missing:
</p>

<div class="org-src-container">
<pre class="src src-ini"><code>AccountingStorageEnforce=limits,qos
</code></pre>
</div>

<p>
inside:
</p>

<pre class="example" id="org369901e">
/etc/slurm/slurm.conf
</pre>

<p>
Without this line:
</p>

<ul class="org-ul">
<li>accounting works</li>
<li>sacct works</li>
<li>qos visible</li>
<li>associations visible</li>
</ul>

<p>
BUT:
</p>

<pre class="example" id="org19ce149">
scheduler-side policy enforcement remains disabled
</pre>

<p>
This is one of the most common Slurm QoS configuration mistakes.
</p>
</div>
</div>
<div id="outline-container-orgb4d59ee" class="outline-3">
<h3 id="orgb4d59ee"><span class="section-number-3">21.10.</span> Fix Applied</h3>
<div class="outline-text-3" id="text-21-10">
<p>
Added to:
</p>

<pre class="example" id="org38edb90">
/etc/slurm/slurm.conf
</pre>

<div class="org-src-container">
<pre class="src src-ini"><code>AccountingStorageEnforce=limits,qos
</code></pre>
</div>

<p>
Then:
</p>

<ul class="org-ul">
<li>distributed configuration to all nodes</li>
<li>restarted slurmctld</li>
<li>restarted slurmd daemons</li>
</ul>

<p>
This enabled actual policy enforcement.
</p>
</div>
</div>
<div id="outline-container-org772b76c" class="outline-3">
<h3 id="org772b76c"><span class="section-number-3">21.11.</span> MPI Validation Program</h3>
<div class="outline-text-3" id="text-21-11">
<p>
The following MPI-based parallel array summation program was used for
validation.
</p>

<p>
Program characteristics:
</p>

<ul class="org-ul">
<li>MPI parallel execution</li>
<li>multinode communication</li>
<li>distributed workload</li>
<li>scheduler-aware execution</li>
<li>CPU resource consumption</li>
</ul>

<p>
Compilation:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>mpicc arrSum.c -o a.out
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Generate realistic MPI workloads for scheduler validation.
</p>
</div>
</div>
<div id="outline-container-org142cfb6" class="outline-3">
<h3 id="org142cfb6"><span class="section-number-3">21.12.</span> Validation Job Script</h3>
<div class="outline-text-3" id="text-21-12">
<p>
Validation batch script:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>#!/bin/bash
#SBATCH -N 2
#SBATCH --ntasks-per-node=2
#SBATCH --job-name=test
#SBATCH --output=%J.out
#SBATCH --error=%J.err
#SBATCH --time=00:10:00

source /apps/spack/share/spack/setup-env.sh
spack load openmpi

echo "SLURM_NTASKS=$SLURM_NTASKS"
echo "SLURM_JOB_NUM_NODES=$SLURM_JOB_NUM_NODES"
echo "SLURM_CPUS_ON_NODE=$SLURM_CPUS_ON_NODE"

mpirun -np $SLURM_NTASKS ./a.out
</code></pre>
</div>

<p>
Purpose:
</p>

<p>
Validates:
</p>

<ul class="org-ul">
<li>multinode scheduling</li>
<li>MPI integration</li>
<li>scheduler environment variables</li>
<li>CPU allocation</li>
<li>QoS-aware execution</li>
</ul>
</div>
</div>
<div id="outline-container-orgb3d67c1" class="outline-3">
<h3 id="orgb3d67c1"><span class="section-number-3">21.13.</span> Verify Successful MPI Execution</h3>
<div class="outline-text-3" id="text-21-13">
<p>
Submit job:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sbatch submit.sh
</code></pre>
</div>

<p>
Monitor queue:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>squeue --me
</code></pre>
</div>

<p>
Expected:
</p>

<pre class="example" id="org7dd90c3">
RUNNING
</pre>

<p>
Purpose:
</p>

<p>
Verifies:
</p>

<ul class="org-ul">
<li>scheduler functionality</li>
<li>multinode allocation</li>
<li>successful MPI execution</li>
</ul>
</div>
</div>
<div id="outline-container-orgde470c1" class="outline-3">
<h3 id="orgde470c1"><span class="section-number-3">21.14.</span> Verify Scheduler Environment Variables</h3>
<div class="outline-text-3" id="text-21-14">
<p>
Observed output:
</p>

<pre class="example" id="org97cca28">
SLURM_NTASKS=4
SLURM_JOB_NUM_NODES=2
SLURM_CPUS_ON_NODE=2
</pre>

<p>
This validates:
</p>

<ul class="org-ul">
<li>correct CPU allocation</li>
<li>correct task allocation</li>
<li>proper multinode scheduling</li>
<li>scheduler environment propagation</li>
</ul>
</div>
</div>
<div id="outline-container-org7fa2009" class="outline-3">
<h3 id="org7fa2009"><span class="section-number-3">21.15.</span> Verify CPU QoS Enforcement</h3>
<div class="outline-text-3" id="text-21-15">
<p>
Modified job script:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>#SBATCH -N 3
#SBATCH --ntasks-per-node=2
#SBATCH --ntasks=6
</code></pre>
</div>

<p>
Requested resources:
</p>

<pre class="example" id="org2722479">
6 CPUs
</pre>

<p>
Configured QoS limit:
</p>

<pre class="example" id="orga91ccd8">
MaxTRESPU=cpu=4
</pre>

<p>
Observed scheduler behavior:
</p>

<pre class="example" id="org4c6b5ad">
PENDING
Reason=QOSMaxCpuPerUserLimit
</pre>

<p>
Purpose:
</p>

<p>
Validates:
</p>

<ul class="org-ul">
<li>CPU policy enforcement</li>
<li>active QoS restriction</li>
<li>scheduler-side resource control</li>
</ul>
</div>
</div>
<div id="outline-container-org1c427bd" class="outline-3">
<h3 id="org1c427bd"><span class="section-number-3">21.16.</span> IMPORTANT CPU QoS Concept</h3>
<div class="outline-text-3" id="text-21-16">
<div class="org-src-container">
<pre class="src src-ini"><code>MaxTRESPU=cpu=4
</code></pre>
</div>

<p>
means:
</p>

<pre class="example" id="org6da30fc">
maximum ACTIVE running CPUs simultaneously
</pre>

<p>
NOT:
</p>

<ul class="org-ul">
<li>maximum submitted jobs</li>
<li>maximum queued jobs</li>
<li>maximum CPUs requested in scripts</li>
</ul>

<p>
This distinction is extremely important.
</p>
</div>
</div>
<div id="outline-container-org2ebef0a" class="outline-3">
<h3 id="org2ebef0a"><span class="section-number-3">21.17.</span> Verify Walltime Enforcement</h3>
<div class="outline-text-3" id="text-21-17">
<p>
Modified batch script:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>#SBATCH --time=02:00:00
</code></pre>
</div>

<p>
Configured QoS limit:
</p>

<pre class="example" id="org0c8f54e">
MaxWall=01:00:00
</pre>

<p>
Observed scheduler behavior:
</p>

<pre class="example" id="org2cb87d2">
PENDING
Reason=QOSMaxWallDurationPerJobLimit
</pre>

<p>
Purpose:
</p>

<p>
Validates:
</p>

<ul class="org-ul">
<li>runtime limit enforcement</li>
<li>walltime policy enforcement</li>
<li>scheduler-side runtime restriction</li>
</ul>
</div>
</div>
<div id="outline-container-org7d50808" class="outline-3">
<h3 id="org7d50808"><span class="section-number-3">21.18.</span> Verify Job Count Enforcement</h3>
<div class="outline-text-3" id="text-21-18">
<p>
Configured:
</p>

<pre class="example" id="orgbcb9e15">
MaxJobsPU=2
</pre>

<p>
Submitted multiple jobs:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sbatch submit.sh
sbatch submit.sh
sbatch submit.sh
</code></pre>
</div>

<p>
Observed behavior:
</p>

<ul class="org-ul">
<li>first jobs execute</li>
<li>additional jobs remain pending</li>
</ul>

<p>
Purpose:
</p>

<p>
Validates:
</p>

<ul class="org-ul">
<li>concurrent job restriction</li>
<li>scheduler fairness policy</li>
<li>user job limit enforcement</li>
</ul>
</div>
</div>
