README.html
<div id="outline-container-orga0a19d4" class="outline-3">
<h3 id="orga0a19d4"><span class="section-number-3">21.19.</span> Verify Accounting Persistence</h3>
<div class="outline-text-3" id="text-21-19">
<p>
Run:
</p>

<div class="org-src-container">
<pre class="src src-bash"><code>sacct
</code></pre>
</div>

<p>
Observed output:
</p>

<pre class="example" id="org05330ee">
JobID           JobName  Partition    AllocCPUS      State
22                 test      debug             4  COMPLETED
22.batch          batch                       2  COMPLETED
22.0              prted                       2  COMPLETED
</pre>

<p>
Purpose:
</p>

<p>
Validates:
</p>

<ul class="org-ul">
<li>persistent accounting</li>
<li>MPI runtime tracking</li>
<li>historical scheduler data</li>
<li>job execution tracking</li>
</ul>
</div>
</div>
<div id="outline-container-org4d29d9d" class="outline-3">
<h3 id="org4d29d9d"><span class="section-number-3">21.20.</span> IMPORTANT MPI Accounting Observation</h3>
<div class="outline-text-3" id="text-21-20">
<p>
Accounting tracks internal MPI execution hierarchy:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Entry</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">22</td>
<td class="org-left">main scheduler job</td>
</tr>

<tr>
<td class="org-right">22.batch</td>
<td class="org-left">batch execution step</td>
</tr>

<tr>
<td class="org-right">22.0</td>
<td class="org-left">MPI runtime launcher</td>
</tr>
</tbody>
</table>

<p>
This provides deeper scheduler visibility similar to production HPC
environments.
</p>
</div>
</div>
<div id="outline-container-orgc24cb26" class="outline-3">
<h3 id="orgc24cb26"><span class="section-number-3">21.21.</span> Final Validation State</h3>
<div class="outline-text-3" id="text-21-21">
<p>
After validation, the cluster successfully supported:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Feature</th>
<th scope="col" class="org-left">Status</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Multinode scheduling</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">MPI execution</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">LDAP authentication</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Shared filesystem</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Spack software stack</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Resource-aware scheduling</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">CPU affinity</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Accounting database</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Persistent accounting</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">QoS enforcement</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">CPU policy enforcement</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Runtime policy enforcement</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">User job limits</td>
<td class="org-left">Working</td>
</tr>

<tr>
<td class="org-left">Scheduler-side policy control</td>
<td class="org-left">Working</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org9b4c491" class="outline-3">
<h3 id="org9b4c491"><span class="section-number-3">21.22.</span> Validation Conclusion</h3>
<div class="outline-text-3" id="text-21-22">
<p>
The cluster successfully evolved from:
</p>

<pre class="example" id="orgf3d99e1">
basic educational scheduler
</pre>

<p>
into:
</p>

<pre class="example" id="orga29365b">
policy-aware production-like HPC infrastructure
</pre>

<p>
while maintaining:
</p>

<ul class="org-ul">
<li>scheduler stability</li>
<li>multinode MPI execution</li>
<li>resource-aware scheduling</li>
<li>persistent accounting</li>
<li>user policy enforcement</li>
<li>simplified administration</li>
</ul>

<p>
This now closely resembles the operational structure used in real HPC
centers and supercomputing environments.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-03-14 Sat 00:35</p>
<p class="author">Author: Cisco Ramon</p>
<p class="date">Created: 2026-05-26 Tue 15:07</p>
</div>
</body>
</html>
